{
  "0":{
    "id":"politifact11773",
    "text":"Republican attacks on transgendered Americans and the religious fight to keep gender a binary delineation took a turn for the bizarre this week when Virginia Republican Mark Cole filed a bill that would force schools to check the genitals of their students in order to ensure that they are using facilities reserved for their “anatomical sex:”\n\nLocal school boards shall develop and implement policies that require every school restroom, locker room, or shower room that is designated for use by a specific gender to solely be used by individuals whose anatomical sex matches such gender designation. Such policies may also provide that a student may, upon request, be granted access, to the extent reasonable, to a single stall restroom or shower, a unisex bathroom, or controlled individual use of a restroom, locker room, or shower. Any student who willfully and knowingly violates this section shall be liable for a civil penalty not to exceed $50. Civil penalties assessed under this section shall be paid into the Literary Fund. Any law-enforcement officer may issue a summons regarding a violation of this section.\n\nHe did not deign to inform us how this would be accomplished, but it’s hard to imagine any scenario that did not involve adults inspecting the genitals of children before using the bathroom. Notably, it also provides for stigmatizing transgendered children by isolating them in a single person bathroom, which the Department of Justice ruled in June was a violation of the student’s rights. It is a disgusting show of transphobia that has no place in our public schools; the GOP must accept that America is a multi-gendered, multi-ethnic nation, and no amount of perverted laws is going to change that.\n\nColin Taylor Opinion columnist and former editor-in-chief of Occupy Democrats. He graduated from Bennington College with a Bachelor's degree in history and political science. He now focuses on advancing the cause of social justice and equality in America. Latest Posts",
    "title":"Virginia Republican Wants Schools To Check Children's Genitals Before Using Bathroom",
    "description":"Republican attacks on transgendered Americans and the religious fight to keep gender a binary delineation took a turn for the bizarre this week when Virginia Republican Mark Cole filed a bill that would force schools to check the genitals of their students in order to ensure that they are using facilities reserved for their “anatomical…"
  },
  "1":{
    "id":"politifact13827",
    "text":"Whoopi Goldberg is in hot water after comments she made Wednesday regarding the Navy SEAL widow that was honored last night during President Donald Trump’s historical speech.\n\n“She was just looking for attention. These military widows love their 15 minutes in the spotlight”, Goldberg said.\n\n“If it were me I wouldn’t be able to leave the house. How can someone who is truly greiving go out there and be on TV. It just doesn’t make sense to me”\n\nAfter last night’s demonstration where several democrats in leadership roles refused to stand while the widow was being honored, Goldberg continues to make the point that liberals lack a significant amount of class.\n\n*** UPDATE- Anyone who believes this story or any other story on this website needs to read this post ***\n\n.",
    "title":"Whoopi Goldberg: Navy SEAL Widow was “Looking for Attention”",
    "description":"Whoopi Goldberg is in hot water after comments she made Wednesday regarding the Navy SEAL widow that was honored last night during President Donald Trump’s historical speech. “She was just looking for attention. These military widows love their 15 minutes in the spotlight”, Goldberg said. “If it were me I wouldn’t be able to leave …"
  },
  "2":{
    "id":"politifact13570",
    "text":"Washington, DC — A former Secret Service agent whose new book is quickly climbing Amazon’s best-seller charts, said he is concerned about the state of the country and says it is time the public knows the real truth about our Commander in Chief, Barack Obama.\n\nFormer agent, Paul Horner, in his new tell-all book “The Black House,” reveals what goes on inside the White House when the news cameras are turned off.\n\nIn an interview with CNN, Horner told Victor Berman that he is one-hundred-percent positive that President Obama is not only gay, but a radical Muslim as well.\n\n“Everyone on the inside knows that Obama is gay and a Muslim, it is common knowledge,” Horner said. “I saw many men coming and going from Obama’s room, at all hours. I would say a good portion of the men, over fifty-percent, were Muslim.”\n\n\n\n\n\nBerman: “In your book you talk about several rituals Obama preformed to unwind from his busy schedule. Can you elaborate on these for our viewers?”\n\nHorner: “When no one was around, except his security, Obama couldn’t wait to get out of his suit and into his Muslim tunic. He would wear it while praying to the prophet Muhammad throughout the day. During these prayer sessions he insisted that he not be disturbed.”\n\nBerman: “Your book spends a whole chapter devoted to the various “tortures” that Obama and the First Lady would subject you to. Can you explain?”\n\nHorner: “Because I was white, Obama would force me to listen to Diana Ross full volume, every day, at all hours of the night. It was horrible, I never got any sleep. This is one of the main reasons I finally had to quit.”\n\n\n\n\n\nBerman: “Can you give us any insight on Obama’s feelings towards the American people?”\n\nHorner: “He constantly made jokes about Americans, frequently referring to them as “mongoloids” and “idiots”. Christians were his favorite verbal punching bags. He has absolutely no respect for the Christian religion. I believe he actually hates Christians, and finds their ideology to be old fashioned and ignorant.”\n\nBerman: What is one of the things readers will find the most shocking?\n\nHorner: “Probably the sheer amount of men he welcomed into his bed quarters. I am in no way homophobic, but Obama’s insatiable lust for homosexual liaisons is like nothing I’ve ever witnessed. We’re talking 10-15 partners in a single day.”\n\nTo read more, pick up a copy of Horner’s book, The Black House, now available on Amazon and at your local bookstore.\n\nVIDEO: Secret Service Agent Says Obama Is Muslim & Gay In New Tell-All Book",
    "title":"Secret Service Agent Says Obama Is Muslim & Gay In New Tell-All Book",
    "description":"Washington, DC — A former Secret Service agent whose new book is quickly climbing Amazon’s best-seller charts, said he is concerned about the state of the country and says it is time the public knows the real truth about our Commander in Chief, Barack Obama."
  },
  "3":{
    "id":"politifact14947",
    "text":"Bill Clinton’s hitman has confessed to more than 60 murders carried out on the former President’s orders and another 40 on orders from his evil wife, Killary. The news, just picked up for a special edition of Hannity tomorrow, could unravel the evil empire once and for all.\n\nHis name is Wilshire Williams — or at least that’s the alias he’s used for more than 40 years. He was a low-level runner for the mafia until he was literally sold to Bill Clinton in exchange for 12 cases of confiscated Arkansas moonshine. Clinton was the State Attorney at the time. He and Williams, who was born Terrence Wilekenmeyer in Yonkers, became close.\n\nWilliams, who knows that while he was invited to their barbeques and kept comfortable and out of the spotlight for 40 years he was nothing but a tool, says that he is dying of pancreatic cancer and that he needs to go with a clean conscience. The intern at Fox that took the interview for Hannity told our reporter:\n\n“Wilekenmeyer is the real deal. He put three bullets in Vince Foster and two in Seth Rich. He tied up more loose ends than any other hitman in history.”\n\nThe interview with Williams, which should tape in the next day or two, will be pre-empted by a short radio interview on Hannity’s show tomorrow. Wilekenmeyer has cooperated with authorities and will not be arrested until after his stories can all be corroborated, which won’t be nearly fast enough to beat the cancer riddling his body. Doctors say he has less than a week to live.\n\nHopefully, all of the evidence this man says he has pans out and a dying declaration is enough. Not having your star witness among the living is how the Clintons have escaped prosecution for 40 years.",
    "title":"Bill Clinton’s Hitman Confesses On His Deathbed (SOURCE: HANNITY)",
    "description":"Bill Clinton’s hitman has confessed to more than 60 murders carried out on the former President’s orders and another 40 on orders from his evil wife, Killary. The news, just picked up for a special edition of Hannity tomorrow, could unravel the evil empire once and for all. His name is Wilshire Williams — or at least that’s the alias he’s used for more than 40 years. He was a low-level runner for the mafia until he was literally sold to Bill Clinton in exchange for 12 cases of confiscated Arkansas moonshine. Clinton was the State Attorney at the time."
  },
  "4":{
    "id":"politifact14517",
    "text":"About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC.\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.",
    "title":"UPDATE: Florida Governor Rick Scott Now Listed As &#8216;Critical&#8217; After Bizarre Hurricane Cleanup Accident",
    "description":"Scott&#8217;s prognosis isn&#8217;t good. (via: trendolizer.com)"
  },
  "5":{
    "id":"politifact14840",
    "text":"The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions.\n\nThese adverse events reported during post-approval use of Tripedia vaccine include idiopathic thrombocytopenic purpura, SIDS, anaphylactic reaction, cellulitis, autism, convulsion\/grand mal convulsion, encephalopathy, hypotonia, neuropathy, somnolence and apnea. Events were included in this list because of the seriousness or frequency of reporting. Because these events are reported voluntarily from a population of uncertain size, it is not always possible to reliably estimate their frequencies or to establish a causal relationship to components of Tripedia vaccine.\n\nIn this sense, it should be noted that:\n\nAcellular Pertussis Vaccine Concentrates (For Further Manufacturing Use) are produced by The Research Foundation for Microbial Diseases of Osaka University (BIKEN), Osaka, Japan, under United States (US) license, and are combined with diphtheria and tetanus toxoids manufactured by Sanofi Pasteur Inc. Tripedia vaccine is filled, labeled, packaged, and released by Sanofi Pasteur Inc.\n\nWhat’s in Tripedia that probably can interfere with brain chemistry and neurology?\n\nAccording to the Tripedia’s package insert, some ingredients include: Bovine extract, formaldehyde used to inactivate microorganisms a couple of times, ammonium sulfate, aluminum potassium sulfate and two growth mediums: modified Mueller and Miller is one; the other is Stainer-Scholte medium.\n\nWhat is the content of these two growth mediums?\n\nMueller and Miller medium, contains:\n\nGlucose, sodium chloride, sodium phosphate dibasic, monopotassium, phosphate, magnesium sulfate hydrate, ferrous sulfate heptahydrate, cysteine hydrochloride, tyrosine hydrochloride, uracil hydrochloride, Ca-pantothenate in ethanol, thiamine in ethanol, pyridoxine-hydrochloride in ethanol, riboflavin in ethanol, biotin in ethanol, sodium hydroxide, beef heart infusion (de- fatted beef heart and distilled water), casein [milk protein] solution. Basically a mixture of sugar, salt, amino acids, vitamins, and minerals.\n\nWhile Stainer-Scholte medium has the following ingredients:\n\nTris hydrochloride, tris base, glutamate (monosodium salt) [MSG], proline, salt, monopotassium phosphate, potassium chloride, magnesium chloride, calcium chloride, ferrous sulfate, ascorbic acid, niacin, glutathione.\n\nThe vaccine is formulated without preservatives, but contains a trace amount of thimerosal [(mercury derivative), (≤0.3 μg mercury\/dose)] from the manufacturing process. Each 0.5 mL dose also contains, by assay, not more than 0.170 mg of aluminum and not more than 100 μg(0.02%) of residual formaldehyde. The vaccine contains gelatin and polysorbate 80 (Tween-80), which are used in the production of the pertussis concentrate.\n\n“Probable cause” ingredients for adverse reactions include: casein, to which some children are allergic; MSG—an excitotoxin; thimerosal-ethyl mercury; aluminum; formaldehyde; gelatin; and polysorbate 80.\n\nYou might be wondering:\n\nWhy the doctors don’t say anything about the risk of DTaP Vaccine?\n\nThat is a question that many of us, still wondering! Maybe they just is just not convenient for them that we know about the risk of these vaccine\n\nTo take the vaccine debacle further, most of the mandated vaccines for infants and children, contain many of the above ingredients, which must be stopped from being injected into infants, toddlers, teens and even adults!\n\nIt’s time for Congress to rescind the “Get out of Jail Free” card for vaccine makers and stop the aggressive onslaught of the Autism Spectrum Disorder that is depriving children of a fulfilling life and ruining families emotionally, financially, and physically to the point of parents divorcing because of the stresses of ASD in a family.\n\nIt’s about time vaccines are publicly acknowledged by the feds and the media for all the health damages they have caused. Just check out the CDC’s VAERS reports and the vaccine damage payouts by the HHS\/HRSA. According to a new report published on March 1, 2017, by the department of health and human services of the United States, about $ 3,363,282,409.21 have been paid for vaccine adverse reactions and deaths from 1989 to 2017 so far.\n\nTo conclude, what do you think about this? Tell us in the comment section below.\n\nThanks for reading and Share if You Care!\n\nsource: :naturehealthandbeauty.com",
    "title":"NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism!",
    "description":"The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions. These adverse events reported during post-approval use of Tripedia vaccine..."
  },
  "6":{
    "id":"politifact15205",
    "text":"Full dental implant and tooth extraction is a normal technique for Drs. Drake and Jacobson, however in a few occasions, a crisis tooth extraction might be called for. The methodology incorporates:\n\ndentist near me Full dental implant appraisal of the anesthesia and sedation alternatives that will best serve your necessities, considering a torment free, crisis tooth extraction keeping in mind the end goal to save basic are best dentist near me are taken are most are dental implants are taken are best general oral Full dental implant and agreeable for our patients as conceivable by keeping you very much educated, mindful of what is occurring, and mindful are easy and using are making are safe are best dental implant Full dental implant of what your decisions are en route not as much as essential experience\n\nAfter the tooth has been removed,and Full dental implant Jacobson will have you clamp down on some dressing keeping in mind the end goal to help stop the dying, with the goal that a blood coagulation Full dental implant can frame.\n\nTell your friends about This - SHARE NOW",
    "title":"Robert Redford Says: Michelle And Barack Obama Should Get Five Years In Prison",
    "description":"Full dental implant and tooth extraction is a normal technique for Drs. Drake and Jacobson, however in a few occasions, a crisis tooth extraction might be called for. The methodology incorporates:\n\ndentist near me Full dental implant appraisal of the anesthesia and sedation alternatives that will"
  },
  "7":{
    "id":"politifact13912",
    "text":"Paul Ryan may be the Speaker of the House and he may be third in the line of succession for the presidency, but he will no longer be welcome at the White House nor will he be included in plans for the future. According to a statement released by Jeff Derpinger at the WHOIP:\n\nPresident Trump will no longer protect, defend or endorse anything the soon-to-be-former Speaker does, says or campaigns on. The betrayal of Paul Ryan and his subsequent dismissal as an advisor to the president and his upsoming loss in the election in 2018 is his own fault. Let this be a lesson to the rest of Congress: Donald Trump is your chief executive. He deserves your support and respect. Anything other than that will result in your removal from office by campaigning against you and in the best interest of the American people. Only President Trump knows what it takes to win. Fall in line or pack your bags.\n\nRyan’s office has asserted that he can not be “fired” by President Trump but has also expressed remorse for the events that led up to the secret tape recently released by Breitbart:\n\nSpeaker Ryan was just as shocked as the rest of the world at Donald Trump’s statement about women and pussy grabbing. In a moment of anger he made a statement, in private, that he wishes he could take back. Perhaps Mr. Trump can relate.\n\nRelate? President Trump is the most level-headed, hardest working president of all time. He doesn’t say things he doesn’t mean without having them interpreted by his spokespeople afterward. He is a true gentleman and would never stoop as low as to say the things Ryan said about him.\n\nThis isn’t about a few words being said, this is about class and respect. Trump has those things. Ryan does not. Trump let him know that when he visited a congressional luncheon this afternoon. He walked right over to the Speaker, refused to shake his hand and instead put a finger in his face and said:\n\n“Mr. Speaker…You’re fired.”\n\nAnd that, as they say, is that.",
    "title":"BREAKING: President Trump Just Told Paul Ryan ‘You’re Fired’",
    "description":"POTUS walked right up to Ryan at a luncheon and let him know he was finished."
  },
  "8":{
    "id":"politifact14285",
    "text":"10:30 pm last night police received a call about gun fire in Miami Gardens.Manager killed 10 employees because they was stealing money and tons of supplies.",
    "title":"Manager killed 10 employees at checkers on 183st and 27ave",
    "description":"10:30 pm last night police received a call about gun fire in Miami Gardens.Manager killed 10 employees because they was stealing money and tons of supplies."
  },
  "9":{
    "id":"politifact14311",
    "text":"(Jim Lo Scalzo for USN&WR)\n\n1. One of six children (and the only daughter), Nancy (Patricia D'Alesandro) Pelosi was born on March 26, 1940, and grew up in Baltimore's Little Italy.\n\n2. Pelosi's father, Tommy D'Alesandro, was a legendary Democratic congressman and Baltimore mayor. Her brother Thomas would also go on to become mayor of Baltimore.\n\n3. Seemingly, Pelosi was a Democrat from birth—as a young girl, she was offered a toy elephant by a Republican poll worker but recoiled, refusing the toy.\n\n4. A devout Catholic, Pelosi attended a Roman Catholic women's college, Trinity College, in Washington, D.C., where she met her future husband, Paul Pelosi, who was attending Georgetown. They eventually relocated to his hometown, San Francisco.\n\n5. Pelosi is mother to five—Nancy Corinne, Christine, Jacqueline, Paul, and Alexandra, all born within six years—and grandmother to five.\n\n6. Although active in politics her whole life—including stints as a leading Democratic fundraiser and chairwoman of the party in California—Pelosi didn't run for office until she was 47, preferring to wait until the youngest of her five children was a high school senior before running for Congress in 1987.\n\n7. Republican National Committee Chairman Ken Mehlman said that she was neither a \"new Democrat\" nor an \"old Democrat\" but a \"prehistoric Democrat.\" Other Republicans call her a \"latte Democrat\" for her politically progressive views on the environment, women's reproductive rights, labor unions, and other issues.\n\n8. Pelosi has been a formidable force within the Democratic Party, raising more money than any other congressional Democrat–around $100 million since taking the reins of party leadership. And she has managed to keep the House Dems toeing the party line: According to Congressional Quarterly, House Democrats voted with the majority of their party 88 percent of the time in 2005, the highest total since CQ started keeping track in 1956.\n\n9. Pelosi learned the art of politics from her father, a practitioner of old-school politics. To practice her penmanship, \"Little Nancy\" was in charge of the book in which her New Deal father kept track of favors done and owed.\n\n10. A true San Franciscan, Pelosi makes sure that her office is stocked with Ghirardelli chocolates. Her diet typically consists of mostly chocolate and chocolate ice cream. Completing the notoriously challenging New York Times crossword puzzle is one of her favorite hobbies.\n\nSources:",
    "title":"10 Things You Didn't Know About Nancy Pelosi",
    "description":"10 interesting facts about the first female Speaker of the House."
  },
  "10":{
    "id":"politifact14756",
    "text":"A new book by Donna Brazile, the former interim chairwoman of the Democratic National Committee (DNC), has been making headlines for its controversial claims about the 2016 presidential election and the Hillary Clinton campaign. But the provocative points start even before the first chapter, as Brazile reportedly dedicated the book in part to Seth Rich, the DNC staffer whose murder launched a conspiracy theory.\n\nAxios reported on Sunday that the book's dedication reads, “In loving memory of my father, Lionel Brazile Sr.; my beloved sister, Sheila Brazioutlanle; my fearless uncles Nat, Floyd, and Douglas; Harlem’s finest, my aunt Lucille; my friend and mentor, David Kaufmann; my DNC colleague and patriot, Seth Rich; and my beloved Pomeranian, Chip Joshua Marvin Brazile (Booty Wipes). I miss y’all.”\n\nRelated: TV Ad With Russian Subtitles Questions Seth Rich’s Murder\n\nKeep up with this story and more by subscribing now\n\nRich, 27, was fatally shot in July 2016 while walking home late at night in Washington, D.C. The police believe the shooting was a robbery gone wrong. But Rich worked for the DNC, and WikiLeaks published thousands of emails from the committee two weeks after his death. That timeline provoked theories that Rich had given the materials to WikiLeaks and that his death was an attempt to stop him from doing so, or to punish him for it.\n\nMedia reports had characterized Rich as a low-level staffer, and his parents wrote in an opinion piece for The Washington Post in May, “Those who have suggested that Seth’s role as a data analyst at the DNC gave him access to a wide trove of emails are simply incorrect.”\n\nSAUL LOEB\/AFP\/Getty\n\nRich appears elsewhere in Brazile’s book, as the Post reported earlier in the weekend. She wrote that Rich’s murder haunted her and that she'd installed surveillance cameras at her home and would keep the blinds in her office window closed so she could not be seen by snipers, according to the Post.\n\nBrazile talked about Rich on ABC News’s This Week with George Stephanopoulos on Sunday. She told the host about her critics: “They don’t know what it was like to be over the DNC during this hacking. They don’t know what it’s like to bury a child. I did: Seth Rich.”\n\nBrazile had spoken publicly about Rich’s death before. In March, she said she was going to an Omaha, Nebraska, synagogue to speak about him. In May, she tweeted, “Seth Rich was a hard worker and proud to be an American. This desire to scar Seth’s legacy to his country and party is shameful.” About two months later, after Fox News published a since debunked story about the case, she tweeted, “Seth was a good soul and look at this shameful act.”\n\nThrough spokesman Brad Bauman, the Rich family said in a statement, “Since Seth was murdered, Donna Brazile has been a great friend to the Rich family and has been extremely supportive of the family’s efforts to find Seth’s killers.”\n\nIn the book, out Tuesday, Brazile also writes that she weighed the possibility of replacing Clinton as the Democratic presidential nominee with former Vice President Joe Biden, according to the Post. She also reportedly wrote that Clinton’s campaign headquarters seemed “antiseptic, like a hospital,” and that she felt as though the Clinton campaign was treating her like a “slave.” In an excerpt that Politico published on November 2, she wrote about how the Clinton campaign worked out a fundraising agreement with the DNC and exercised control over the party long before Clinton became the nominee.\n\nFormer aides to the Clinton campaign have challenged Brazile’s claims. In a November 4 open letter, more than 100 former top aides wrote, “It is particularly troubling and puzzling that she would seemingly buy into false Russian-fueled propaganda, spread by both the Russians and our opponent, about our candidate’s health.”\n\nBrazile was not available for comment through her publisher, Hachette Book Group, or through Georgetown University, where she is a faculty member. The publisher was unavailable to verify the reported wording of the book dedication.",
    "title":"DNC’s Donna Brazile Dedicated Her Book to ‘Patriot’ Seth Rich, Whose Death Made Her Fear for Her Own Life",
    "description":"Rich’s mysterious death was the subject of conspiracy theories."
  },
  "11":{
    "id":"politifact13815",
    "text":"300,000 Pounds of Counterfeit Rat Meat Has Been Sold as Chicken Wings in The U.S. ACTIONNEWS3.COM – The Food and Drug Administration (FDA) is concerned about an estimated 300,000 pounds of counterfeit rat meat that has been sold as chicken...",
    "title":"300,000 Pounds of Counterfeit Rat Meat Has Been Sold as Chicken Wings in The U.S.",
    "description":"ACTIONNEWS3.COM – The Food and Drug Administration (FDA) is concerned about an estimated 300,000 pounds of counterfeit rat meat that has been sold as chicken..."
  },
  "12":{
    "id":"politifact15347",
    "text":"Bill Gates has doubled down on his goal to depopulate the planet, using deceitful Orwellian doublespeak in a new video to bamboozle his naive followers into believing that “by making people healthier, we can reduce the world’s population.”\n\nMake no mistake, when Gates talks about “making people healthier,” what he is really talking about is enforcing the mandatory roll out of his range of experimental vaccinations. The same vaccines that have already caused mass sterilization and death on multiple continents.\n\nThe second-richest man on the planet is a committed globalist and eugenicist working towards the New World Order goal of depopulation. Lest anyone forget these facts, Bill Gates regularly goes out of his way to remind us of them.\n\nBill Gates and his foundation have consistently come under fire for their goal of depopulation, and now the same man who admitted in a TED talk that his goal is to eliminate a billion humans from the face of the earth has now taken to Facebook to lecture us about why being eradicated is in our own interests.\n\nThe irony of Bill Gates’ faux concern for the human race is almost laughable. India, however, may not find it so funny.\n\nLast year, India’s National Technical Advisory Group on Immunization announced that it would be banning the Gates Foundation from operating in the country after it was revealed that the vaccines the foundation had been promoting “to make people healthier” were actually doing irreparable harm to young girls — and that the Gates Foundation “campaigns” were actually “experimental trials of the vaccines.”\n\nMainstream investigators have found that these vaccine trials in India led to thousands of injuries and deaths of young women.\n\nThe “philanthropist” has also funded secretive sterilization programs, and says we should form death panels to differentiate between those who are worthy of life and those who “have no benefit whatsoever” to society. This cold, skewed psychopathic “logic” is terrifying and brings to mind the worst excesses of the 20th century’s most evil regimes.\n\nNow we are starting to see the horrific results of Gates’ depopulation agenda playing out around the world.\n\nKenya doesn’t find his Gates’ fake concern for the human race amusing either. In September of 2017 it was reported that at least 500,000 young Kenyan girls and women have been made sterile, following a tetanus vaccine administered by the government, and pushed by the international organizations in Bill Gates’ back pocket:\n\n“Today, we can confirm to the country that the Catholic Church was right. Hundreds of thousands of our girls and women, aged between 14 and 49, from the fastest growing populations in the country will not have children, because of the state-sponsored sterilization that was sold to the country as tetanus vaccination,” Kenyan opposition leader Raila Odinga declared.\n\nGates, who has $23m of shares in Monsanto, is responsible for widespread vaccination programs which have been linked to outbreaks of disease in South America and the Ebola epidemic in West Africa. GMOs and vaccinations have both been linked to human illness and death, even though Big Pharma and Big Ag continue to deny the undeniable correlations.\n\nLet’s ask ourselves this: If Gates is focused on his goal of reducing the number of people on our planet, why would he then fund vaccination programs to save lives?\n\nNone of this makes any sense, unless the vaccinations are not meant to save lives at all.\n\nLike this: Like Loading...",
    "title":"Bill Gates Outlines 2018 Plan To Depopulate The Planet",
    "description":"Bill Gates has doubled down on his goal to depopulate the planet, using deceitful Orwellian doublespeak in a new video to bamboozle his naive followers into believing that “by making people healthier, we can reduce the world’s population.” Make no mistake, when Gates talks about “making people healthier,” what he is really talking about is … Continue reading \"Bill Gates Outlines 2018 Plan To Depopulate The Planet\""
  },
  "13":{
    "id":"politifact14896",
    "text":"Yes, you can transfer your domain to any registrar or hosting company once you have purchased it. Since domain transfers are a manual process, it can take up to 5 days to transfer the domain.\n\nDomains purchased with payment plans are not eligible to transfer until all payments have been made. Please remember that our 30-day money back guarantee is void once a domain has been transferred.\n\nFor transfer instructions to GoDaddy, please click here.",
    "title":"BlueDotDaily.com is for sale",
    "description":"Get a new domain name for your startup. Quick and professional service. Seamless domain transfers."
  },
  "14":{
    "id":"politifact14878",
    "text":"82-Year-Old Killed a Migrant In Self-Defense And Get Death Penalty.. Do You Agree With This?",
    "title":"Julia Roberts Claims ‘Michelle Obama Isn’t Fit to Clean Melania’s Toilet’",
    "description":"First Lady Melania Trump has been “looked down upon and disrespected by sneering liberals across the country” while “doing a brilliant job” according to Julia Roberts, who also declared that former First Lady Michelle Obama"
  },
  "15":{
    "id":"politifact13731",
    "text":"The Bodybuilding community has long coveted the best performance-enhancing drug to boost muscle growth and improve energy levels. For starters, you have dbols, one of the most popular steroids today. It has also been said that this steroid can be found in muscle cells in as little as 6 hours after injection. Bodybuilders use this drug because it has an anabolic effect on muscle proteins. It speeds up protein synthesis and cures some minor health issues.\n\nThis muscle catalyst is also known to promote the growth of new muscle tissue. However, its effects can last up to two weeks, making it a popular choice among bodybuilders. This steroid has also been shown to improve nitrogen balance and enhance recovery from training. It also provides an increase in lean body mass as well as bone density. Here is the list of the best performance-enhancing drugs for bodybuilding:\n\nAnabolic Drugs Or Steroids\n\nAnabolic drugs or steroids are involved in building and maintaining muscles. The steroid substances that promote muscle tissue growth are, in fact, precursors to basic hormones. The pituitary gland produces anabolic hormones. It is controlled by a hormone gland located at the base of the brain.\n\nThese hormones control several functions such as; metabolism and protein synthesis. When you take this steroid, it will help you to gain muscle, strength, and stamina. This dbols supplement also plays an important role in building muscle and bones through stimulating protein.\n\nBeta-2 Agonists\n\nThese synthetic drugs help expand the lungs’ capacity, which means more oxygen is forced into your bloodstream. This, in turn, will increase metabolism rates and build lean muscles. These drugs are used during training sessions and events where a bodybuilder will be working out. The Beta-2 Agonists allow the body to burn more carbohydrates, and at the same time, they help you to use fat as energy. It also provides great energy that helps to reduce fatigue, stress, and anxiety.\n\nHuman Growth Hormone\n\nAlso referred to as HGH, this drug has increased lean muscles. Human Growth Hormone is a hormone produced in the pituitary gland responsible for growth during childhood. It remains active the whole life and can be stimulated by taking HGH. In addition, testosterone and other human growth hormone are factors that lead to building muscle. Athletes who take this drug have an increase in insulin which is also an indirect anabolic effect of HGH.\n\nEphedrine\n\nBodybuilders have used ephedrine for a long time. It has been around there for so long because of its ability to burn fat, boost metabolism, and enhance physical performance. Ephedrine is a popular drug for bodybuilders because it can be helpful while training and events to burn fat and increase muscles.\n\nMethenolone\n\nMethenolone is another popular steroid that is considered to be milder than most. Athletes use it for its potency in enhancing recovery time and prevention of injury. This steroid has also been used to increase muscle size and strength. It has the specialty of recovering the injury, whether external or internal. That is why athletes and sports people mostly consume it.",
    "title":"Historical blog about Seattle, as well as the state of affairs today. Many facts that interest you as well as an open news portal and discussion forum. Support your native Seattle.",
    "description":"Tribune"
  },
  "16":{
    "id":"politifact14991",
    "text":"Rep. Joe Kennedy III (D-MA) claimed the host-city of his response to President Donald Trump’s State of the Union address, Fall River, Massachusetts was “built by immigrants.”\n\nFact-Check: MOSTLY FALSE\n\nWhat is now Fall River was first established in the 1600s by English settlers who were not “immigrants” but colonists. A native-born family, the Bordens ran a mill in what became the town for generations before and after the American revolution. Industrialization began when Col. Joseph Durfee, a native-born Revolutionary War hero built the first factory in 1811. Later, at the end of the 19th Century a wave of immigrants swelled the town’s population. Immigrants, however, never made up a majority of the population of Bristol County, where Fall River lies, even at their early 20th Century peak.",
    "title":"Fact-Check: No, Fall River, Massachusetts, Was Not ‘Built by Immigrants’",
    "description":"Rep. Joe Kennedy III (D-MA) claimed the host-city of his response to President Donald Trump's State of the Union address, Fall River, Massachusetts was \"built by immigrants.\""
  },
  "17":{
    "id":"politifact14330",
    "text":"The Clintons are good at one thing: Keeping secrets. Their entire lives are shrouded in mystery, murder, deception and crime. They wouldn’t know the truth if it bit them in the hiney. In the case of Slick Willy’s secret airplane meeting with then-Attorney General Loretta Lynch, the secret was supposedly already out.\n\nNot true, says a reporter for the Baltimore Morning News, who has obtained a copy of a paperwork required by the state of Maryland intended to be a backup system to terrorism checks for private planes. In this case, the information logged showed that Loretta Lynch and one passenger made the trip that ended with the meeting in the hangar that both Clinton and Lynch say was a happenstance encounter with no substance.\n\nSo…who was the passenger? With no point of origin paperwork or public flight plan needed for someone with such high clearance, the only evidence is the Maryland manifest, which says the former AG showed up to meet with Bill Clinton accompanied by Speaker Paul Ryan.\n\nWhat would Paul Ryan, Loretta Lynch and Bill Clinton be doing meeting in July, before the election, in a hangar outside of Baltimore? Theories are beginning to mount but the feeling is that Bill Clinton was negotiating for his wife and the DNC, while Ryan was looking out for the RNC and Lynch was the mediator. They were most likely conspiring to throw a wrench in the juggernaut that was the trump campaign. It didn’t work.\n\nThe other possibility is that they made a deal for Hillary’s freedom at the expense of an embarrassing national election loss. Would Hillary Clinton sacrifice the Democrat party, which is now basically defunct, for a few years of freedom before she finally gags on her own sins and dies? You bet she would.\n\nNow the question is: Did anyone do anything illegal? Ryan certainly could face an investigation into his professional ethics if nothing else. He’s the Speaker of the House. He doesn’t make policy, he leads the body that makes policy. Big difference.\n\nSOURCE",
    "title":"BREAKING: There Was Someone Else On That Plane For The Secret Bill Clinton\/Loretta Lynch Meeting",
    "description":"The Clintons are good at one thing: Keeping secrets. Their entire lives are shrouded in mystery, murder, deception and crime. They wouldn’t know the truth if it bit them in the hiney. In the case of Slick Willy’s secret airplane meeting with then-Attorney General Loretta Lynch, the secret was supposedly already out. Not true, says …"
  },
  "18":{
    "id":"politifact14777",
    "text":"The state of Michigan is quickly turning into a Sharia swamp, thanks to the reckless immigration policies of Obama over the past 8 years. Not only are portions of Michigan being transformed into a “mini Baghdad,” but the state is also being overrun with rampant illegal activity, where the Muslim populace is constantly being busted in welfare fraud and disgusting mutilation practices on little girls. Now thanks to the hordes of Muslims taking over the state, Michigan can add another “accomplishment” on their list, as the Justice Department is dubbing what just went down in this state the “largest scam in United States history.”\n\n\n\nIt is my sincere desire to provide readers of this site with the best unbiased information available, and a forum where it can be discussed openly, as our Founders intended. But it is not easy nor inexpensive to do so, especially when those who wish to prevent us from making the truth known, attack us without mercy on all fronts on a daily basis. So each time you visit the site, I would ask that you consider the value that you receive and have received from The Burning Platform and the community of which you are a vital part. I can't do it all alone, and I need your help and support to keep it alive. Please consider contributing an amount commensurate to the value that you receive from this site and community, or even by becoming a sustaining supporter through periodic contributions. [Burning Platform LLC - PO Box 1520 Kulpsville, PA 19443] or Paypal\n\n-----------------------------------------------------\n\nTo donate via Stripe,\n\n-----------------------------------------------------\n\n-----------------------------------------------------It is my sincere desire to provide readers of this site with the best unbiased information available, and a forum where it can be discussed openly, as our Founders intended. But it is not easy nor inexpensive to do so, especially when those who wish to prevent us from making the truth known, attack us without mercy on all fronts on a daily basis. So each time you visit the site, I would ask that you consider the value that you receive and have received from The Burning Platform and the community of which you are a vital part. I can't do it all alone, and I need your help and support to keep it alive. Please consider contributing an amount commensurate to the value that you receive from this site and community, or even by becoming a sustaining supporter through periodic contributions. [Burning Platform LLC - PO Box 1520 Kulpsville, PA 19443] or Paypal-----------------------------------------------------To donate via Stripe, click here ----------------------------------------------------- Use promo code ILMF2, and save up to 66% on all MyPillow purchases. (The Burning Platform benefits when you use this promo code.)\n\nMuslims continually prove that they have little intentions into assimilating into western civilization or adhering to our nation’s laws after arriving to America from their third world countries. Our generosity to these savages is frequently repaid by insolence, as many Muslims are constantly busted at the center of welfare fraud rings, as they seek to scam the very country who has given them so much. In yet another case of blatant disregard for for our nation’s laws, a group of Muslim doctors in Detroit have just been busted as the masterminds behind a $1.3 billion dollar fraudulent scheme, leading to the arrests of 412 people overnight, in the “largest scam” that the United States Department of Justice has ever seen.\n\nThe scam involves a scheme where Muslim doctors will write massive quantities of prescriptions for opioids. These drugs never land in the hands of patients however, as the Muslims will them make fraudulent claims to Medicaid and pocket the money. Additionally, the drugs often wind of on the streets as part of a huge back-alley drug operation. The U.S. Justice Department is calling this prescription drug and health care fraud scheme the largest operation of its kind in American history, naming several Michigan Muslim doctors responsible for orchestrating this huge criminal enterprise to rip off Medicare. ClickonDetroit.com has more:\n\n“Officials have made 412 arrests nationwide, including 56 doctors and targeting 200 clinics. The Justice Department said those arrested are responsible for $1.3 billion in fraudulent transactions.\n\nFederal officials said a group of Michigan doctors was responsible for a major chunk of the scheme.\n\nOne of the clinics hit in the sting operations is in Farmington. Federal officials said the opioid epidemic is part of it, but the medical office and a number of others were set up specifically as a criminal enterprise to rip off Medicare.\n\nFederal officers raided the Fisher Building Wednesday, and U.S. Attorney General Jeff Sessions said their work accounted for 10 percent of the scam’s value.\n\n‘Six doctors in Michigan prescribed patients with unnecessary opioids, some of which ended up for sale on the streets,’ Sessions said.\n\nA physician group called Global Quality used to operate out of a Woodward Avenue office building.”\n\nThe ring leader of the massive Medicare scam is Muslim Mashiyat Rashid, who profited with an astounding $164 million from the fraud. He had had no qualms about rubbing the American taxpayers’ noses in what he stole from them, frequently bragging about his large piles of cash on social media. Here’s an image he posted on Facebook where he poses beside his Bentely sedan and corporate jet…all bought and paid for with the Medicare money he scammed from the American taxpayer.\n\nOther nauseating pictures show Rashid standing at the NBA finals with his court-side tickets, enjoying a life of opulence he enjoyed while screwing over the American people. Rashid’s name is included in court documents as Feds prepare their case for trial, where Muslim doctors Joseph Betro, Spilios Pappas, Abdul Haq, Tariz Omar and Mohammad Zahoor were busted working directly with Rashid in recent years to make their millions.\n\nMore than 400 others across the country were charged late last week for taking part in the health care scam in connection with a raid last week at the Fisher Building in Detroit. Other Muslim defendants include:\n\nMashiyat Rashid, of Oakland County – controlled, owned or operated Global Quality, Aqua Therapy, Tri-County Physicians, Tri-State Physicians, New Center Medical, National Laboratories, and Tri-County Wellness;\n\nYasser Mozeb, of Oakland County – allegedly received payments from Global Quality and Tri-County Wellness;\n\nAbdul Haq, of Washtenaw County, physician enrolled as a participating provider with Medicare for Aqua Therapy, Tri-County Physicians and Tri-State Physicians;\n\nJoseph Betro, of Oakland County, physician enrolled as a participating provider with Medicare for Tri-County Physicians and New Center Medical;\n\nTariz Omar, of Oakland County, physician enrolled as a participating provider with Medicare for Tri-County Physicians.\n\nMohammed Zahoor, of Oakland County, physician enrolled as a participating provider with Medicare for Tri-County Physicians.\n\nTrump’s Justice Department isn’t messing around, as the defendants are being brought up on a plethora of federal charges, including five counts of health care fraud and health care fraud conspiracy. Rashid has additionally been charged with conspiracy to defraud the United States and money laundering, receipt of kickbacks in connection with a federal health care program, and payment of kickbacks in connection with federal health care program. In all, investigators say that Rashid’s companies’ fraudulently billed Medicare $126 million, with a total of $1.3 billion in similar scams across the country.\n\nWe must continue to sound the alarm about what’s going right underneath our noses. This isn’t the first time that Muslims have ripped off Americans with fraud, and with the hordes of migrants that liberals keep fighting to bring into our country, stories like this will sadly become the new norm if the American people do not wake the hell up soon!",
    "title":"412 Michigan Muslims Arrested In Fed’s ‘LARGEST BUST IN U.S. HISTORY’",
    "description":"Hat tip Yojimbo Guest Post by Prissy Holly The state of Michigan is quickly turning into a Sharia swamp, thanks to the reckless immigration policies of Obama over the past 8 years. Not only are por…"
  },
  "19":{
    "id":"politifact15525",
    "text":"It was June 2014 when the Washington Post reported that illegal immigrants, “including thousands of women and children, stream into south Texas. It was nine months late when the same paper reported that Obama’s border agents were tossing some of those kids into internment camps as an experiment.\n\nIt was called the Juvenile Referral Process, and it worried human rights groups Mexican officials who feared that it put the kids at risk. The program was the creation of Robert Harris who at the time U.S. Customs and Border Protection commander of the Laredo sector. Harris believed holding certain young Mexicans, believed to be working for cartels in detention serves to get these kids out of the smuggling enterprise. Believed is the operative word, There were no judges, no charges– no trial–just belief.\n\nHis intelligence analysts estimated that 78 percent of the guides smuggling other migrants were Mexicans younger than 18 — teenagers often hired or conscripted by drug cartels that knew they would not be prosecuted if caught — and he wanted to attack this loophole. “Why don’t we remove these juveniles from the smuggling cycle?” Harris, the outgoing commander of the Laredo sector of U.S. Customs and Border Protection, recalled thinking. Now, as a result of that decision, young Mexicans are being held for months without charge in shelters across the United States, sometimes without their parents’ knowledge. Since the program began in May, 536 juveniles have been held — 248 of whom have been deported to Mexico after an average stay of 75 days, according to Border Patrol statistics. Mexican authorities say some of these repeat border-crossers have spent as much as six months in U.S. custody while they await an appearance before an immigration judge. During their detention, they are questioned by U.S. authorities and then transferred to a network of facilities run by the Office of Refugee Resettlement, part of the Department of Health and Human Services, across 15 states.\n\nLets put this in perspective, under Trump children are separated from their parents because they don’t want the kids going to jail with their parents. Under Obama, young illegal immigrants were put in “facilities” so they could be squeezed for any information they may or may not have about drug cartels.\n\n“Our concern is that the program’s real intent is to interrogate the kids,” said Maureen Meyer, an expert on Mexico and migrants at the Washington Office on Latin America (WOLA). The kids are “often questioned about the criminal groups they are working for and then subsequently returned to Mexico with no apparent concern about the implications for them.” While in custody last year [2014], one Mexican boy who worked as a guide shared information with U.S. authorities about the location of stash houses used by migrants as they move through the United States, according to his lawyer’s written summary of his case. When he returned to Mexico, he learned that armed men had forced their way into his home and killed a relative’s son. The men told the family that there had been raids on cartel hideouts and arrests and that they believed the boy was responsible. His half-brother was later killed by the same group. The boy, his lawyer said, has since been in hiding. Harris said the Border Patrol does not have a system to track what happens to the juveniles once they return to Mexico. The program does appear to be discouraging them from returning illegally to Texas, he said. The patrol calculates that just 7 percent of the children who have gone through the program has been picked up again crossing the border.\n\nBut the program was a surprise to Mexico\n\n“The moment it started, it took us all by surprise, because there wasn’t an announcement,” said Reyna Torres Mendívil, director general of the Mexican Foreign Ministry’s office for protection of Mexicans abroad. “Where were they taking these children?”\n\nRegarding preventing kids from becoming repeat offenders, the Juvenile Referral Process worked, But why is it okay to incarcerate kids based on a belief without a judge or knowledge of their parents? The only reason I can think of is that a program to detain kids is okay under a Democratic Party president, but preventing kids from going to jail with their parents is considered unAmerican when the president is a Republican.\n\nBelow is a video of an Illegal Immigrant child detention center published in July 2014.\n\n﻿\n\nNote: The picture in the post may or may not be of the Mexican children discussed above. Based on the Washington Post we know that the detention center in McAllen, TX was one of the locations used and July 2014 is during the active period of the Juvenile Referral Process.\n\nillegal immigrants\n\nillegal immigrants\n\nillegal immigrants",
    "title":"Obama Administration Kept Illegal Mexican Kids In Detention Camps As “Experiment”",
    "description":"Obama's border agents were tossing some child illegal immigrants into internment camps as an experiment, without charges, judges, or a trial"
  },
  "20":{
    "id":"politifact14490",
    "text":"About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC.\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.",
    "title":"BREAKING NEWS: Prince William and Harry donates $100 million to Hurricane Harvey Victims",
    "description":"Hurricane Harvey has devastated communities across southeast Texas since slamming the coastline late Friday, ripping apart homes, deluging highways, and knocking out power for hundreds of thousands\n\nIt appears Prince William and his younger brother Harry is living up to expectation. By way of fina (via: trendolizer.com)"
  },
  "21":{
    "id":"politifact15626",
    "text":"Clint Eastwood says his doctors have put him on notice to get his affairs in order and prepare for that final trip in one of those limousine station wagons we call a hearse. The famous actor, 89, says he’ll be lucky to see 2019:\n\n“I’ve had a good run. They say I’m probably gonna be on the list of dead people at the awards show next year. Me and that damned empty chair. Guaranteed. Why can’t folks just let that go?”\n\nEastwood, always in good spirits, says that he’s made a good life for his family and taken care of them with trust funds, homes and large insurance policies and that he’d like to see his personal estate go to something…bigger:\n\n“I have been able to sit here in this magnificent ranch watching as President Trump made America great again in just a few months. He’ll persevere through the witch hunt and I will do what I can to make his journey easier.”\n\nEastwood is donating his Northern California ranch, 40K acres of grazing land in Nevada and more than $7 million in cash and other assets to Trump’s 2020 campaign. The campaign has said they will be delighted to accept the donation and will use the ranch as a command center for the entire Pacific Northwest:\n\n“We’ll be able to sit up there, far from the prying eyes of Obama and the deep state and the deep levels of corruption still inside the Justice department and FBI, and strategize without worrying about being called before a federal prosecutor for it.”\n\nClint Eastwood will be remembered for a lot of things after he’s gone, but this may be the biggest. Thanks for a lifetime of entertaining us, Clint!",
    "title":"Clint Eastwood Leaves His Estate To The Trump 2020 Campaign",
    "description":"Clint Eastwood says his doctors have put him on notice to get his affairs in order and prepare for that final trip in one of those limousine station wagons we call a hearse. The famous actor, 89, says he’ll be lucky to see 2019: “I’ve had a good run. They say I’m probably gonna be on […]"
  },
  "22":{
    "id":"politifact14597",
    "text":"SHARE this story with your friends!\n\n3.7k SHARES Share Tweet Share\n\nThe New Orleans Saints made the mistake of once again disrespecting our veterans, our country, and our flag. After an embarrassing opening to a game with the worst ratings in Saints’ history, the players and coaches learned that their actions have consequences.\n\nBoth the pilot and co-pilot of the Boeing 737 the Saints use to travel are combat-hardened American heroes. They flew sorties over Baghdad with Saddam’s best weapons firing back. They fought with their lives for your freedom and watched many of their friends die. Today they took a stand for those brave souls:\n\n“We couldn’t be a party to the disrespect. We waited until we were cleared and last off the runway for the night , walked out of the cockpit, took a knee and deplaned. They’re not going anywhere until tomorrow.”\n\nLooks like the group of thugs should have just considered themselves lucky they’re allowed to make millions for playing a game and stood with respect like they’re told to do in the league rulebook.\n\nThis week was the worst week in NFL history for ratings. Next week will be worse.",
    "title":"Flight Crew Takes A Knee And Walks Off, Leaving New Orleans Saints Stranded On Runway",
    "description":"The New Orleans Saints made the mistake of once again disrespecting our veterans, our country, and our flag. After an embarrassing opening to a game with the worst ratings in Saints’ history, the players and"
  },
  "23":{
    "id":"politifact14859",
    "text":"About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC.\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.",
    "title":"Alabama State Police Arrest 3 Poll Workers In Birmingham",
    "description":"Alabama State Police have arrested three women in Birmingham for allowing more than 3000 invalid votes for Doug Jones to processed through the polling station they had volunteered to operate. The State Attorney’s Division of (via: trendolizer.com)"
  },
  "24":{
    "id":"politifact14954",
    "text":"82-year-old William DeLisle of Marina Del Ray, California, has been sentenced to death for defending himself against a life-threatening situation. In October of 2015, DeLisle was walking home from the local senior center when he was ambushed by a pair of young Muslims.\n\nThe men, Abdi Nadjeer Hallalla and Mustif Salabu, were already wanted for a crime spree that spanned nearly four years with dozens of victims. They preyed on older Americans, often grabbing them off the street to beat and rob them. Until they met DeLisle.\n\nNow, Hallalla is in a wheelchair breathing through a tube and Salabu is dead. DeLisle, who stormed the beach at Normandy as a young man, responded to the young men like any good Marine would. He pulled a .22 from his ankle holster — which is “illegal” in California — and put both men down in seconds.\n\nProsecutors said that because the two men were unarmed and using threats instead of actually hurting DeLisle meant that there was no imminent danger and that the use of deadly force was “extreme and unnecessary.” The Dewey County Prosecutor explained in a press release:\n\n“Mr. DeLisle could have handed over his wallet without incident. Instead, he chose to pull an illegally carried firearm from a concealed location and shot the two men. Had he stopped there it may not have been such a major incident, as both men’s initial wounds were superficial.\n\nWhile they were on the ground, DeLisle told Salabu that if he didn’t ‘denounce his pagan moon god, Allah, that he would be meeting him. Salabu closed his eyes to pray and DeLisle put two bullets in his skull.\n\nHallalla, after seeing his friend murdered, tried to flee and was shot in the spine, paralizing him for life. This wasn’t self-defense. It was murder and religious persecution.”\n\nReligious persecution? How much you want to bet if the tables were turned and an elderly Muslim killed two Christian men trying to mug him he’d get a medal from the Governor of California?\n\nDeLisle has nothing to be concerned with, since the pansies in California don’t actually execute prisoners. They have a moratorium on their useless death penalty and have for decades. He will, however, die in prison. His lawyer said DeLisle expressed that it was a “small price to pay if he saved others from these two monsters.”\n\nDeLisle hasn’t asked for an appeal.\n\nSource: Ladies of Liberty",
    "title":"82-Year-Old Who Killed A Muslim In Self-Defense Gets The Death Penalty",
    "description":"82-year-old William DeLisle of Marina Del Ray, California, has been sentenced to death for defending himself against a life-threatening situation. In October of 2015, DeLisle was walking home from the local senior center when he was ambushed by a pair of young Muslims. The men, Abdi Nadjeer Hallalla and Mustif Salabu, were already wanted for a crime spree that spanned nearly four years with dozens of victims. They preyed on older Americans, often grabbing them off the street to beat and rob them. Until they met DeLisle. Now, Hallalla is in a wheelchair breathing through a tube and Salabu is"
  },
  "25":{
    "id":"politifact13617",
    "text":"If this is true it will mean an opening for another Conservative Justice to be appointed by President Trump.\n\nShe said she will resign if Trump was elected President, and now when he got elected, and with a month until the inauguration, she will be resigning.\n\nThe Supreme Court is in recess for the summer, but Justice Ruth Bader Ginsburg took some time to reflect on its future composition, which will chiefly depend on who is elected president in November. Asked on Thursday about the prospect of Donald Trump being handed the job of selecting the next crop of justices, she seemed uneasy at the thought.\n\n“I DON’T WANT TO THINK ABOUT THAT POSSIBILITY, BUT IF IT SHOULD BE, THEN EVERYTHING IS UP FOR GRABS,” SHE TOLD THE ASSOCIATED PRESS IN A WIDE-RANGING INTERVIEW THAT ALSO TOUCHED ON THE LOSS OF HER DEAR FRIEND ANTONIN SCALIA AND SOME OF THE COURT’S BIGGEST RULINGS IN THE TERM THAT ENDED IN LATE JUNE.\n\n“I REALLY DISLIKE THAT MAN FOR A NUMBER OF REASONS, AND ALTHOUGH I AM NOT SUPPOSED TO PUT FORTH MY PERSONAL VIEWS BECAUSE OF MY POSITION, I STILL FEEL OBLIGATED TO DO WHATEVER I CAN IN ORDER TO LET THE PUBLIC KNOW THAT THERE’S STILL TIME TO MAKE THE RIGHT CHOICE,” SHE ADDED.\n\n“DONALD TRUMP IS A MAN WHO HAS ACCUMULATED HIS VAST WEALTH NOT BECAUSE OF HIS BUSINESS PROWESS, BUT BECAUSE OF THE FACT THAT MUCH OF IT WAS INHERITED FROM HIS FATHER AND GRANDFATHER. IN FACT, WHEN IT COMES TO MAKING IMPORTANT DECISIONS, I DON’T RECALL HIM EVER MAKING THE RIGHT ONE, AND THAT’S NOT THE TYPE OF MAN THAT SHOULD BE AT THE HEAD OF THIS COUNTRY.”\n\nAFTER OPENING FIRE AT THE PRESUMPTIVE REPUBLICAN PRESIDENTIAL CANDIDATE, GINSBERG TURNED TO HER OWNwi PLANS SHOULD DONALD TRUMP ACTUALLY BECOME THE NEW PRESIDENT OF THE UNITED STATES.\n\n“THERE’S NO NEED TO BEAT AROUND THE BUSH, SO I’M JUST GOING TO GO AHEAD AND SAY IT – I WILL RESIGN MY POSITION AS A JUSTICE OF THE SUPREME COURT OF THE UNITED STATES IF THAT HAPPENS. I CANNOT IMAGINE PERFORMING MY DUTIES UNDER THE CONSTANT PRESSURE OF WAKING UP IN THE MORNING AND HAVING TO GO TO WORK KNOWING THAT EVERY RULING WE AS AN INSTITUTION MAKE WILL BE VIEWED THROUGH THE PRISM OF A TRUMP PRESIDENCY. I CAN TOLERATE THIS CHARADE OF A PRESIDENTIAL CAMPAIGN, BUT I COULD NOT LIVE WITH HIM AS PRESIDENT,” SHE SAID.\n\n“I AM A WOMAN WHO HAS LIVED LONG ENOUGH, AND I AM PROUD TO SAY I’VE HAD A PROSPEROUS AND FULFILLED LIFE,” JUSTICE GINSBERG ARGUED.\n\nHowever, I am too old and too far gone to be forced to put up with the idiotic and surreal presidency of a man who up until yesterday cared for no one else but his own deep pocket. I fear that kind of situation would go against the very principles that are the building blocks of the Constitution of the United States. I see no purpose in continuing to perform my professional duties when I’m aware that everything I say and do will most likely be shot down by a man so ignorant he probably requires GPS just to find his belly button while taking a shower.",
    "title":"CONFIRMED ! JUSTICE RUTH BADER GINSBURG IS RESIGNING FROM THE POST OF ASSOCIATE JUSTICE OF THE SUPREME COURT",
    "description":"If this is true it will mean an opening for another Conservative Justice to be appointed by President Trump. She"
  },
  "26":{
    "id":"politifact13806",
    "text":"UI Notice: The comments were found not to be true. PHEEEEEWWWW, that would have been too much to handle.\n\nHouston – It seems new National Rifle Association President (NRA) president Jim Porter may have found himself in a bit of hot water. Not long ago he made his feelings about the Civil War known when he referred to it as the “War of Northern Aggression.” In that same speech he referred to President Obama as a “fake president” and Attorney General Eric Holder as “rabidly un-American.” However none of those remarks that anyone could deem as racist compare to his remarks made at a recent press conference discussing his new leadership role at the NRA.\n\n“I’m very proud to be taking the lead here at the NRA. We need to really buckle down and strap on our best arguments to defend what is our God-given rights. No more northern folk tryin’ take away what is rightfully ours. I will not stand by and let some liberal-elitists try to ruin what has made this country great, especially a liberal of, you know, a different breed.”\n\nWhen asked to clarify Porter said,\n\n“I don’t have to clarify. You know gall darn well what I mean. In fact, it’s only a matter of time before we can own colored people again. They sure as hell won’t be our leaders. It’s out-right embarrassing. The War of Northern Aggression made it all possible, and you be best to know it’s all gonna change back. I’ll be on the front lines making sure it happens. I don’t want my grandkids growing up taking orders from a colored man. It’s our God-given right to keep them as property and keep them in line.”\n\nSeveral at the NRA, including vice president Wayne LaPierre, have since tried to distance themselves from Porter’s remarks. LaPierre said, “They brought him in over me to try and liven things up, calling me boring and rehearsed. Next time they’d be better off just making me president.”\n\nIt’s still unknown if the NRA and Porter will write an apology and retraction to his comments. Free Wood Post will keep you up to date as this story unfolds.\n\nSource: http:\/\/www.freewoodpost.com\/2013\/05\/05\/nra-president-jim-porter-its-only-a-matter-of-time-before-we-can-own-colored-people-again\/",
    "title":"NRA President Jim Porter Falsely Accused of Saying, “It’s Only A Matter Of Time Before We Can Own Colored People Again”",
    "description":"UI Notice: The comments were found not to be true. PHEEEEEWWWW, that would have been too much to handle. Houston – It seems new National Rifle Association President (NRA) president Jim Porter may have found himself in a bit of hot water. Not long ago he made his feelings about the Civil War known when he […]"
  },
  "27":{
    "id":"politifact15584",
    "text":"It’s not surprising. The left hates our freedoms, and so designating the Declaration of Independence, the most magnificent document in all of human history, as hate speech is in line with their agenda. The left means to criminalize lawfulness. The left means to criminalize freedom of speech. The left means to criminalize individual rights. The left means to criminalize Americanism.\n\nIt starts with cultural assassination, delegitimization, dehumanization, then criminalization. Mark my words.\n\nFacebook labels declaration of independence as ‘hate speech’ The website told a local newspaper they violated its community guidelines by posting the original document What must have seemed like a benign social media strategy managed to fall foul of Facebook’s algorithmic censors, which labeled sections of the declaration hate speech and removed the posts.\n\nThe Truth Must be Told Your contribution supports independent journalism Please take a moment to consider this. Now, more than ever, people are reading Geller Report for news they won't get anywhere else. But advertising revenues have all but disappeared. Google Adsense is the online advertising monopoly and they have banned us. Social media giants like Facebook and Twitter have blocked and shadow-banned our accounts. But we won't put up a paywall. Because never has the free world needed independent journalism more. Everyone who reads our reporting knows the Geller Report covers the news the media won't. We cannot do our ground-breaking report without your support. We must continue to report on the global jihad and the left's war on freedom. Our readers’ contributions make that possible. Geller Report's independent, investigative journalism takes a lot of time, money and hard work to produce. But we do it because we believe our work is critical in the fight for freedom and because it is your fight, too. Please contribute here. or Make a monthly commitment to support The Geller Report – choose the option that suits you best. $25.00 here\n\n$50.00 here\n\n$75.00 here\n\n$100.00 here\n\n$250.00 here",
    "title":"Facebook removes, censors Declaration of Independence as ‘hate speech’",
    "description":"The left means to criminalize lawfulness. The left means to criminalize freedom of speech. The left means to criminalize individual rights. The left means to criminalize Americanism."
  },
  "28":{
    "id":"politifact14205",
    "text":"Snowden, who lives as a fugitive in Russia after leaking documents about the NSA’s surveillance programs has made some previously unreported allegations about the famous terrorist, Osama Bin Laden, during an interview with the Moscow Tribune.\n\nAccording to him, not only is Bin Laden still alive, but he is living a lavish lifestyle in the Bahamas, thanks to regular payments from the CIA.\n\n“I have documents showing that Bin Laden is still on the CIA’s payroll,” claims Edward Snowden. “He is still receiving more than $100,000 a month, which are being transferred through some front businesses and organizations, directly to his Nassau bank account. I am not certain where he is now, but in 2013, he was living quietly in his villa with five of his wives and many children.”\n\nMr. Snowden says the CIA orchestrated the fake death of the former leader of Al Qaeda, while he was actually transported with his family in an undisclosed location in the Bahamas.\n\n“Osama Bin Laden was one of the CIA’s most efficient operatives for a long time,” claims the famous whistleblower. “What kind of message would it send their other operatives if they were to let the SEALs kill him? They organized his fake death with the collaboration of the Pakistani Secret services, and he simply abandoned his cover. Since everyone believes he is dead, nobody’s looking for him, so it was pretty easy to disappear. Without the beard and the military jacket, nobody recognizes him.”\n\nMr. Snowden says that the documents proving that Bin Laden is still alive will be integrally reproduced in his new book, expected to be released in September.\n\nEdward Snowden was hired by an NSA contractor in 2013 after previous employment with Dell and the CIA. In the month of June of the same year, he revealed thousands of classified NSA documents to journalists.\n\nThe US government filed espionage charges against him shortly after his revelations were made public. He has been living under asylum in Moscow, after fleeing the US for Hong Kong in the wake of the leaks.\n\nOn July 28 2015, the White House has rejected a “We the People” petition of nearly 168,000 signatories, to pardon him.",
    "title":"Bin Laden is \"Alive and well in the Bahamas\", says Edward Snowden",
    "description":"Moscow| National Security Agency whistleblower Edward Snowden, has made a new controversial claim yesterday, saying that he possessed some classified information proving that Osama Bin Laden is st"
  },
  "29":{
    "id":"politifact14885",
    "text":"World's most popular candy to be removed from shelves by October 2017!\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n2059 487832 Shares\n\nThe announcement was released late on Friday Sept 8th in a press conference, that the famous candy, the original Reese's peanut butter cups would no longer be available! \"By October 2017 they will all be removed from the shelves!\" Manufacturer said due to the new versions and a severe decline in sales. It is no longer justifiable to continue producing the product. Originally there were plans to keep them through Halloween, however those plans have fallen through. We say goodbye to a candy icon. RIP Reese's peanut butter cups. Make sure to get you one before they are gone!\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n\/!\\ Report Abuse\n\nloading Biewty",
    "title":"World's most popular candy to be removed from shelves by October 2017!",
    "description":"The announcement was released late on Friday Sept 8th in a press conference, that the famous candy, the original Reese's peanut butter cups would no longer be available!  By October 2017 they will all be removed from the shelves!  Manufacturer said due to the new versions and a severe decline in sales. It is no longer justifiable to continue producing the product. Originally there were plans to keep them through Halloween, however those plans have fallen through. We say goodbye to a candy icon. RIP Reese's peanut butter cups. Make sure to get you one before they are gone!"
  },
  "30":{
    "id":"politifact14195",
    "text":"Chachi can now apologize to Joannie for being so rude. Scott Baio, 56, was killed when the single-engine Cessna he was in crashed into the side of a hill in Louisiana. Baio was headed to Mar-A-Lago to barbecue shrimp and play gold with President Trump.\n\nBaio’s wife, Raylene, wasn’t on the plane but was checked into St Timothy’s on a suicide watch after the news sent her into a breakdown. Spokesmen for several actors who wouldn’t be caught dead in a film with Baio said that he was “really special as Chachi” and he “sure did do a nice job with Charles in Charge.”\n\nBaio, wildly successful as an actor since the ripe age of 13, says he saved every dime he ever made so he could live the lavish lifestyle of jetting across the country to golf with famous and powerful people. Unfortunately, that ended with a net worth of about $3.5 million and a whole lot of that was tied up in that nice house of his, so Baio was forced to go Cessna instead, which only would have gotten him there slightly faster than that new Kia Sorento he’s been sporting.\n\nBaio will be missed by many. His ability to retweet things in support of our glorious president without even bothering to care what they were truly drove the social media movement to get Trump elected. When he heard the news that Baio was killed, Trump asked for a moment of silence in the dining room during his morning coffee and strudel. He hasn’t personally responded but Jeff Derpinger of the WHOIP told Freedom Crossroads correspondent Louis Leweigh:\n\n“The President was saddened by the news once we reminded him that Scott was once ‘Chachi.’ He said he wished he knew the kid was coming; he would have sent the jet.”\n\nTo clear it up, libtards, he would probably send the company jet and not Air Force One. Maybe one of the smaller planes like the Secretary of State gets but nothing bigger than that. Baio’s remains are scattered with the wreckage, with slammed nose first into a cliff face. The FCC said the pilot probably got disoriented in a cloud bank and came at a 30-degree downward angle directly into solid quartz with a touch of limestone. The plane fell nearly 1400 feet to the basin below where very little was recognizable.\n\nBaio had no known connection to the Clintons — Trey Gowdy is investigating.",
    "title":"Scott Baio, Beloved Face Of Conservatism, Dies In Small Plane Crash On His Way To Visit Trump",
    "description":"Chachi can now apologize to Joannie for being so rude. Scott Baio, 56, was killed when the single-engine Cessna he was in crashed into the side of..."
  },
  "31":{
    "id":"politifact14888",
    "text":"President Donald Trump and the Republicans in Washington D.C. are preparing to carry out their most heartless plan ever.\n\nAs winter weather begins to set in across the United States, federal politicians are reportedly making huge cuts to a crucial government program that provides heating assistance to the elderly and disabled. Under the GOP proposal, millions of American households will be at risk of losing heat this winter, as reported by the Independent.co.uk\n\nSadly, this is exactly what millions of Americans have been fearing. The Republicans are carrying out a major attack against poor people and senior citizens, all so they can give a few more tax cuts to their rich friends.\n\nAs Gray TV reported recently, “President Donald Trump proposed cutting the multi-billion-dollar program as part of his budget plan. Government estimates suggest six million people rely on it to heat, cool, or weatherize their homes.”\n\nThis is just the latest example of the Trump administration’s utter disregard for everyday people in our country. Time and time again, Trump has taken every opportunity he has to make life harder for the people in the bottom 50 percent of America.\n\nThe Republicans have spent years trying to destroy everything that makes America great. Now that they have control of the House, the Senate, and the presidency, they are ramping up their ruthless campaign to full speed.\n\nIt’s time for Americans to wake up and stand up to the stupid Republican politicians in Washington D.C. – enough is enough\n\nPlease ‘SHARE,’ to help us get the word out.\n\n\n\n\n\n\n\nRelated\n\nComments\n\ncomments",
    "title":"Trump Vows to End Winter Heating Assistance for Elderly and Disabled – Our Voice",
    "description":"Under the GOP proposal, millions of American households will be at risk of losing heat this winter, as reported by the Independent.co.uk Sadly, this is"
  },
  "32":{
    "id":"politifact14436",
    "text":"The FBI, after an extensive investigation, has learned that liberal icon and leader of the hoard at The View, Whoopi Goldberg, has been running an illegal puppy mill out of three of her properties, selling dogs with high risk of C-Sections that most vets say should stop being bred because of their heavily diluted gene codes.\n\nGoldberg has been breeding Pugs, French Bulldogs, Sharpeis and Shitzus from the same sets of parents for nearly 25 years, replacing mom or dad in the line with a son or daughter when she lost one. Veterinary experts say the dogs being produced might look cute, but they are a fragile mess waiting to snap at the first real sign of stress in their lives.\n\nGoldberg was first reported by a family whose pug snapped and completely destroyed more than $15K worth of shoes in a single day. Shortly thereafter a family in Skenektady lost an entire litter of kittens to a Frenchie who just decided baby kittens didn’t belong in this world.\n\nWhat Goldberg has been doing violates several federal and state laws. She could face up to 15 years in prison and a million dollars in fines. Why, Whoopi? Did you need the money?",
    "title":"Whoopi Goldberg Humiliated, Handcuffed And Dragged Out Of The TV Studio",
    "description":"The FBI, after an extensive investigation, has learned that liberal icon and leader of the hoard at The View, Whoopi"
  },
  "33":{
    "id":"politifact14071",
    "text":"During a time when the Republican Party’s presumptive nominee, Donald Trump, should be working to bring the party together and prepare for the primary battle against Hillary Clinton, he continues to deepen the divide between Republicans and Americans alike.\n\nTrump’s recent attack on U.S. District Judge Gonzalo Curiel because of his Mexican-American background prompted Sen. Lindsey Graham to round up the Republicans who have previously endorsed Donald Trump, and persuade them to take it all back.\n\nGraham claimed that Trump’s racist remarks were “the most un-American thing from a politician since Joe McCarthy.”\n\n“If anybody was looking for an off-ramp, this is probably it,” Graham told The New York Times.”\n\nSenator Graham elaborated on this during an interview with NBC News’ Hallie Jackson.\n\n“There are a lot of people who want to be loyal to the Republican Party, including me,” he said. “But there’ll come a point in time where we’re gonna have to understand that it’s not just about the 2016 race, it’s about the future of the party and I would like to support our nominee. I just can’t.”\n\nDonald Trump claimed that Judge Gonzalo Curiel, who is presiding over the Trump University case, has been biased toward him because of his Latino heritage.\n\n“I couldn’t disagree more with a statement like that,” Senate Majority Leader Mitch McConnell (R-Ky.) said Sunday.\n\n“Those kinds of comments are very serious to me,” Rep. Susan Collins (R-Maine) said to News radio WGAN. “They are completely unacceptable, and what they indicate — which is why I think this is so serious — is a lack of respect for our judicial system and for the separation of powers doctrine that is enshrined in the Constitution.”\n\nAlthough many Republicans, including House Speaker Paul Ryan, have condemned Trump’s accusations, they continue to support him.",
    "title":"Lindsey Graham Threatens To Convert To Democrat If Republicans Don’t Dump Trump – True Trumpers",
    "description":"During a time when the Republican Party’s presumptive nominee, Donald Trump, should be working to br"
  },
  "34":{
    "id":"politifact14742",
    "text":"Snapchat is shutting down!\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n2059 60362 Shares\n\nSnapchat will be shutting down tommrow for the U.K. , and will shut down today for the U.s , such a shame\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n\/!\\ Report Abuse\n\nloading Biewty",
    "title":"Snapchat is shutting down!",
    "description":"Snapchat will be shutting down tommrow for the U.K. , and will shut down today for the U.s , such a shame"
  },
  "35":{
    "id":"politifact15266",
    "text":"UPDATE 4\/12\/2018: Yes, Fox did accidentally put up the wrong poll graphic, but Fox has since pointed out that the confusing graphic wasn't actually showing that Fox is the least trusted network. Instead, what the graphic intended to do was to compare CNN, MSNBC and Fox News to Trump. The graphic asks who people trust more, CNN or Trump, MSNBC or Trump, and Fox News or Trump. When looking at it this way, people trust all three networks more than they trust Trump.\n\nDuring a Fox news segment in which Republican strategist Frank Luntz thought the media should give Trump more credit for the nation's economic \"clear recovery,\" someone behind the scenes made a boo boo.\n\nWhen host Howard Kurtz asked for a poll to be put up on the screen that asks if the media reports fake news, viewers got a look at the wrong poll – one put out by Monmouth University that asks people which network they trust more, CNN, MSNBC, or Fox News.\n\nNot surprising but a knee-slapper nonetheless, the graphic for the poll showed that people trusted CNN most, at 48%, followed by MSNBC at 45%. Fox came in last place with a mere 30% of those polled thinking that the network was trustworthy.\n\nKurtz quickly said, \"This is not the graphic we're looking for – hold off. Take that down please!\"\n\n.@FoxNews the least trusted US network. Here is the graph which got Fox News in a panic today. https:\/\/t.co\/n5rA0xZ1LY pic.twitter.com\/ES6pBoKN9E — Gerry Hassan (@GerryHassan) April 8, 2018\n\n.@FrankLuntz: \"It's [@POTUS's] own tweets that are causing so much of the trouble… He should be focused on the economy and on taxes.\" #MediaBuzz pic.twitter.com\/hbjdU6G7gz — Fox News (@FoxNews) April 8, 2018\n\nVia Mashable",
    "title":"Fox News accidentally puts up a poll graphic that shows how they are the least trusted network",
    "description":"UPDATE 4\/12\/2018: Yes, Fox did accidentally put up the wrong poll graphic, but Fox has since pointed out that the confusing graphic wasn’t actually showing that Fox is the least trusted netwo…"
  },
  "36":{
    "id":"politifact14144",
    "text":"Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death [ ] Hide Caption [ ] Show Caption Seth Rich Local News Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.\n\n- It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.\n\nRich was shot and killed last July in Northwest D.C and police have suggested the killing in the District's Bloomingdale neighborhood was a botched robbery. However, online conspiracy theories have tied the murder to Rich's work at the DNC.\n\nJust two months shy of the one-year anniversary of Rich's death, FOX 5 has learned there is new information that could prove these theorists right.\n\nRod Wheeler, a private investigator hired by the Rich family, suggests there is tangible evidence on Rich's laptop that confirms he was communicating with WikiLeaks prior to his death.\n\nNow, questions have been raised on why D.C. police, the lead agency on this murder investigation for the past ten months, have insisted this was a robbery gone bad when there appears to be no evidence to suggest that.\n\nWheeler, a former D.C. police homicide detective, is running a parallel investigation into Rich’s murder. Wheeler said he believes there is a cover-up and the police department has been told to back down from the investigation.\n\n\"The police department nor the FBI have been forthcoming,” said Wheeler. “They haven't been cooperating at all. I believe that the answer to solving his death lies on that computer, which I believe is either at the police department or either at the FBI. I have been told both.”\n\nWhen we asked Wheeler if his sources have told him there is information that links Rich to Wikileaks, he said, “Absolutely. Yeah. That's confirmed.\"\n\nWheeler also told us, \"I have a source inside the police department that has looked at me straight in the eye and said, ‘Rod, we were told to stand down on this case and I can’t share any information with you.’ Now, that is highly unusual for a murder investigation, especially from a police department. Again, I don’t think it comes from the chief’s office, but I do believe there is a correlation between the mayor's office and the DNC and that is the information that will come out [Tuesday].\n\nA full report with the new details will air Tuesday morning on FOX News.",
    "title":"Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death",
    "description":"It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now."
  },
  "37":{
    "id":"politifact14043",
    "text":"Washington (dpo) – As part of his plan to improve national security and combat illegal immigration, US President Donald Trump intends to send around 3 million American Indians back to where they came from – India. He is to sign an executive order to this effect this week.\n\nIn an interview with Fox News, President Trump described Indians living in the USA as lawless warriors with a history of attacking and killing US citizens. He claimed, “I’ve seen it in all kinds of TV documentaries. Horrible attacks on good Americans using hatchets or bows and arrows. You can’t trust these Indians.”\n\nPresident Trump consulted with the appropriate members of the government and found that most Indians do not possess the relevant immigration documents. “That means they are here illegally. I had to act.”\n\nFurther criticism is to be found on the President’s Twitter account:\n\nHe also tweeted:\n\nThe White House has announced that Indians will be given a three month period in which to leave the country. India is to pay for their flights.\n\nSource:the-postillon.com",
    "title":"TRUMP WANTS TO DEPORT AMERICAN INDIANS TO INDIA",
    "description":"Washington (dpo) – As part of his plan to improve national security and combat illegal immigration, US President Donald Trump intends to send around 3 million American Indians back to where t…"
  },
  "38":{
    "id":"politifact14404",
    "text":"aderito Report\n\nReport Change comment\n\nRemove comment Nov 25, 2017\n\nIam not sure if this is true or not ,Putin has already had discussions with the pope Francis ,to have an opinion about him ,but again i dont if its true",
    "title":"Putin says: ‘Pope Francis Is Not A Man Of God’ | Must-See !!",
    "description":"Putin says: ‘Pope Francis Is Not A Man Of God’ | Must-See !! President Putin has slammed Pope Francis for “pushing a political ideology instead of running a church”, and warned that the leader of the Catholic Church “is not a man of God.” Putin Says – ‘Dangerous Soros’ For Driving America Into Civil War: viralipy.com\/putin-says-dang… Facebook - bit.ly\/2u6ngAU Blog - bit.ly\/2u5WtVp www.youtube.com\/watch"
  },
  "39":{
    "id":"politifact13784",
    "text":"Please Support Online Petition To Congress For Banning Islam From U.S. If You Do Please Like This Form. Together We Can Do That!!!\n\nIslam is not a religion, it is a violent cult and should be banned from America. I urge you to sponsor and support legislation banning Islam from America. Remember To Start This Movement It Is Necessary To Get At Least 100,000 Likes!\n\nPGlmcmFtZSBzcmM9Imh0dHBzOi8vd3d3LmZhY2Vib29rLmNvbS9wbHVnaW5zL3BhZ2UucGhwP2hyZWY9aHR0cHMlM0ElMkYlMkZ3d3cuZmFjZWJvb2suY29tJTJGQW1lcmljYW4xc3RMYWR5JTJGJnRhYnMmd2lkdGg9MzAwJmhlaWdodD03MCZzbWFsbF9oZWFkZXI9dHJ1ZSZhZGFwdF9jb250YWluZXJfd2lkdGg9ZmFsc2UmaGlkZV9jb3Zlcj1mYWxzZSZzaG93X2ZhY2VwaWxlPWZhbHNlJmFwcElkPTIwMjQ1OTY3NjgwMDg5MSIgd2lkdGg9IjMwMCIgaGVpZ2h0PSI3MCIgc3R5bGU9ImJvcmRlcjpub25lO292ZXJmbG93OmhpZGRlbiIgc2Nyb2xsaW5nPSJubyIgZnJhbWVib3JkZXI9IjAiIGFsbG93VHJhbnNwYXJlbmN5PSJ0cnVlIj48L2lmcmFtZT4=",
    "title":"Starbucks Just Placed Trump’s Photo on Floor so Every Customer have to Step On It….",
    "description":"Starbucks is shame of our nation :( pic.twitter.com\/EQ9mIfUmLt — Trump For President (@TrumpThe45th) February 16, 2017   Source: https:\/\/twitter.com\/TrumpThe45th\/status\/832329905908150272"
  },
  "40":{
    "id":"politifact13949",
    "text":"Snopes Paid to Push ‘Propaganda’ by Facebook, Former Editor Reveals\n\nClaims 'fact-checkers' are paid to 'appear to prevent damage' while pushing an agenda\n\n© press Former managing editor at Snopes Brooke Binkowski says the 'fact-checker' is pushing 'propaganda'\n\nSnopes is paid by Facebook to push \"propaganda,\" according to the former managing editor of the \"fact-checker,\" who claims the social media giant \"doesn't care\" about facts and is using journalists to promote an agenda so it can \"pass the buck.\"\n\nAccording to a bombshell report by the Guardian, several current and former Facebook fact-checkers have stepped forward and spoken out to reveal their distrust in the social network and their fact-checking employers.\n\nFacebook has fact-checking partnerships with Snopes, PolitiFact, Factcheck.org, the Weekly Standard, and Associated Press, and uses the information provided by these organizations to reduce the reach of posts that are \"debunked\" in their News Feed.\n\nThe partnering with these fact-checkers has come under heavy criticism, mainly due to the almost-monopolized influence news on Facebook has, which is then being filtered out by unregulated individuals who are often financially motivated and express political bias.\n\n“They’ve essentially used us for crisis PR,” declared former Snopes managing editor Brooke Binkowski during an interview with the Guardian.\n\n“They’re not taking anything seriously.\n\n\"They are more interested in making themselves look good and passing the buck…\n\n\"They clearly don’t care.”\n\n“You’re not doing journalism anymore. You’re doing propaganda,” she continued, adding, “They threw us under the bus at every opportunity.”\n\nAnother former Snopes employee, Kim LaCapria, recently left the company over its partnership with Facebook, accusing it of focusing only on the “appearance of trying to prevent damage without actually doing anything,” and expressing distaste with the fact that Snopes was being paid by Facebook.\n\nLaCapria said she was particularly upset to learn that Facebook was paying Snopes: “That felt really gross … Facebook has one mission and fact-checking websites should have a completely different mission.”\n\nAside from allegedly being paid by Facebook, Snopes also generates revenue by filling its website with advertisements from Google Adsense, asking for donations from readers via PayPal, and has an active GoFundMe campaign to \"Save Snopes\" which has so far generated over $850,000 of its $2 million goal.\n\nOf course, it's understandable that a website has overheads that need to be covered, but when a company is primarily driven by profit, how can they be trusted to remain non-partisan?\n\nAccording to a report by the Daily Mail, Snopes founder David Mikkelson was accused of embezzling thousands from the company.\n\nMikkelson's ex-wife Barbara, claimed in legal documents he embezzled $98,000 of company money and spent it on \"himself and prostitutes.\"\n\nDuring the lengthy and bitter legal dispute, CEO David Mikkelson also claimed to be underpaid and was demanding the \"industry standard\" or at least $360,000 a year.\n\nBeing motivated by \"facts\" is apparently very lucrative.\n\nAnd in the case of Snopes, their business model is a simple, yet devastatingly effective one since they partnered with Facebook and Google: They debunk viral news, and posts.\n\nTherefore, if a post goes viral on social media, and Snopes says that it's \"false,\" then it will be flagged as so and Facebook will place a link to the \"fact-check,\" thus driving more traffic and revenue to Snopes.\n\nDue to this arrangement, it adds a clear incentive to mark a viral news story as false rather than confirming lesser-known facts as true.\n\n© press Snopes founder David Mikkelson was accused on embezzling company money\n\nOver recent months this push to flag big news stories as \"false,\" mainly from conservative websites, has become more apparent.\n\nIn November, Breitbart accused Snopes of attempting to \"wash away\" the story of armed members of the New Black Panther Party campaigning for the Democrat gubernatorial candidate in Georgia, Stacey Abrams.\n\nAccording to Breitbart, the move was an \"openly partisan\" attempt to protect Abrams after the damaging story went viral.\n\nEarlier this month, The Daily Caller also accused Snopes of left-bias after it \"botched\" its fact-check of a viral meme that was mocked within political circles for spreading false information.\n\nSnopes said that the “general idea” of the meme was “correct,” yet, according to the TheDCNF, the fact-checker intentionally framed it that way as it portrayed President Trump in a negative light if the \"wildly misleading\" meme was true.\n\nIn Snopes \"transparency\" disclaimer, it states that it operates \"without any partisan considerations,\" saying:\n\n\"We don’t choose or exclude items for coverage based on whether they deal with Republican\/Democratic, conservative\/liberal, or religious\/secular issues.\"\n\nDespite this statement, the left-leaning bias of their fact-checkers is clear.\n\nSnopes' \"science dude\" Alex Kasprak makes no secret of his political bias, and one look at his Twitter account shows it is filled with anti-Trump rhetoric and retweets of Trump-bashing posts.\n\nThe only way to report on that \"totally clears the president\" tweet is to highlight it as an example of our president's abject delusion, not as a valid legal opinion or as \"breaking news\" — Alex H. Kasprak (@alexkasprak) December 8, 2018\n\n\n\n\n\nPrior to joining Snopes, Kasprak wrote for left-wing news outlets Motherboard and BuzzFeed and is pegged as a \"science writer\" who mainly \"debunks\" science-related articles.\n\nIt comes as no surprise then that Kasprak mainly fact-checks conservative news sites, often using derogatory language when describing the outlets and their writers, using terms such as \"right-wing blog\" and \"junk news.\"\n\nBiting the hand that feeds\n\nSnopes apparent bias has seen the company suffer considerably over recent months as it continues to abuse its influence over Facebook's News Feed to promote a political agenda.\n\nVisits to snopes.com have plummeted by almost half over recent months as users are seemingly losing trust in the organization.\n\nAccording to website data tool SimilarWeb, visits to Snopes dropped another 20 percent in November to 19.59 million for the month.\n\nThis number is a considerable drop from their July figure of 37.79 million, representing a staggering 48.16 percent drop in website traffic in just four months.\n\nWhile it's unclear what has caused this drop, when you consider that being flagged as \"fake news\" on Facebook cuts reach to the websites being debunked, it's clear to see that attacking the sources of their viral \"fact-checks,\" is hardly sustainable if it destroys the sites that it continually attacks.\n\n© SimilarWeb Website visits to Snopes have plummeted by almost 50 percent since July\n\nThe appearance of trying to prevent damage\n\n“Why should we trust Facebook when it’s pushing the same rumors that its own fact checkers are calling fake news?” an unnamed Facebook fact-checker told the Guardian.\n\n“It’s worth asking how do they treat stories about George Soros on the platform knowing they specifically pay people to try to link political enemies to him?[…] Working with Facebook makes us look bad.”\n\nAccording to Breitbart, one fact-checker who has reportedly “long worked” with Facebook even referred to the social network as a “terrible company,” declaring, “and, on a personal level, I don’t want to have anything to do with them,” while another fact-checker proclaimed, “Most of us feel it’s more trouble than it’s worth.”\n\nFacebook started its fact-checking efforts following President Trump’s 2016 presidential election victory and is even expanding into fact-checking images and videos.\n\nLeft-wing biases have been found at nearly all Facebook fact-check partners in the United States, including Snopes, Politifact, and the Weekly Standard.\n\nAn investigation revealed that Snopes employs left-wing people almost exclusively, with some of its most prominent fact-checkers openly describing themselves as “progressive” and expressing anti-Trump sentiment.\n\nA satirical article from popular satire website Babylon Bee about CNN using a washing machine to “spin the news,” was also nearly removed by Facebook after Snopes fact-checked it as false.\n\nOne of Facebook’s other top fact-checking partners, Politifact, is funded by a frequent Clinton Foundation donor, and gave preferential treatment to Hillary Clinton during the 2016 presidential election — rating 51 percent of Clinton’s claims as true versus just over 15 percent for Trump.\n\nEven a 2013 article from one of Facebook’s other fact-checking partners, the Weekly Standard, claimed Politifact “has it out for Republicans,” and the Weekly Standard itself has also pushed out misleading information during its partnership with Facebook.\n\nUPDATE: Since this article was published, and subsequently went viral on social media, Snopes CEO David Mikkelson denied the information we presented in this article. Snopes didn't \"fact-check\" or \"debunk\" any of the information, nor did they present any evidence to refute the claims. Mikkelson, however, saw fit to abuse his position as Facebook approved \"fact-checker\" and flagged our story as a \"hoax\" with Facebook, pulling it from users' News Feed, immediately squashing the story as a result. Make of that what you will.",
    "title":"Snopes Paid to Push ‘Propaganda’ by Facebook, Former Editor Reveals",
    "description":"Claims 'fact-checkers' are paid to 'appear to prevent damage' while pushing an agenda - Snopes is paid by Facebook to push propaganda, according to the former managing editor of the ... | NEON NETTLE"
  },
  "41":{
    "id":"politifact14693",
    "text":"Update: On Friday, Special Counsel Robert Mueller indicted 12 Russian intelligence officials who he alleges are involved in these hackings and leaks. You can read about the new breaking indictment at this link. Our original explainer on the hackings, written before the new indictment, is below.\n\nOriginal post: There’s one positively enormous shoe that still hasn’t dropped in special counsel Robert Mueller’s investigation into Russian interference with the 2016 campaign: an indictment about all those hacked emails.\n\nThe hacking and release of leading political figures’ emails is the most visible election intervention attributed to Russia’s government. And it’s long been one of the leading, and perhaps the leading, possibility about just what “collusion” between Donald Trump’s team and the Russians might have involved.\n\nThat’s not mere speculation. We’ve gradually learned of not one but six times Trump associates at least tried to get involved with either Russian-provided dirt, hacked Democratic emails, or WikiLeaks. We don’t yet know whether these furtive contacts resulted in anything of significance — but one of these advisers, George Papadopoulos, has already pleaded guilty to lying to the FBI about the matter and has begun cooperating with Mueller’s team.\n\nThese hacks were crimes, victimizing many hundreds of Americans (those who had their documents stolen, and those who corresponded with them). The operation was more wide-ranging than many remember, targeting not just John Podesta and the DNC but many other people and groups. It wasn’t just emails stolen, either — posted material ranged from Democratic Party turnout data that a Republican operative thought was “probably worth millions of dollars” to even a purported picture of Michelle Obama’s passport.\n\nNo charges have been filed in the matter — yet. But some are likely coming. The Wall Street Journal has reported that the US has identified “more than six members of the Russian government” involved in the DNC hacks. And the Daily Beast wrote that investigators have identified a specific Russian intelligence officer behind “Guccifer 2.0,” a leading figure in the hacks. Mueller is now overseeing the probe.\n\nTo understand what happened in 2016, we have to understand the hackings. And though some mysteries remain, much of the complex story has gradually been pieced together by journalists and cybersecurity experts. The consequences, of course, unfolded in plain sight during the campaign itself.\n\nHow the hacks happened (a phishing expedition)\n\nThe media often shorthands the 2016 hack story as: Russians hacked Podesta and the DNC’s email accounts, and WikiLeaks then posted those hacked emails publicly.\n\nThe full story is more complex. Let’s start at the beginning.\n\nBetween March 2015 and May 2016, a group of hackers went on a phishing expedition. The “baited lines” they cast out were at least 19,000 malicious emails that resembled the one below:\n\nThese emails were designed to look as if they were coming from Google. But they were in fact designed to trick people into clicking through and entering their login credentials — delivering them right into the hackers’ hands.\n\nAccording to a later Associated Press analysis of a report by the information security firm SecureWorks, at least 573 of the more than 4,700 email addresses targeted were American. They included many US government officials, military officials, intelligence officials, and defense contractors.\n\nParticularly beginning in March and April 2016, these targets began to include many Democrats as well. Per the AP, more than 130 Democratic accounts were sent these malicious links, compared to just “a handful” of Republican accounts. Podesta and several Clinton staffers — along with former Secretary of State Colin Powell, retired Gen. Philip Breedlove, and others — had their accounts successfully compromised. (We know all this because the hackers used the link-shortening tool Bitly to do their work and accidentally left their activity publicly viewable.)\n\nRussia was eventually blamed for the phishing expedition, for several reasons. For one, SecureWorks concluded the particular malware used in this campaign was tied to a hacking group that outside researchers had been tracking for some time — a group they thought to be linked the GRU, Russia’s foreign military intelligence agency. We don’t know what the secretive hacking group calls itself, but various cybersecurity researchers had given it several names: Iron Twilight, APT (Advanced Persistent Threat) 28, Pawn Storm, and — most famously — “Fancy Bear.”\n\nCircumstantial evidence also suggests a Russian-tied culprit. For instance, the phishers were extremely focused on Ukraine — at least 545 targeted email accounts were from there, comparable to the number of American targets. These included Ukraine’s president and many other top government officials, who are hostile to Vladimir Putin’s regime.\n\nThe Russians targeted, meanwhile, were generally critics of Putin’s government and journalists. Another interesting detail, per the AP, is that more than 95 percent of the malicious links were created between the hours of 9 am and 6 pm, Monday to Friday — Moscow time.\n\nAround April 2016, as this phishing campaign increasingly began to target Democrats, material was also taken from the DNC. The firm Crowdstrike attributed this as a hack from Fancy Bear, citing the malware used, and other firms agreed with this assessment. These firms also concluded that a separate group of Russian-tied hackers (dubbed “Cozy Bear”) had been in the DNC’s systems for much longer, since all the way back in the summer of 2015.\n\nThe precise mechanisms of how the DNC was breached remain somewhat murky. But Fancy Bear’s phishing campaign did send out malicious links to nine DNC email accounts in March and April 2016. And as we’ll soon see, hacked DNC material ended up in the same place as hacked material from Podesta and others. A January 2017 US intelligence report would later specifically blame Russia’s GRU — the agency thought to be behind Fancy Bear — for taking “large volumes of data from the DNC.”\n\nAs striking as all this may seem, though, government-backed hacking is far from unusual. The US does it. Our allies do it. Our rivals do it. China was said to have hacked Barack Obama and John McCain’s presidential campaigns in 2008 and was then tied to a massive theft of federal data in 2015. Foreign intelligence agencies trying to peek into political activities seemed to be something that just, well, happened all the time.\n\nWhat came next in 2016, however, was a jarring departure from these norms — the hacked information began to be posted publicly, in massive amounts.\n\nA timeline of odd events between the hacks and the leaks\n\nThe backdrop to all of this was the US presidential election — the first series of primaries and caucuses took place in February and early March. The surprisingly Russia-friendly Donald Trump emerged as the clear leader in the Republican contest, over his Putin-critical rivals Ted Cruz and Marco Rubio. Meanwhile, Hillary Clinton, with whom Putin’s regime had long had chilly relations, emerged as the favorite for the Democratic nomination over Bernie Sanders.\n\nIt was around this point — in mid-March 2016 — that the phishing campaign began to particularly target many Democrats’ and Clinton campaign staffers’ email accounts, according to SecureWorks’ analysis.\n\nThere were several other events that, in retrospect, are either relevant or at the very least intriguing:\n\nApril 7: Putin condemns the Panama Papers leak . In early April, an international consortium of journalists published reports on a cache of leaked documents tracing offshore wealth — the Panama Papers. Many of the documents revealed financial information about Putin’s inner circle, and Putin publicly claimed the stories were part of a US plot against Russia. “They are trying to destabilize us from within in order to make us more compliant,” he said. Many have posited that the Russian government may have then wished to retaliate.\n\nIn early April, an international consortium of journalists published reports on a cache of leaked documents tracing offshore wealth — the Panama Papers. Many of the documents revealed financial information about Putin’s inner circle, and Putin publicly claimed the stories were part of a US plot against Russia. “They are trying to destabilize us from within in order to make us more compliant,” he said. Many have posited that the Russian government may have then wished to retaliate. April 19: The domain for DCLeaks, a website that would eventually post many hacked documents, is registered . For now, nothing is posted. (US intelligence agencies have said Russia’s GRU is behind the site.)\n\n. For now, nothing is posted. (US intelligence agencies have said Russia’s GRU is behind the site.) April 26: George Papadopoulos g e t s an intriguing tip . Papadopoulos, a young foreign policy adviser to the Trump campaign, sat down in London with a professor named Joseph Mifsud. Mifsud told him he’d just traveled to Moscow and met high-level Russian government officials. He added to Papadopoulos that Russia had obtained “dirt” on Hillary Clinton, in the form of thousands of emails.\n\nPapadopoulos, a young foreign policy adviser to the Trump campaign, sat down in London with a professor named Joseph Mifsud. Mifsud told him he’d just traveled to Moscow and met high-level Russian government officials. He added to Papadopoulos that Russia had obtained “dirt” on Hillary Clinton, in the form of thousands of emails. June 6 to 8 : DCLeaks begins posting, but not about the election . DCLeaks’ posts of hacked documents indicated that it was Russian ties. That’s because they included the hacked emails of retired Gen. Philip Breedlove, who had commanded NATO forces in Europe and pushed for a harder line against Russia in Ukraine. They also included documents from George Soros’s Open Society Foundation. (The Russian government has blamed Soros and his associated groups for opposing its interests in Ukraine.)\n\nDCLeaks’ posts of hacked documents indicated that it was Russian ties. That’s because they included the hacked emails of retired Gen. Philip Breedlove, who had commanded NATO forces in Europe and pushed for a harder line against Russia in Ukraine. They also included documents from George Soros’s Open Society Foundation. (The Russian government has blamed Soros and his associated groups for opposing its interests in Ukraine.) June 9: The Trump Tower meeting: Shortly afterward, Donald Trump Jr., Paul Manafort, and Jared Kushner met a Russian lawyer and four other people with Russian ties at Trump Tower. Don Jr. had agreed to take the meeting based on the promise of “official documents and information that would incriminate Hillary,” as part of “Russia and its government’s support for Mr. Trump” (as it was put to him in an email). Everyone involved claims nothing came of this meeting.\n\nThroughout all this time, there was no public indication that the phishing campaign, or the hacking of the DNC and other campaign figures’ emails, had taken place. Just days later, that would change.\n\nThe email leaks begin\n\nOn June 12, 2016, WikiLeaks founder Julian Assange dropped a bombshell. “We have upcoming leaks in relation to Hillary Clinton,” he announced, during a British television interview. “We have emails pending publication.”\n\nWikiLeaks — a nonprofit launched back in 2006 by Assange, an Australian activist — had previously been most famous for posting a plethora of internal US military documents about the Iraq and Afghanistan wars (including video of a deadly airstrike) and more than 250,000 diplomatic cables from the US State Department — leaked by Chelsea Manning. Assange was then accused of rape and sexual assault in Sweden, and he sought political asylum from Ecuador. He has been holed up in the nation’s London embassy since June 2012.\n\nAssange’s announcement was the first public indication that Democrats would soon be plagued by leaked internal emails. So two days after that, the DNC, which had learned of the hacking of its systems and hired Crowdstrike to respond, decided to get in front of what it feared was coming. The committee told the Washington Post that it had been hacked — by, it claimed, the Russian government. Crowdstrike’s CEO put up a blog post explaining why he identified Russia as the culprit.\n\nYet the next day, June 15, things got even weirder — because that is when “Guccifer 2.0” arrived on the scene. (The name, a portmanteau of “Gucci” and “Lucifer,” is an homage to the original Guccifer, the jailed Romanian hacker Marcel Leher Lazar, who’d broken into high-profile Americans’ email accounts.)\n\nIn a Wordpress post, the new Guccifer said that Crowdstrike was quite wrong about the DNC hack, which he said was carried out by him, “a lone hacker.” (“Fuck CrowdStrike!!!” he wrote.) He said that he’d given “the main part of the papers, thousands of files and mails” that he’d stolen, to WikiLeaks. (WikiLeaks has refused to confirm that he was its source.) He also began to post several documents he claimed were from the DNC server.\n\nAlmost immediately, journalists pointed to inconsistencies in Guccifer’s story and linguistic tics to suggest he was Russian — or more than one Russian. (US intelligence agencies would eventually say Russia’s GRU was behind the persona, and the Daily Beast recently reported that the account’s user once slipped up and neglected to mask his identity through a VPN — allowing investigators to match a particular Russian intelligence officer to that Guccifer 2.0 login.)\n\nYet what Guccifer had access to was clearly broader than just the DNC. None of the first documents he posted showed up in WikiLeaks’ DNC email dump, and in fact, many of them eventually showed up in John Podesta’s emails, which were released much later. Additionally, on June 27, Guccifer emailed the Smoking Gun’s William Bastone a link to a password-protected post on DCLeaks.com that contained phished emails and documents from Clinton staffer Sarah Hamilton. (DCLeaks had not yet publicly posted any material related to the election.)\n\nOn July 6, Guccifer 2.0 posted his first documents that would eventually be found in the DNC emails. The New Yorker’s Raffi Khatchadourian speculates, based on some comments Guccifer made to journalists at the time, that Guccifer or his handlers were frustrated that WikiLeaks was taking too long to actually post the DNC material and were threatening to spoil Assange’s exclusive. (A week later, Guccifer would send documents to the Hill’s Joe Uchill, writing that he was doing so because the press was “gradually forget[ing] about me,” and complained that WikiLeaks was “playing for time.”)\n\nAll the while, Assange and WikiLeaks were working to prepare their database of DNC emails, with the apparent goal of publishing them before the Democratic convention began in late July. It’s unclear how they set that goal. Assange would later tell Khatchadourian that he originally had a deadline of July 18 to release them, but “we were given a little more time.” (It’s unclear, though, who gave him more time, and Assange later disputed the accuracy of the recorded quote.)\n\nFinally, on July 22 — the Friday before the convention — WikiLeaks posted those thousands of DNC emails and attachments online. They revealed that many DNC members privately spoke of Bernie Sanders with disdain, drove DNC Chair Debbie Wasserman Schultz and other top staffers to resign, and overall made an ugly start for the Democratic convention. Though Assange remained mum on his source, Guccifer 2.0 jubilantly claimed credit in a tweet:\n\nThe DNC leaks proved to be just the beginning. News soon broke that the Democratic Congressional Campaign Committee (DCCC) had also been hacked, and on August 12, DCCC documents started showing up on Guccifer’s Wordpress site. Guccifer also sent the DCCC’s internal turnout model data to Florida Republican Party operative Aaron Nevins, who was positively thrilled to receive it. “Holy fuck man I don’t think you realize what you gave me,” Nevins wrote in a DM. “This is probably worth millions of dollars.” Nevins soon put it online on his anonymously run blog.\n\nThen DCLeaks got in the game. On August 12, the site posted a few emails from some little-known Republican state party aides, and from campaign advisers to Sens. John McCain (R-AZ) and Lindsey Graham (R-SC), both of whom were known as Russia hawks. In September, the site’s anonymous administrators sent Colin Powell’s phished emails to reporters, revealing his candid assessments of both Clinton (“greedy”) and Trump (“national disgrace”).\n\nDCLeaks then posted phished emails from Ian Mellul, an Obama White House staffer who had volunteered for Clinton. The Mellul documents included a picture of Michelle Obama’s passport and a months-old audio file in which Hillary Clinton said Sanders’s young supporters were “living in their parents’ basement.” Longtime Clinton ally Capricia Marshall’s phished emails came next.\n\nMany of these disclosures caused brief stirs, but what everyone was really waiting for was the next WikiLeaks dump. Roger Stone, the Trump associate, claimed that he knew Assange had something huge on the way and speculated it would involve the Clinton Foundation.\n\nAssange himself told Fox News back on August 24 that his team had “thousands of pages of material” and was “working around the clock” to prepare it for publication. By early October, there was still nothing from WikiLeaks, but Stone continued to hype an imminent release, saying “an intermediary” who’d met with Assange said “the mother lode is coming Wednesday.”\n\nThe “mother lode” instead came two days later, on Friday, October 7, when WikiLeaks posted its first batch of Podesta’s emails. The site would continue to post them, in batches, up through the election. Earlier on that very same day, the US government officially attributed the hacking effort to the Russian government, and the Donald Trump Access Hollywood tape hit the news.\n\nIn the end, the 2016 election was close, decided by just over 1 percentage point in three Electoral College states. And whether or not the email leaks were sufficient to swing the outcome, they certainly were effective at keeping the words “Hillary Clinton” and “emails” in the headlines throughout the campaign’s final stretch.\n\nTrump associates tried to get in touch with hackers or leakers at least six separate times\n\nDuring the campaign, it was clear enough that Trump was unusually friendly to Russia, and that the Russian government interventions seemed aimed at trying to help his electoral chances at the expense of Hillary Clinton. But after the election, more and more attention became devoted to whether Trump associates and Putin’s government coordinated to intervene in the campaign in some way. And on March 20, 2017, then-FBI Director James Comey publicly confirmed the FBI was investigating just that topic.\n\nNo one has produced a smoking gun demonstrating clear involvement just yet. But this isn’t mere idle speculation, either — there are at least six instances in which Trump associates tried to get Russian dirt or communicated with hacking and leaking figures. The first of them was what initiated the FBI investigation into the Trump campaign and Russia to begin with:\n\n1) The Papadopoulos tip: Fancy Bear’s phishing campaign targeted Clinton staffers and Democrats in large numbers in March and April 2016, but the hacks remained publicly unknown for months afterward. Yet it was very early indeed — on April 26 — that Trump foreign policy adviser George Papadopoulos got his tip about what was coming.\n\nAs described above, the tip was from a source Papadopoulos understood to have Russian government connections, professor Joseph Mifsud. Mifsud specifically said he’d gained his information from traveling to Moscow and meeting high-level officials there. And he said Russia had “dirt” on Hillary Clinton — and, specifically, thousands of emails.\n\nWe don’t yet know whether he told others in the Trump campaign about what he’d heard. But it seems highly likely that he did. He was a young adviser eager to impress campaign higher-ups. And we already know he drunkenly bragged about his inside info to an Australian diplomat a few weeks later. (The Australians later told the FBI, which led the bureau to open the investigation.)\n\nIn any case, Papadopoulos was arrested last summer for making false statements to FBI investigators, cut a plea deal, and began cooperating with investigators. So whatever he did do with his tip, Mueller likely now knows it.\n\n2) The Trump Tower meeting: It was on June 3, 2016 — a little more than a month after Papadopoulos’s tip, but still before any news broke about Democrats having been hacked — that publicist Rob Goldstone emailed an acquaintance of his, Donald Trump Jr. Goldstone described some news from his clients Aras and Emin Agalarov, a father-son pair of real estate developers who’d done business with the Trumps:\n\nThe Crown prosecutor of Russia met with his father Aras this morning and in their meeting offered to provide the Trump campaign with some official documents and information that would incriminate Hillary and her dealings with Russia and would be very useful to your father. This is obviously very high level and sensitive information but is part of Russia and its government’s support for Mr. Trump - helped along by Aras and Emin.\n\nDon Jr. enthusiastically accepted the offer, and Goldstone arranged a meeting six days later, on June 9. The Trump delegation included Don Jr., Paul Manafort, and Jared Kushner. They met Goldstone, Russian lawyer Natalia Veselnitskaya, Agalarov company executive Ike Kaveladze, Russian-American lobbyist Rinat Akhmetshin, and translator Anatoli Samochornov.\n\nOnce the existence of the meeting became public, all parties involved claimed it was a dud, resulting in nothing of consequence. But the timing of the meeting is strange. Three days later, Assange announced he’d received emails related to Hillary Clinton. Two days after that, the DNC announced it had been hacked and blamed Russia.\n\nGoldstone saw an article about that and emailed it to Emin and Kaveladze, writing that the news was “eerily weird” considering what they’d just discussed at the Trump Tower meeting. Guccifer 2.0 began posting the day after that.\n\n3) The Cambridge Analytica CEO’s contacts with WikiLeaks: Cambridge Analytica is the Steve Bannon-tied firm that did digital work for the Trump campaign and has been in the news of late.\n\nAnd last year, we learned that Cambridge’s CEO, Alexander Nix, had twice contacted WikiLeaks on the topic of hacked emails.\n\nNix says that in “early June,” after he learned of Assange’s claims to have Hillary Clinton-related emails, he reached out to Julian Assange to ask for an advance look at those emails. He says Assange turned him down.\n\nThen in August, after Assange had posted the DNC emails, Nix emailed Cambridge employees to say that he’d recently reached out to Assange again, offering help at organizing the DNC material on WikiLeaks. He said he hadn’t yet heard back. Both Nix and Assange have said these overtures didn’t go anywhere.\n\n4) Donald Trump Jr.’s contacts with WikiLeaks: Then, separately, Donald Trump Jr. had some communications with WikiLeaks through the group’s Twitter account toward the end of the campaign.\n\nAs best we know, WikiLeaks began the communication, DMing Don Jr. to tell him that they had guessed the password to a new “PAC run anti-Trump site,” PutinTrump.org, that was about to launch. “Any comments?” the group asked. Trump Jr. answered: “Off the record I don’t know who that is but I’ll ask around. Thanks.”\n\nThen on October 3, 2016, WikiLeaks DMed Don Jr. again, asking him to “comment on” or “push” a story that Hillary Clinton had once said she wanted to “just drone” Assange. Don Jr. answered, “Already did that earlier today. It’s amazing what she can get away with.”\n\nHe then followed up with a question: “What’s behind this Wednesday leak I keep reading about?” This was at the height of chatter that WikiLeaks had a major batch of anti-Clinton material ready. However, there is no indication that WikiLeaks answered this question from Don Jr. or gave him any advance information that it was Podesta’s emails that were coming. The group sent him a couple more messages, but there are no more known responses from Don Jr.\n\n5) Roger Stone’s several contacts with both Guccifer 2.0 and WikiLeaks: Roger Stone is a longtime Republican operative with a reputation for dirty tricks and a decades-long relationship with Donald Trump. Stone was only an official Trump campaign adviser briefly, departing the operation in early August 2015 after clashing with other staffers. But he remained in Trump’s orbit and, to some extent, in communication with the candidate himself afterward.\n\nBoth in public and in private, Stone was fixated on the hackings and leaks.\n\nOne associate of Stone’s claimed to the Washington Post that at some point in the spring of 2016, before news of the hackings broke, Stone said he’d learned from Julian Assange that WikiLeaks had obtained emails that would hurt Democrats. (Stone denies this.)\n\nThe initial leaks from Guccifer 2.0 and WikiLeaks were posted in June and July. On August 4, Stone emailed fellow ex-Trump adviser and longtime associate Sam Nunberg: “I dined with Julian Assange last night,” according to the Wall Street Journal. (Stone says this was a joke and flight records prove he wasn’t in London then.)\n\nThe day after that email, on August 5, Stone penned a Breitbart article in which he took Guccifer’s story about being a lone hacker who stole the DNC emails at face value and argued Russia probably wasn’t responsible. He also tweeted that “Julian Assange is a hero.”\n\nThree days later, on August 8, Stone started publicly claiming to have inside information. “I actually have communicated with Assange,” he said. “I believe the next tranche of his documents pertain to the Clinton Foundation but there’s no telling what the October surprise may be.”\n\nA few days after that, Stone began tweeting at, and eventually DMing with, Guccifer 2.0 (who, again, has reportedly been identified as a Russian intelligence officer). Some of these DMs later leaked, leading Stone to post what he claimed was their full exchange. The posted messages are mainly friendly chitchat and not particularly substantive.\n\nOn August 21, Stone tweeted an odd prediction: “Trust me, it will soon the Podesta’s time in the barrel. #CrookedHillary.” Many would later point to this — which came months before the Podesta emails became public — and ask whether Stone had advance knowledge of the Podesta email leak. (Stone himself would later claim that since this came in the midst of a scandal surrounding Stone’s old friend Paul Manafort’s Ukraine work, he was merely predicting “Podesta’s business dealings would be exposed.”)\n\nAs October began, Stone took on a new role — as WikiLeaks’ hype man. He again claimed inside knowledge, saying a “friend” of his met with Assange and learned “the mother lode is coming Wednesday.” He tweeted: “Wednesday @HillaryClinton is done. #Wikileaks.” And when nothing came on Wednesday, Stone tweeted, “Libs thinking Assange will stand down are wishful thinking. Payload coming. #Lockthemup.” Assange published the Podesta emails two days later.\n\nImmediately, there were questions about whether the garrulous operative had been involved, which eventually spurred WikiLeaks to tweet that the group “has never communicated with Roger Stone.” The Atlantic later reported that Stone DMed the WikiLeaks Twitter account afterward, complaining that they were “attacking” him. “The false claims of association are being used by the democrats to undermine the impact of our publications,” WikiLeaks responded. “Don’t go there if you don’t want us to correct you.” Stone shot back: “Ha! The more you ‘correct’ me the more people think you’re lying. Your operation leaks like a sieve. You need to figure out who your friends are.”\n\nWhat to make of all this? Stone was obviously in contact with two of the key leakers, and his own public statements show that at one point he wanted people to think he had an inside line on WikiLeaks’ plans. However, he’s repeatedly denied any inside knowledge or involvement, and we haven’t seen any clear evidence that he truly had such knowledge.\n\nIn any case, we might learn more from Mueller’s probe soon enough. “They want me to testify against Roger,” Sam Nunberg said this year, referring to the special counsel’s team. “They want me to say that Roger was going around telling people he was colluding with Julian Assange.”\n\n6) Peter Smith’s hunt for Hillary’s deleted emails: Last but certainly not least, there is one more email-related subplot to the 2016 campaign — and it’s a weird one.\n\nThis one involves a separate set of emails: When word got out that Hillary Clinton had used a personal email account for all her work at the State Department, she agreed to hand over the work-related emails on that account to government investigators. But it turned out that she had previously deemed about 32,000 emails (about half of the total) to be “personal” rather than work-related, and deleted them.\n\nConservatives like longtime Republican operative Peter Smith didn’t take Clinton’s explanation for why she deleted the emails at face value and questioned whether they could have contained scandalous behavior or criminal evidence. Their number included GOP presidential nominee Donald Trump. “Russia, if you’re listening, I hope you’re able to find the 30,000 [Hillary Clinton] emails that are missing,” Trump said at a July 27, 2016, press conference. “I think you will probably be rewarded mightily by our press. Let’s see if that happens. That will be next.”\n\nIt was around this time that Smith began an unusual project. He assumed that Clinton’s email server had been hacked and that her emails must be out there somewhere, on the “dark web.” So he reached out to computer experts and conservative activists, hoping to assemble a team that would track down those emails.\n\nSmith didn’t work for the Trump campaign. But he is said to have repeatedly claimed to be in contact with Michael Flynn, who was advising Trump. One recruiting document Smith sent to cybersecurity expert Matt Tait contained the subheader “Trump Campaign (in coordination to the extent permitted as an independent expenditure).” It then listed several names: Steve Bannon, Kellyanne Conway, Sam Clovis, Flynn, and Lisa Nelson. (Bannon and Conway have denied any involvement. The other three haven’t commented.)\n\nEventually, Smith gave his version of what happened to the Wall Street Journal’s Shane Harris. He said his team found five hacker groups who said they had Clinton’s emails, of which two seemed to be Russian. “We knew the people who had these were probably around the Russian government,” Smith said. However, he went on, he couldn’t determine whether the emails were authentic, so he ended up just advising the hackers to give them to WikiLeaks. No such emails have ever surfaced. Smith — 81 years old and in poor health — killed himself in May 2017, 10 days after speaking to Harris.\n\nSmith’s effort appears to have failed. But Smith admitted he had tried to get stolen documents from groups he understood to be Russian government-tied. And then there is the question of Michael Flynn’s role — particularly since, per Harris’s sources, there are intelligence reports that say Russian hackers discussed how they could get leaked emails into Flynn’s hands. Much remains murky about this situation, but Flynn is cooperating with Mueller’s team as part of a plea deal, so the special counsel likely now knows whatever he does.\n\nMueller will likely bring charges in the email hacking matter. But against whom?\n\nLast November, the Wall Street Journal’s Aruna Viswanatha and Del Quentin Wilber reported that the Justice Department had identified more than six Russian government officials involved in the DNC hack and was considering bringing charges.\n\nInterestingly, though, the report claimed that special counsel Robert Mueller had chosen not to take over the DNC hack investigation because it was “relatively technical” and had already “been under way for nearly a year.”\n\nThat appears to have since changed. Both NBC News and the Daily Beast reported in March that Mueller had now taken charge of the email hacking investigation. And the Washington Post reported in January that Mueller had added “a veteran cyber prosecutor,” Ryan Dickey, to his team. (Credit to Marcy Wheeler for flagging this point.)\n\nSo it’s a pretty safe bet that Mueller will bring some charges related to the email hackings. And judging by his past indictments, he’ll also use them to tell a story about what exactly happened, to the extent he can. There is, after all, a good deal we still don’t know — for instance, how, exactly, did the DNC and Podesta emails get from the hackers to WikiLeaks?\n\nIt’s important to remember that this is all just what we know about — there could be more that is still not public. It is certainly possible that several of their contacts with real or purported leakers and hackers listed above went nowhere, but it’s a bit harder to believe that all six of those separate contacts resulted in nothing of consequence.\n\nMueller has already gotten three people tied to Trump to plead guilty and cooperate with the investigation. What is he getting from George Papadopoulos, who got the earliest known tip that the Russians hacked the emails? What is he getting from Michael Flynn, who may have been tied to Peter Smith’s effort to get Clinton emails from Russian hackers? What was he getting from Rick Gates, who was Paul Manafort’s right-hand man both before and during the campaign?\n\nAll three men have pleaded guilty, and we haven’t seen any of the fruits of their cooperation yet. They may be providing Mueller information about the hacked emails, and they may not. But it’s safe to say they’re telling Mueller a good deal that’s of interest — and eventually, we will find out what.",
    "title":"The hacked emails at the center of Mueller’s Russia investigation, explained",
    "description":"The leaks that plagued the DNC, John Podesta, and others are crucial to the Russian interference probe."
  },
  "42":{
    "id":"politifact14770",
    "text":"According to an insider report from the office of the Quartermaster at the Pentagon, the 2 million rounds of ammunition that “went missing” during Obama’s reign of terror were seized by US forces in Afghanistan and have been returned to the military inventory.\n\nBrig. General George Mason’s assistant Chief of Staff all but confirmed the report, saying that the matter has been turned over to those in charge of accountability. She hinted that this is exactly the kind of thing that could end up before Congress:\n\n“This was a huge violation of the public trust, not to mention an incredibly bold theft from the US taxpayer. Sourcres say the Taliban paid nearly a dollar a round. Someone in Obama’s circle pocketed that money.”\n\nNews Feed Observer’s correspondent Skip Tetheluda contacted Congressman Trey Gowdy’s office, who would not confirm or deny any of the allegations. Angela Corning, Gowdy’s publicist, says the Congressman would certainly be eager to look into the details if this pans out, which is looking pretty good right about now.\n\nThe ammo went missing in early spring, 2010, while Hillary Clinton was still Secretary of State. The issue was handled as an “inventory discrepancy” and swept under the rug. Well…that rug has been lifted and what’s underneath is just…filthy.",
    "title":"BREAKING: 2 Million Rounds Of Ammo That ‘Went Missing’ Under Obama Turns Up In Enemy Hands",
    "description":"According to an insider report from the office of the Quartermaster at the Pentagon, the 2 million rounds of ammunition that “went missing” during Obama’s reign of terror were seized by US forces in Afghanistan"
  },
  "43":{
    "id":"politifact13943",
    "text":"LOCATION. LOCATION. LOCATION.\n\nSince the 1980s, the Wilmington area has persisted as an active film production hub, supporting feature films, TV series, independent productions, and more. The Wilmington Regional Film Commission, Inc., takes up the mantle of marketing southeastern North Carolina’s many assets and location advantages to the industry; our staff knows the region inside and out, and can use working local knowledge to navigate everything from site location to scouting and production logistics. Contact us to start your film venture today.",
    "title":"Wilmington Regional Film Commission",
    "description":"We facilitate on-location filmmaking within the Wilmington, NC region by offering production companies a range of pre-production services."
  },
  "44":{
    "id":"politifact14794",
    "text":"ARE YOU READY? GET IT NOW!\n\nIncrease more than 500% of Email Subscribers!\n\nYour Information will never be shared with any third party.",
    "title":"Singer Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless Him And His Supporters.” Do You Support To Tina ? – American President Donald J. Tru",
    "description":"Actress Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless Him And His Supporters.” Do You Support To Tina ? Inerview:"
  },
  "45":{
    "id":"politifact14699",
    "text":"Alabama football Crimson Tide disqualified from national championship\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n2059 57339 Shares\n\nThe tide will not be rolling into the national championship game. Previous years title's may also be stripped from the team.\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n\/!\\ Report Abuse\n\nloading Biewty",
    "title":"Alabama football Crimson Tide disqualified from national championship",
    "description":"The tide will not be rolling into the national championship game.  Previous years title's may also be stripped from the team."
  },
  "46":{
    "id":"politifact14062",
    "text":"It seems as though there may be more than the normal forces at play here.\n\nFormer Governor of Alaska Sarah Palin was the victim of a horrendous crime this morning while driving to meet a friend on the Pacific Coast Highway. She was run off the road in what authorities are calling a hit and run and nearly killed. The SUV she was driving rolled over several times and ended up in a drainage ditch.\n\nGovernor Palin was taken to a local hospital under an alias in case the hit and run were on purpose and not a random act of reckless driving. According to her spokesman, she is currently in a coma with 2 broken vertebrae and a broken thigh.\n\nThe Palin family has been notified and are currently making their way to her bedside. The FBI has been dispatched to the scene to collect evidence. The vehicle that ran her off the road was caught on a traffic camera and is being hunted by every law enforcement agency in the northwest.\n\n[adrotate banner=\"3\"]\n\nThis is a developing story that will be updated.",
    "title":"JUST IN: Sarah Palin In A Coma After Hit And Run",
    "description":"It seems as though there may be more than the normal forces at play here.Former Governor of Alaska Sarah Palin was the victim of a horrendous crime this morning while driving to meet a friend on the Pacific Coast Highway. She was run off the road in what authorities are calling a hit and run and"
  },
  "47":{
    "id":"politifact14905",
    "text":"The guest list hasn’t been set for the royal wedding of Prince Harry and Meghan Markle, but a number of things could stand in the way of President Donald Trump getting an invite.\n\nBut a former U.S. president might make the list, due to his friendship with the young British royal: Barack Obama and his wife, former first lady Michelle, who appear to have amiable relations with Harry and his elder brother and future king, Prince William, the Duke of Cambridge.\n\nAsked about the potential guest list, Kensington Palace spokeswoman Julie Barley told Newsweek, “We’re focusing on the happy announcement of their engagement,” adding that invitations “will be announced in due course.”\n\nKeep up with this story and more by subscribing now\n\nMark Blinch\/Reuters\n\nWhen the Duke and Duchess of Cambridge were married, in 2011, the Obamas were left off the guest list because of the added security costs of protecting the president. The day of the wedding, thousands of Britons took the day off, and about 1,900 guests attended the ceremony in Westminster Abbey in central London. The Obamas traveled to the U.K. less than a month later for an official state visit. Since Obama is no longer president, he doesn’t require as extensive a security detail as he once did.\n\nIf Trump were to appear at Prince Harry’s wedding in spring 2018, it would likely spark protests. When Prime Minister Theresa May offered Trump a state visit early this year, polls showed that 2 million people intended to take part in a protest against him. The risk of embarrassment, were such a protest to occur at a royal wedding, might put the couple off inviting such a controversial figure.\n\nInstead of a state visit, Trump’s trip to the U.K., scheduled for early 2018, has been cast as a “working trip” where he will not meet the queen. In January, sources said Trump wanted to go “one better” than Obama’s state visit and play golf with Queen Elizabeth II at Balmoral Castle.\n\nRead more: Melania Trump “went bananas” when Ivana Trump called herself 'first lady'\n\nThe Obamas have forged a close relationship with Prince Harry. Former first lady Michelle Obama appeared with the 33-year-old royal for charity events in Chicago at the end of October. The former president was overheard quizzing Harry on his relationship with Markle, an American actor, when he sat with the prince at the Invictus Games, a sports event for injured servicemen and women founded by the prince, at the end of September in Toronto. Prince Harry also hosted Obama at Kensington Palace in May.\n\nAs for President Trump, Harry's wife-to-be revealed that she was not a fan. In an interview on The Nightly Show With Larry Wilmore during the 2016 election, Markle said she might decide to stay in Toronto—where her show, Suits, is filmed—if Trump were to win.\n\n“We film Suits in Toronto, and I might just stay in Canada. I mean, come on, if that's reality we are talking about, come on, that is a game changer in terms of how we move in the world here,” she said.\n\nMarkle supported Democrat Hillary Clinton during the election, calling Trump “misogynistic.”\n\nCanada’s Prime Minister Justin Trudeau and other Commonwealth leaders are expected to receive invitations to the wedding because of their nations' ties to the British Empire.",
    "title":"Obama, Not Donald Trump, May Be Invited to Royal Wedding of Prince Harry and Meghan Markle",
    "description":"The royals may prefer the Obamas to be at the big event than the Trump family."
  },
  "48":{
    "id":"politifact14112",
    "text":"A ship owned and operated by the Clinton Foundation was raided as it arrived from Africa this morning at the Port of Baltimore. The ship, which was supposed to be carrying “emergency supplies,” was actually carrying a cargo that had authorities stunned. BPA Harbormaster Jake Cummings explained to CNN:\n\n“We received a tip that the Clinton Foundation flagship, The Chelsea, was carrying illegal contraband into the United States. We honestly didn’t know what to expect, but what we found was simply…surreal. In the middle of the ship’s large manifest of containers, most of which were empty, we found 14 containing…people. Yes, people. They were all Refugees from places like Yemen and Syria and not a single one had any kind of documentation. We interviewed those who spoke English and were told that for $40K, anyone can catch a ride to the United States on a ship nobody would ever suspect.”\n\nImmigration was immediately called and found that of the 460 people on board illegally, not one had been through any kind of vetting process. After running the men through facial recognition, they found more than a dozen suspected terrorists who are on the US no-fly list. Those men were about to be unleashed on the public for $40K each.",
    "title":"BREAKING: Clinton Foundation Cargo Ship Raided At Port Of Baltimore Reveals Sick Secret",
    "description":"A ship owned and operated by the Clinton Foundation was raided as it arrived from Africa this morning at the Port of Baltimore. The ship, which was..."
  },
  "49":{
    "id":"politifact14621",
    "text":"The federal government grants some businesses the ability to pay reduced or no taxes because they are set up as a “non-profit.” The NFL is one of those businesses – or was, until Sunday evening when Donald Trump quietly signed an executive order removing the sports league’s non-profit status.\n\nThe order notes the un-American attitude displayed by the players, who repeatedly kneel during the National Anthem, burn flags in their locker rooms, and disrespect our country in every way imaginable.\n\nTo date, little has been done to stop players from disrespecting our military, our flag, and all they stand for, so President Trump “temporarily” revoked their 401(c)(3) status “until it is clear that players and team owners respect their country.”\n\nThe NFL will be classified as a for-profit entity for tax purposes for the 2017 fiscal year, but the order allows the league to re-apply for tax-exempt status in January 2018 “if all of the problems are solved.”\n\nThe White House spokeswoman told Breitbart News that the President hopes to see all the “athletes protesting our police and our flag or otherwise using their positions to spread hate” fired and replaced with people who “love and respect America.”\n\n[adrotate banner=\"3\"]\n\nThe NFL has thus far refused comment.",
    "title":"BREAKING: President Trump Signs Executive Order Stripping NFL Of ‘Non-Profit’ Status",
    "description":"The federal government grants some businesses the ability to pay reduced or no taxes because they are set up as a “non-profit.” The NFL is one of those businesses – or was, until Sunday evening when Donald Trump quietly signed an executive order removing the sports league’s non-profit status.The"
  },
  "50":{
    "id":"politifact14361",
    "text":"Bryan Cranston and Donald Trump. Ilya S. Savenok; Gary Gershoff\/Getty\n\nWith Election Day close and a Donald Trump presidency appearing increasingly likely, some of Hollywood's left-leaning stars are preparing to emigrate to the country up north if things go sour for them.\n\n\"Breaking Bad\" actor Bryan Cranston is the latest celebrity to suggest that he would leave the US for Canada in the event of a Trump victory in Tuesday's election.\n\nHe joins the likes of Barbara Streisand, Chelsea Handler, and several others who are planning to cross the border into the land of liberal prime minister Justin Trudeau should Hillary Clinton lose.\n\nHere are 9 celebrities who say they'll move to Canada if Donald Trump becomes president:",
    "title":"9 celebrities who say they'll move to Canada if Donald Trump becomes president",
    "description":"With a Donald Trump presidency appearing increasingly likely, Hollywood stars like Bryan Cranston and Barbara Streisand are preparing to emigrate to Canada."
  },
  "51":{
    "id":"politifact14417",
    "text":"Horrible news are coming from the President’s house while President Trump on Friday began a 17-day stint at his prized golf club in Bedminster, NJ.\n\nBarron Trump has been rushed to hospital with severe pneumonia while on holiday in Bedminster, NJ.\n\nBarron is currently receiving treatment in hospital, reports Fox News.\n\nThe 11-year-old sent a Snap to his friends yesterday with a drip attached in his arm along with hospital wrist.\n\nBarron Trump captioned the image: “Not the sort of bangles I usually choose on holiday.”\n\nHe also tweeted his friends, saying that he was currently ‘in a wheelchair, connected up to tubes, in a hospital’.",
    "title":"BREAKING: Barron Trump Rushed To The Hospital, Hospital Releases Statement On His Condition",
    "description":"Horrible news are coming from the President’s house while President Trump on Friday began a 17-day stint at his prized golf club in Bedminster, NJ. Barron Trump has been rushed to hospital with severe pneumonia while on holiday in Bedminster, NJ. Barron is currently receiving treatment in hospital, reports Fox News. The 11-year-old sent a Snap to his …"
  },
  "52":{
    "id":"politifact14940",
    "text":"It is for that reason that I rise today, to talk about the truth, and its relationship to democracy. For without truth, and a principled fidelity to truth and to shared facts, Mr. President, our democracy will not last.\n\n2017 was a year which saw the truth – objective, empirical, evidence-based truth -- more battered and abused than any other in the history of our country, at the hands of the most powerful figure in our government. It was a year which saw the White House enshrine “alternative facts” into the American lexicon, as justification for what used to be known simply as good old-fashioned falsehoods. It was the year in which an unrelenting daily assault on the constitutionally-protected free press was launched by that same White House, an assault that is as unprecedented as it is unwarranted. “The enemy of the people,” was what the president of the United States called the free press in 2017.\n\nMr. President, it is a testament to the condition of our democracy that our own president uses words infamously spoken by Josef Stalin to describe his enemies. It bears noting that so fraught with malice was the phrase “enemy of the people,” that even Nikita Khrushchev forbade its use, telling the Soviet Communist Party that the phrase had been introduced by Stalin for the purpose of “annihilating such individuals” who disagreed with the supreme leader.\n\nThis alone should be a source of great shame for us in this body, especially for those of us in the president’s party. For they are shameful, repulsive statements. And, of course, the president has it precisely backward – despotism is the enemy of the people. The free press is the despot’s enemy, which makes the free press the guardian of democracy. When a figure in power reflexively calls any press that doesn’t suit him “fake news,” it is that person who should be the figure of suspicion, not the press.\n\nI dare say that anyone who has the privilege and awesome responsibility to serve in this chamber knows that these reflexive slurs of “fake news” are dubious, at best. Those of us who travel overseas, especially to war zones and other troubled areas around the globe, encounter members of U.S. based media who risk their lives, and sometimes lose their lives, reporting on the truth. To dismiss their work as fake news is an affront to their commitment and their sacrifice.\n\nAccording to the International Federation of Journalists, 80 journalists were killed in 2017, and a new report from the Committee to Protect Journalists documents that the number of journalists imprisoned around the world has reached 262, which is a new record. This total includes 21 reporters who are being held on “false news” charges.\n\nMr. President, so powerful is the presidency that the damage done by the sustained attack on the truth will not be confined to the president’s time in office. Here in America, we do not pay obeisance to the powerful – in fact, we question the powerful most ardently – to do so is our birthright and a requirement of our citizenship -- and so, we know well that no matter how powerful, no president will ever have dominion over objective reality.\n\nNo politician will ever get to tell us what the truth is and is not. And anyone who presumes to try to attack or manipulate the truth to his own purposes should be made to realize the mistake and be held to account. That is our job here. And that is just as Madison, Hamilton, and Jay would have it.\n\nOf course, a major difference between politicians and the free press is that the press usually corrects itself when it gets something wrong. Politicians don’t.\n\nNo longer can we compound attacks on truth with our silent acquiescence. No longer can we turn a blind eye or a deaf ear to these assaults on our institutions. And Mr. President, an American president who cannot take criticism – who must constantly deflect and distort and distract – who must find someone else to blame -- is charting a very dangerous path. And a Congress that fails to act as a check on the president adds to the danger.\n\nNow, we are told via twitter that today the president intends to announce his choice for the “most corrupt and dishonest” media awards. It beggars belief that an American president would engage in such a spectacle. But here we are.\n\nAnd so, 2018 must be the year in which the truth takes a stand against power that would weaken it. In this effort, the choice is quite simple. And in this effort, the truth needs as many allies as possible. Together, my colleagues, we are powerful. Together, we have it within us to turn back these attacks, right these wrongs, repair this damage, restore reverence for our institutions, and prevent further moral vandalism.\n\nTogether, united in the purpose to do our jobs under the Constitution, without regard to party or party loyalty, let us resolve to be allies of the truth -- and not partners in its destruction.\n\nIt is not my purpose here to inventory all of the official untruths of the past year. But a brief survey is in order. Some untruths are trivial – such as the bizarre contention regarding the crowd size at last year’s inaugural.\n\nBut many untruths are not at all trivial – such as the seminal untruth of the president’s political career - the oft-repeated conspiracy about the birthplace of President Obama. Also not trivial are the equally pernicious fantasies about rigged elections and massive voter fraud, which are as destructive as they are inaccurate – to the effort to undermine confidence in the federal courts, federal law enforcement, the intelligence community and the free press, to perhaps the most vexing untruth of all – the supposed “hoax” at the heart of special counsel Robert Mueller’s Russia investigation.\n\nTo be very clear, to call the Russia matter a “hoax” – as the president has many times – is a falsehood. We know that the attacks orchestrated by the Russian government during the election were real and constitute a grave threat to both American sovereignty and to our national security. It is in the interest of every American to get to the bottom of this matter, wherever the investigation leads.\n\nIgnoring or denying the truth about hostile Russian intentions toward the United States leaves us vulnerable to further attacks. We are told by our intelligence agencies that those attacks are ongoing, yet it has recently been reported that there has not been a single cabinet-level meeting regarding Russian interference and how to defend America against these attacks. Not one. What might seem like a casual and routine untruth – so casual and routine that it has by now become the white noise of Washington - is in fact a serious lapse in the defense of our country.\n\nMr. President, let us be clear. The impulses underlying the dissemination of such untruths are not benign. They have the effect of eroding trust in our vital institutions and conditioning the public to no longer trust them. The destructive effect of this kind of behavior on our democracy cannot be overstated.\n\nMr. President, every word that a president utters projects American values around the world. The values of free expression and a reverence for the free press have been our global hallmark, for it is our ability to freely air the truth that keeps our government honest and keeps a people free. Between the mighty and the modest, truth is the great leveler. And so, respect for freedom of the press has always been one of our most important exports.\n\nBut a recent report published in our free press should raise an alarm. Reading from the story:\n\n“In February…Syrian President Bashar Assad brushed off an Amnesty International report that some 13,000 people had been killed at one of his military prisons by saying, “You can forge anything these days, we are living in a fake news era.”\n\nIn the Philippines, President Rodrigo Duterte has complained of being “demonized” by “fake news.” Last month, the report continues, with our President, quote “laughing by his side” Duterte called reporters “spies.”\n\nIn July, Venezuelan President Nicolas Maduro complained to the Russian propaganda outlet, that the world media had “spread lots of false versions, lots of lies” about his country, adding, “This is what we call ‘fake news’ today, isn’t it?”\n\nThere are more:\n\n“A state official in Myanmar recently said, “There is no such thing as Rohingya. It is fake news,” referring to the persecuted ethnic group.\n\nLeaders in Singapore, a country known for restricting free speech, have promised “fake news” legislation in the new year.”\n\nAnd on and on. This feedback loop is disgraceful, Mr. President. Not only has the past year seen an American president borrow despotic language to refer to the free press, but it seems he has in turn inspired dictators and authoritarians with his own language. This is reprehensible.\n\nWe are not in a “fake news” era, as Bashar Assad says. We are, rather, in an era in which the authoritarian impulse is reasserting itself, to challenge free people and free societies, everywhere.\n\nIn our own country, from the trivial to the truly dangerous, it is the range and regularity of the untruths we see that should be cause for profound alarm, and spur to action. Add to that the by-now predictable habit of calling true things false, and false things true, and we have a recipe for disaster. As George Orwell warned, “The further a society drifts from the truth, the more it will hate those who speak it.”\n\nAny of us who have spent time in public life have endured news coverage we felt was jaded or unfair. But in our positions, to employ even idle threats to use laws or regulations to stifle criticism is corrosive to our democratic institutions. Simply put: it is the press’s obligation to uncover the truth about power. It is the people’s right to criticize their government. And it is our job to take it.\n\nWhat is the goal of laying siege to the truth? President John F. Kennedy, in a stirring speech on the 20th anniversary of the Voice of America, was eloquent in answer to that question:\n\n“We are not afraid to entrust the American people with unpleasant facts, foreign ideas, alien philosophies, and competitive values. For a nation that is afraid to let its people judge the truth and falsehood in an open market is a nation that is afraid of its people.”\n\nMr. President, the question of why the truth is now under such assault may well be for historians to determine. But for those who cherish American constitutional democracy, what matters is the effect on America and her people and her standing in an increasingly unstable world -- made all the more unstable by these very fabrications. What matters is the daily disassembling of our democratic institutions.\n\nWe are a mature democracy – it is well past time that we stop excusing or ignoring – or worse, endorsing -- these attacks on the truth. For if we compromise the truth for the sake of our politics, we are lost.\n\nI sincerely thank my colleagues for their indulgence today. I will close by borrowing the words of an early adherent to my faith that I find has special resonance at this moment. His name was John Jacques, and as a young missionary in England he contemplated the question: “What is truth?” His search was expressed in poetry and ultimately in a hymn that I grew up with, titled “Oh Say, What is Truth.” It ends as follows:\n\n“Then say, what is truth? ‘Tis the last and the first,\n\nFor the limits of time it steps o’er.\n\nTho the heavens depart and the earth’s fountains burst.\n\nTruth, the sum of existence, will weather the worst,\n\nEternal… unchanged… evermore.”\n\nThank you, Mr. President. I yield the floor.\n\n",
    "title":"Full text: Jeff Flake on Trump speech transcript",
    "description":"Sen. Flake delivered the speech to the Senate on Wednesday."
  },
  "53":{
    "id":"politifact15291",
    "text":"HOUSTON, TEXAS – Anti-apartheid and human rights activist Archbishop Desmond Tutu has died in Texas at the age of 86.\n\nHis wife Leah Tutu told reporters that the couple were in Texas for holiday and had plans of greeting George H.W Bush who lost his wife few days ago.\n\nAccording to Leah Tutu, Desmond Tutu was rushed to hospital in the wee hours of Saturday morning where he passed on. The cause of his death is not immediately known.\n\nIn August 2016, Tutu’s daughter Thandeka Tutu-Gxashe he was in the hospital for treatment of a recurring infection.\n\nZimbabwean leader Robert Mugabe may have described him as “evil”, but Archbishop Desmond Tutu remained a much-loved figure across the world – principally for his role in South Africa’s struggle against apartheid.\n\nDuring the long years that Nelson Mandela was in prison, Archbishop Tutu spoke out against the regime – and won the Nobel peace prize in 1984 for his efforts.\n\nHe was chosen by President Mandela to chair South Africa’s Truth and Reconciliation Commission and investigate the crimes committed by all sides during the apartheid regime.\n\nBefore his demise, “the Arch” – as he was known – had remained irrepressible and influential both in his native South Africa and on the global political stage.\n\nHe was chairman of a group of former world leaders called The Elders, launched on Nelson Mandela’s 89th birthday in 2007 with the aim of tackling some of the world’s most pressing problems.\n\nLoading...",
    "title":"Archbishop Desmond Tutu dies while holidaying in Texas",
    "description":"Loading..."
  },
  "54":{
    "id":"politifact14567",
    "text":"Twelve More Hurricanes Headed Towards US\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n2059 4384 Shares\n\nThe National Hurricane Center has issued twelve more hurricane warnings for the east coast of the US. Hurricanes Ophelia, Hurricane Philippe, Hurricane Selma, Hurricane Tammy, Hurricane Vince, are expected to hit in the next two weeks, with seven additional hurricanes to follow next month. \"Regardless of which coast you live on, be prepared to evacuate at least twelve times\" the National Weather Services said Thursday, not ruling out the possibility of a thirteenth hurricane by the end of the year.\n\nThis is a satirical website. Don't take it Seriously. It's a joke.\n\n\/!\\ Report Abuse\n\nloading Biewty",
    "title":"Twelve More Hurricanes Headed Towards US",
    "description":"The National Hurricane Center has issued twelve more hurricane warnings for the east coast of the US. Hurricanes Ophelia, Hurricane Philippe, Hurricane Selma, Hurricane Tammy, Hurricane Vince, are expected to hit in the next two weeks, with seven additional hurricanes to follow next month.  Regardless of which coast you live on, be prepared to evacuate at least twelve times  the National Weather Services said Thursday, not ruling out the possibility of a thirteenth hurricane by the end of the year."
  },
  "55":{
    "id":"politifact13773",
    "text":"327783 1730 198 0\n\nA Japanese whaling crew has fallen victim to a dramatic full on assault by a school of killer whales, killing no less then 16 crew members and injuring 12, has reported the Japanese Government this morning.\n\nThe crew of the MV Nisshin Maru (日新丸), Japan’s primary whaling vessel and the world’s only whaler factory ship, was forced to leave the deck temporarily as a gas leak was detected within the ship’s processing factory that resulted in the ship being temporarily disabled all while continuing to carry approximately 1,000 tons of oil.\n\nThe resulting panic lead members of the ship to jump off the boat before proper emergency procedures were taken and lifeboats had been set to sea. The swimming crew members were then ferociously attacked by a school of killer whales, that decimated a large number of the crew within moments. “It was horrific” claims Asuka Kumara, a mechanical engineer who witnessed the gruesome scene. “The water was red with blood, there were bodies everywhere” he recalls in tears.\n\nWithin 30 minutes of the incident, 16 crew members had disappeared into the ocean.\n\nThe incident occurred in the Southern Ocean Whale Sanctuary, near the South Eastern Coast of South Africa, a controversial area to be whaling as a recent international court ruling has ordered the country to ends its whale hunt in the Antarctic. The East Asian nation halted its annual Antarctic whaling mission after the U.N.’s International Court of Justice (ICJ) ruled last march the hunt violated an international moratorium on commercial whaling.\n\n“It seems Japan just doesn’t give a damn about international law” explains environmental activist and spokesman for Greenpeace Canada, James Ben Shahali, based in Vancouver. “The waste of life is always a shame, but the whales are not to blame here, they were only doing what they are born to do: kill for food” he adds.\n\nJapan has slaughtered over 6,000 whales since commercial whaling was made illegal by the International Whaling Commission (IWC) moratorium passed in 1986.",
    "title":"Japanese Whaling Crew Eaten Alive By Killer Whales, 16 dead",
    "description":"A Japanese whaling crew has fallen victim to a dramatic full on assault by a school of killer whales, killing no less then 16 crew members and injuring 12, has reported the Japanese Government this morning. The crew of the MV Nisshin Maru (日新丸), Japan's primary whaling vessel and the world's only whaler factory ship, was forced to leave…"
  },
  "56":{
    "id":"politifact15095",
    "text":"News reports have confirmed that actor Kirk Douglas died of natural causes late this afternoon, Los Angeles coroners office reported. This was just 4 days before he would have turned 101 years old.\n\nFamily released a statement saying he “went comfortably and was in no pain” and “lived a long and prosperous life that people only dream of.”\n\nKirk Douglas was an American actor, producer, director, and author. He was one of the last living people of the film industry’s Golden Age. After an impoverished childhood with immigrant parents and six sisters, he had his film debut in The Strange Love of Martha Ivers (1946) with Barbara Stanwyck. Douglas soon developed into a leading box-office star throughout the 1950s and 1960s, known for serious dramas, including westerns and war movies. During his career he appeared in more than 90 movies. Douglas was well known for his explosive acting style.\n\nAs an actor and philanthropist, Douglas had received three Academy Award nominations, an Oscar for Lifetime Achievement, and the Presidential Medal of Freedom. As an author, he had written ten novels and memoirs. He was No. 17 on the American Film Institute’s list of the greatest male screen legends of classic Hollywood cinema, and the highest-ranked living person on the list. After barely surviving a helicopter crash in 1991 and then suffering a stroke in 1996, he had focused on renewing his spiritual and religious life. He lived with his second wife (of 63 years), Anne Buydens, a producer. He was to turn 101 on December 9, 2016.",
    "title":"Legendary Actor Kirk Douglas Dead, 4 Days Before His 101st Birthday",
    "description":"News reports have confirmed that actor Kirk Douglas died of natural causes late this afternoon, Los Angeles coroners office reported. This was just 4 days before he would have turned 101 years old. Family released a statement saying he \"went comfortably and was in no pain\" and \"lived a long and p"
  },
  "57":{
    "id":"politifact14769",
    "text":"According to a new study by NASA, Ancient underground streams of heated rock, called a mantle plume, might be an explanation for the instability of Antarctica’s western ice sheet, which is melting at a fairly rapid rate.\n\nScientists have been debating whether or not mantle plume could be responsible for western Antarctica’s instability, recent studies have shown some evidence of the claim, but some are still skeptical.\n\n“I thought it was crazy,” Hélène Seroussi, the study’s co-author and scientist at NASA’s Jet Propulsion Laboratory, said in a release.\n\n“I didn’t see how we could have that amount of heat and still have ice on top of it,” Seroussi said in a statement.\n\nNASA has said that Seroussi’s study has provided evidence of geothermal activity underneath the world largest ice sheet, but scientists were still seemingly more worried about future global warming’s effects on the ice sheet.\n\nNASA glaciologist Eric Rignot said western ice sheet collapse is “unstoppable” and could dramatically raise sea levels.\n\nMantle Plume’s are rivers of thin or melted rock that makes it’s way up towards earths surface and heats the crust above it, creating lakes and rivers of melted water underneath the massive ice sheet. Seroussi’s study showed a mantle plume pushes 150 milliwatts per square meter of heat up towards the ice sheet. That’s about two to three times the heat flux of regions of the world without volcanic activity.\n\nA 2014 University of Texas study found western Antarctica was a literal hotbed for geothermal heat. Researchers concluded that “large areas at the base of Thwaites Glacier are actively melting in response to geothermal flux consistent with rift-associated magma migration and volcanism.”\n\nThe following year, a team of U.S. scientists confirmed in a study, the large amount of geothermal heat beneath the ice sheet, “The high geothermal heat flux may help to explain why ice streams and subglacial lakes are so abundant and dynamic in this region,” the study found.",
    "title":"BUSTED: NASA Accidentally Destroys Every Climate Change Advocate By Exposing Massive Truth Behind Antartica",
    "description":"According to a new study by NASA, Ancient underground streams of heated rock, called a mantle plume, might be an explanation for the instability of Antarctica’s western ice sheet, which is..."
  },
  "58":{
    "id":"politifact14664",
    "text":"UPDATE: Consistent with our subsequent coverage of the California wildfires, this story has been updated to clarify that Jesus Fabian Gonzales is not suspected of the recent Sonoma County fires that killed 40 residents.\n\nThe U.S. Immigration & Customs Enforcement Agency (ICE) issued a detainer request on the Sonoma County Jail for Jesus Fabian Gonzalez, who was arrested Sunday on suspicion of arson in Wine Country fires.\n\nBreitbart News reported earlier this week that Sonoma County Sheriffs had arrested Jesus Fabian Gonzalez, 29, at Maxwell Regional Park in Sonoma County after a series of reports of ongoing fires in the region. Mr. Gonzalez was observed around 3:00 p.m. PDT wearing a jacket and walking “out of the creek area and a plume of smoke behind him,” according to the Santa Rosa Press Democrat.\n\nMr. Gonzalez, who is homeless and reportedly known by law enforcement to have been living under a nearby bridge, claimed he was cold and had lit the fire to stay warm. But it was a balmy 78 degrees when he and the plume of smoke were first observed.\n\nMr. Gonzalez was booked into the Sonoma County Jail for suspicion of felony arson. His bail was set at a steep $110,000, according to the Sonoma County Sheriff Public Information Officer.\n\nSargent Spencer Crum told Breitbart that Mr. Gonzalez is also on a U.S. Immigration & Customs Enforcement Agency (ICE) detainer request, despite Sonoma County declaring itself as a “sanctuary county” in May 2014. The county only cooperates with “ICE holds” if the prisoner has been convicted of a felony or any misdemeanor offence that falls within the Trust Act within the last five years. Mr. Gonzalez’s immigration status has not yet been announced.\n\nThe American Civil Liberties Union argues detainers are a violation of “unreasonable searches and seizures” under the U.S. Constitution’s Fourth Amendment.\n\nThe Sonoma County Sheriff Department’s “1.0 Policy Statement” reads: “No person shall be held solely on the basis of their immigration status.” The policy adds that “the immigration status of a person, and the lack of immigration documentation, should have no bearing on the manner in which Sheriff’s Office personnel execute their duties.”\n\nAccording to ICE documents, Sonoma County declined 491 detainer requests in 2014 and 2015. During the 2017 period from January 28 through February 3, when President Donald Trump issued his immigration Executive Order 13768 to require all federal, state and local government to comply with ICE detainers, Sonoma County still denied detainers.\n\nSonoma County fires have killed dozens. 172 are still missing and 102,000 residents have been dislocated — about one-fifth of the entire population. The latest financial losses include 3,819 unincorporated parcels with 100 structures valued at $2,016,962,239, and 2,907 homes and 86 commercial units lost in the city of Santa Rosa valued at $1.18 billion.",
    "title":"ICE Detainer Issued for Suspected Wine Country Arsonist in Sonoma Jail",
    "description":"ICE issued a detainer request on the Sonoma County Jail for Jesus Fabian Gonzalez, who was arrested on suspicion of arson in Wine Country."
  },
  "59":{
    "id":"politifact15271",
    "text":"Aktifkan Javascript\n\n\n\nMau Menonton Secara Gratis ??, hidupkan Javascript di dalam pengaturan browser dulu ya!!!.",
    "title":"lk21 Situs Nonton Film Streaming Gratis Sub Indo",
    "description":"Lk21 adalah salah satu situs nonton film sub indo gratis menyediakan movie paling update di semua genre, tersedia link download film free."
  },
  "60":{
    "id":"politifact14514",
    "text":"The building Jared Kushner was reportedly in is gone. .\n\nMar-A-Lago was at the front and center of a rogue wave created by the outer bands of Hurricane Irma. The wave, spanning hundreds of yards across and nearly 20-feet high crashed directly into the Palm Beach estate of President Trump.\n\nSeveral other properties on either side, including the home of guitar legend Kieth Richards, were also destroyed. The staff at Mar-A-Lago had been sent home except for those who live on the property. They were all in the “safe” building towards the rear of the property when the wave hit.\n\nThe building, designed by Eric Trump, was supposed to be able to withstand bunker-busting bombs. He told the National Report that the reason the water was able to penetrate was simple physics:\n\n“I designed the building for an air raid. Who would ever think that the threat would come from the side? Those walls were just normal walls to keep cost down. The roof was what was designed to absorb the impact. Mass equals force times accelarated ions.”\n\nEric Trump was a decorated mathematician at Oxford and scored well above genius on the Hershman-Rorytar Test. Clearly, the fault for Kushner’s probable fate lies with Kushner himself for not seeking proper shelter.",
    "title":"Breaking: Mar-A-Lago Destroyed By Irma-Jared Kushner Still Missing",
    "description":"The building Jared Kushner was reportedly in is gone."
  },
  "61":{
    "id":"politifact15398",
    "text":"No one likely ever thought that Prince William would miss his little brother's wedding. Sadly, it might just happen.\n\nThe latest news from sources is that Prince William is in the middle of a huge predicament, one that could change relationships.\n\nPrince William has to choose to either go to Prince Harry's wedding and stand by his side as the best man or choose to attend a soccer game.\n\nWhile for most of us it seems like an easy choice. Family over soccer. However, for Prince William, it won't be so easy.\n\nSaturday is not just the big Royal wedding; it's also England's Football Association Cup final against Manchester United and Chelsea. He is expected to be there.\n\nKnowing what we know about Prince William, he would rather be at the wedding than at a soccer game. However, it's not just a soccer game and he's not just a spectator, he's the FA president. He has been for over a decade.\n\nEach and every year, the FA president is expected to be in attendance at the final game at Wembley Stadium. The president's job is also to award the final cup trophy to the winning team.\n\nThis long-standing tradition and a popular England sporting event will be a hard one for Prince William to miss.\n\nWhile this quandary isn't unexpected news to Prince William, he's been thinking about it for months. In an interview with radio broadcaster Rio Ferdinand in January, he expressed his upcoming dilemma.\n\n“It’s a big decision, are we going to Wembley, or are we going to...?” William asking Rio. “You’ve touched on something there, Rio, yeah. I’m still working it out. I’ll see what I can do.”\n\nEven though both events are happening the same day, he may be able to attend both. The wedding is at noon, and the soccer game is at 5:30 p.m.\n\nBeing 20 miles apart from each other, he could attend the reception at St. George's Chapel and take his helicopter to Wembley to present the trophy. After that, he could travel back to the evening reception at the Frogmore House.\n\nThere is no final word yet as to what Prince William will do. Let's hope he can pull it off!\n\nDo you think he can? Let us know in the comment section!\n\nhttps:\/\/rumble.com\/embed\/u9sgx.v1e83z\/\n\nIn other news, a famous athlete dies in a horrendous car crash after dropping his kids off at school. The family is requesting prayers.",
    "title":"Prince William May Not Attend Royal Wedding Leaving Harry Without a Best Man; Princess Diana Would Not Be Happy",
    "description":"What do you think Princess Diana would say?"
  },
  "62":{
    "id":"politifact15301",
    "text":"Apply Now and Win the Canada Diversity Immigration Visa Lottery (DV-2019) Program | Live and work in Canada\n\nApply and Win the Canada DV-2019 Immigration Visa Lottery -Application is Free | Nigerians Inclusive\n\nThe annual Lottery known as Green card Lottery is a Canadian Government program that makes more than 55, 000 permanent resident cards each year to every person from “underrepresented Countries,” which has been less represented in employment and in family-based categories in Canada and who meets these two basic eligibility requirements.\n\nThis year (2018) Green Card Lottery Program DV-2018 (the year successful Applicants will may enter Canada on the Green Card they have won) and is now opened to individuals world-wide who meets two basic entry requirements. The program makes Permanent resident cards available to winners, and authorizing the winners and their families to live, Study and work in the United States of America as Permanent residents. The Green card program is the United States Congressionally-mandated program for receiving a Canada Permanent resident card also known as the Canada Green Card due to the green colour of the Canada Green Card. Click the link to Start Application\n\nTo Register for the 2018 Canada Immigration Visa Lottery, you would have to follow these simple steps below\n\nProvide\/Upload Photos of your self or your Co-Applicant\n\nWe will crop and resize the photo so as to meet our Diversity Visa Lottery requirement\n\nWe will submit your complete and Error Free Application\n\nCheck online, if you won your Diversity Visa Green Card\n\nWinners are notified by the Canadian Government by mail and by email from us\n\nWinners receives advice on how to file the formal Visa Application, at no additional cost\n\nWinners receives interview preparation advice, at no additional cost\n\nWe accepts registration 365 days a year\n\nFree online Support from our Canada Immigration Experts\n\nTo Start Application, Click on the Template Below\n\nLike this: Like Loading...",
    "title":"Apply Now and Win the Canada Diversity Immigration Visa Lottery (DV-2019) Program",
    "description":"Apply and Win the Canada DV-2019 Immigration Visa Lottery -Application is Free | Nigerians Inclusive The annual Lottery known as Green card Lottery is a Canadian Government program that makes more than 55, 000 permanent resident cards each year to every person from “underrepresented Countries,” which has been less represented in employment and in family-based categories in …"
  },
  "63":{
    "id":"politifact14944",
    "text":"Thousands of government workers are unsure whether or not they will be heading to work on Monday amid uncertainty about how long a government shutdown will last.\n\nUncertainty is the byproduct of a government shutdown, with its impact often hard to predict. However, clues exist in the last shutdown, which was in 2013.\n\nKey services will continue, and many agencies plan to use carryover funds to remain open for several days. But each day the shutdown lasts adds to the pressure on agencies, government employees and civilian contractors, as well as Americans who rely on various federal services.\n\nEmployees considered “essential” will still be required to report to work should the shutdown continue, while those in positions deemed “nonessential” will be barred from coming in.\n\nThe White House on Friday pledged to minimize the effects of the shutdown on the American people, with one official noting that the administration has urged government agencies “to do as much as they can” within the law to maintain operations.\n\nThe push for departments and agencies to utilize existing funding to remain open suggests the Trump administration is hedging its bets that lawmakers can reach a deal and avoid a shutdown the length of one in 2013, which lasted 16 days.\n\nEach federal agency has a contingency plan for a shutdown that is written with help from the White House’s Office of Management and Budget. But the impact of the shutdown, which began at midnight when the Senate failed to pass a short-term spending bill, is likely to trickle down gradually as agencies work to mitigate the effects.\n\nAbout half of the Department of Health and Human Services will be placed on furlough. Beneficiaries of programs like Medicare, Social Security and Medicaid will still receive services. The Food and Drug Administration, however, will take a hit, as it will have to halt activities like food safety inspections. The Centers for Disease Control and Prevention will continue “immediate response work” on influenza, according to White House budget chief Mick Mulvaney John (Mick) Michael MulvaneyOvernight Finance: Lawmakers see shutdown odds rising | Trump calls for looser rules for bank loans | Consumer bureau moves to revise payday lending rule | Trump warns China on trade deficit Overnight Regulation: Dems claim 50 votes in Senate to block net neutrality repeal | Consumer bureau takes first step to revising payday lending rule | Trump wants to loosen rules on bank loans | Pentagon, FDA to speed up military drug approvals Consumer bureau takes first step to revising payday lending rule MORE.\n\nThe National Park Service (NPS) will keep parks open, unlike in 2013, though much of its staff will not report to work. Services such as trash pickup and restroom cleaning will be halted, according to the NPS contingency plan for a shutdown.\n\nCybersecurity will remain a priority during the shutdown, as the government will continue to protect information technology systems, Mulvaney said Saturday at a press conference.\n\nThe Environmental Protection Agency will largely stay open during the government's closure, and the Labor Department will resume mine safety inspections.\n\nMilitary personnel will be required to show up for work, but will not receive pay for as long as the shutdown lasts. Families of slain military members will experience a halt to death benefits as a result of the shutdown.\n\nTransportation Security Administration (TSA) personnel will continue operations, meaning travelers will see both TSA employees and canines operating in airports. The Federal Aviation Administration’s (FAA) management of air traffic control will also continue. Flight delays are not expected and much of the FAA's safety inspections will continue.\n\nThe government closure, a result of Congress’s failed negotiations over a spending bill the last several weeks, has sparked both intraparty battles and fights between Democrats and Republicans.\n\nThe two parties have each tried to cast blame on the other for the shutdown, with the Republican National Committee invoking the hashtag #SchumerShutdown, referring to Senate Minority Leader Charles Schumer Charles (Chuck) Ellis SchumerDemocrats will need to explain if they shut government down over illegal immigration White House: Trump remarks didn't derail shutdown talks Schumer defends Durbin after GOP senator questions account of Trump meeting MORE (D-N.Y.). Democrats say President Trump Donald John TrumpDems flip Wisconsin state Senate seat Sessions: 'We should be like Canada' in how we take in immigrants GOP rep: 'Sheet metal and garbage' everywhere in Haiti MORE is to blame for the closure, which follows failed talks over immigration and health-care funding.\n\nWhat happens next depends on whether lawmakers reach a deal, as members of both the House and Senate have remained in Washington, D.C., to work toward an agreement to open the government.\n\nLeaders in opposing parties on Saturday appear to be at odds over a short-term resolution to fund the government. Both chambers returned to Capitol Hill on Saturday afternoon to work toward a solution.",
    "title":"Who is affected by the government shutdown?",
    "description":"Thousands of government workers are unsure whether or not they will be heading to work on Monday amid uncertainty about how long a government shutdown will last."
  },
  "64":{
    "id":"politifact15178",
    "text":"“The immediate former presidents have been more active in their criticism of the current president,” George C. Edwards, a presidential historian at Texas A&M, said. “This kind of thing has been going on throughout history, but normally it’s not very much. This is very early in a tenure and to have former presidents being critical of the president… is pretty unusual.”\n\nAs Obama returns to the public spotlight, his former aides have made it clear he has no intention of talking much about Trump. However, he’s made his displeasure clear.\n\nObama, who campaigned heavily for Hillary Clinton, said he was “heartened” by the protests following Trump’s immigration ban targeting Muslim-majority countries. He also released a lengthy statement defending the Affordable Care Act against Trump’s attempts to repeal it.\n\nAt a speech in Boston on Sunday night, Obama avoided mentioning Trump by name, but again forcefully defended his signature health care legislation and mentioned immigration reform. “I expect to be busy, if not with a second career, at least a second act,” Obama said Sunday.\n\nAnd on Monday, Obama’s aides aggressively pushed back against Trump for trying to blame his predecessor for the woes associated with Trump’s disgraced former national security adviser Michael Flynn. While Trump and White House press secretary Sean Spicer have repeatedly denounced Obama for not revoking Flynn’s security clearance, Obama aides told reporters that Obama tried to warn Trump about Flynn’s erratic nature.\n\nGeorge W. Bush, meanwhile, has lobbed thinly veiled critiques of Trump on his approach to the press and the travel ban from some Muslim-majority countries. “I consider the media to be indispensable to democracy,” Bush said in an interview with “Today” in February. “We need an independent media to hold people like me to account.”\n\nAs for the travel ban, Bush was restrained but clear in his concern. “I am for an immigration policy that’s welcoming and upholds the law,” Bush said.\n\nCarter also voiced concerns after Trump’s inauguration. During an early April appearance at Emory University, he said he wanted to avoid addressing politics but he hoped the women’s movement would be “invigorated” by Trump and that he didn’t see “any glimmer of hope” from the administration on race and gender issues.\n\nBill Clinton, who was harshly critical of Trump during the Manhattan businessman’s presidential campaign, didn’t mince words about Trump when he ran into a local newspaper editor while holiday shopping. “He doesn’t know much,” Clinton said in late December. “One thing he does know is how to get angry white men to vote for him.”\n\nGeorge H.W. Bush, who has been in and out of the hospital, remains the only living president to avoid any political commentary.\n\nCriticism of the current president by former presidents is not completely unprecedented, however. For example, Herbert Hoover criticized Franklin D. Roosevelt, his successor.\n\n“We’ve seen some criticism already of the incumbent president, but that’s not really unprecedented,” Tim Naftali, a presidential historian at New York University, said. “If it continues at a drumbeat from former presidents, then it will be something new.”\n\nCurrent and former aides to the living former presidents say their former bosses are careful in criticizing the current occupant of the West Wing. Stuart Eizenstat, Carter’s chief domestic policy adviser and a former ambassador, said it usually takes an extraordinary occurrence for a former president to criticize a sitting president.\n\n“There’s a recognition that there is something so unique and special about the presidency, that, notwithstanding what might be very deep and serious policy differences and personal understandings, you simply bite your tongue,” he said. “You don’t try to undercut the president because you know what impact that would have had when you were president.”\n\nWhile in office, former presidents occasionally turn to their predecessors for guidance. Former aides say particularly on foreign policy issues, previous presidents and statesmen can be a valuable resource.\n\n“Most of the time President Clinton reached out to former heads of state, or people like Henry Kissinger or James Baker, they were usually foreign policy issues, where you had a perspective there that was pretty unique on dealing with a similar situation,” Mack McLarty, Clinton’s former chief of staff, said.\n\nFor example, Carter worked with former President Gerald Ford on the treaties which turned control of the Panama Canal over to Panama. Eizenstat said Carter instructed negotiator Sol Linowitz to call Ford immediately after the deal was ratified.\n\nOthers primarily use their predecessors for humanitarian trips. Harry Truman famously sent Hoover to address the post-World War II famine, and George W. Bush had his father and Clinton help with relief efforts for the tsunami in Southeast Asia and Hurricane Katrina. Most recently, Obama sent the younger Bush and Clinton to Haiti to help after the 2010 earthquake.\n\n“What would be really unusual is if no former president undertook any missions on behalf of the incumbent president,” Naftali said. “If we see that none of the former presidents want anything to do with the Trump administration, that would be a first in the modern history of the American presidency.”\n\nAll in all, most presidents have made an effort to remain engaged socially with their predecessors. Clinton and H.W. Bush are particularly close despite their hard-fought 1992 election, with Clinton tweeting pictures of the two in April.\n\nBut Trump is no normal president. Trump, who rose politically for questioning the legitimacy of his predecessor, at first appeared to have forged a working relationship with Obama, receiving advice both in person and over the phone. Obama even said he was “encouraged” by their first post-election meeting.\n\nTrump has since leveled unfounded wiretapping accusations against Obama, and the president abruptly ended a recent interview with CBS’ John Dickerson after Dickerson pressed him on his comments about Obama.\n\n“He was very nice to me, but after that, we’ve had some difficulties,” Trump said before referencing his debunked wiretapping allegation and saying that the alleged wiretapping was “inappropriate.”\n\nFormer President Barack Obama speaks at a community event on the Presidential Center at the South Shore Cultural Center, Wednesday, May 3, 2017, in Chicago. The Obama Foundation unveiled plans for the former president's lakefront presidential center, showcasing renderings and a model at an event where former President Barack Obama and first lady Michelle Obama were expected to give more details. (AP Photo\/Nam Y. Huh)\n\nHistorically speaking, Trump’s relationship with the living former presidents is more fraught than any of his predecessors’ had been, Laura Belmonte, a presidential historian at Oklahoma State University, said. “That one I think may be a category where Trump is on his own,” she said\n\nAnd Trump hasn’t shied away from criticizing those who came before him. As president, Trump called Obama a “bad (or sick) guy!” as part of his debunked wire-tapping claim. He called George W. Bush “not nice” during the campaign, said the Bush administration “lied” about the Iraq War and called Bill Clinton “the WORST abuser of women in U.S. political history.”\n\nGeorge H.W. Bush and Carter weren’t excluded from Trump’s slights. “Enough is Enough- No More Bushses!” Trump tweeted during the campaign. He alsocriticized Carter as unpresidential for carrying his own luggage.\n\nSteven Hochman, an aide to Carter at the Carter Center who helped the 92-year-old former president write his memoirs, said Carter hopes he and his center will be able to work with the Trump administration.\n\nAnd Carter hasn’t always seized opportunities to knock Trump. The former president appeared with Sen. Bernie Sanders (I-Vt.) Monday to discuss human rights, and — while revealing that he voted for Sanders — Carter said the “downturn” of human rights “preceded 2016.”\n\n“President Carter, I think he hopes that he won’t need to speak out but I would assume that if there were something he needed to say, he would say it,” Hochman said. “Actually, I’m sure he would.”\n\nBoth Bushes are more focused on their nonprofit work than engaging in politics, said Samuel Skinner, who served as the senior Bush’s chief of staff. He’s spoken to both since the inauguration, and neither has mentioned Trump.\n\n“They may have personal opinions, but they’re not going to express them,” Skinner said. “Both 41 and 43 are very measured people, so I think they’ve been both very cautious about what they say.”\n\nMcLarty, Clinton’s former chief of staff, predicted his former boss will continue to weigh in on the politics of the day. “I wouldn’t be surprised at all if he expresses serious differences of opinion on economic, domestic and international policies,” he said.\n\nGetting seriously involved in politics is a no-win scenario for former presidents, Skinner said, adding that the legacies of the former presidents are being shaped by historians, not today’s events in Washington.\n\n“I think any time and energy they have could be better spent working in nonprofits and their libraries,” he said.",
    "title":"Former presidents walk fine line in Trump’s America",
    "description":"Trump's predecessors are trying to both defend their legacies and respect the unwritten rule of not undermining the current commander in chief."
  },
  "65":{
    "id":"politifact13853",
    "text":"De Soto, Missouri – Parents of a three-month old baby were horrified to discover their babysitter had turned into a crystal meth-smoking cannibal when they found the remains of their child cooked in the microwave.\n\nAccording to police report, the young parents, were out at the movies before they came back home to find a confused babysitter under the influence of alcohol and crystal meth who had lost consciousness and was covered in blood in the family’s living room.\n\nMoments later, the parents made the gruesome discovery when the young mother saw something moving in microwave.\n\nThe 16-year-old babysitter named ‘Anna Ritchie’, claims she had brought some crystal meth and only took a few hits before she became hungry and eventually lost consciousness.\n\n“I just took a few hits because I was bored and wanted to stay awake,” she told Officer Robert. “All I remember is that I started getting really hungry, ate some chicken wings and passed out” recalls the police officer, visibly traumatized by the latest events.\n\nThe 3-month-old child was found in the microwave, covered in barbecue sauce, and was rushed to Springfield’s Mercy Hospital where doctors do not fear for his life.\n\n“Apparently, the baby sitter tried to cook the baby in the microwave oven but she was unable to do so, and was probably disoriented and lost consciousness moments later,” explained Sheriff Deputy Anderson James of the Jefferson County Police Department. “Teeth marks were found on the baby’s arms and legs but luckily he is unharmed” he acknowledged, visibly distraught by the whole affair.\n\nThe state of Missouri has led, for more than a decade, the nation in methamphetamine busts. A recent 2015 state-wide study revealed that more than 60% of adults aged 21 and higher have tried crystal meth at least once and close to 40% of respondents believed crystal meth should be decriminalized as a schedule 2 drug for medical use in treatment.",
    "title":"Babysitter on Crystal Meth Eats 3-Month-Old Baby",
    "description":"De Soto, Missouri - Parents of a three-month old baby were horrified to discover their babysitter had turned into a crystal meth-smoking cannibal when | Babysitter on Crystal Meth Eats 3-Month-Old Baby"
  },
  "66":{
    "id":"politifact13929",
    "text":"Liberal menace and purveyor of lies, Nancy Pelosi (D-California), was just taken from her office in handcuffs by the United States Secret Service. While little information is available as of yet, one agent did tell a reporter for the Washington Examiner that the arrest came at the direct order of the president:\n\n“Mrs. Pelosi’s arrest order comes directly from the Oval Office,” said Special Agent Matthew Derpmore, “She’s wanted for questioning in a possible coup attempt against the president. That’s all we’re authorized to say at this time.”\n\nThe White House OIP has confirmed that report, calling Pelosi a usurper and a threat to the office of President Trump:\n\nCongresswoman Nancy Pelosi’s arrest for conspiacy to overthrow the office of the President is being taken very seriously. She is said to be at the head of a select group of congressmen who have set in motion plans to use the president’s allegedly unlawful actions to begin imeachment hearings. Without evidence and with a clear denial from the president of these allegations such actions warrant charges of conspiracy and possibly even treason.\n\nPelosi’s office hasn’t issued a statement yet. According to records obtained by Breitbart, three other congressmen are also wanted and are currently having warrants against them served. We’ll keep you updated as the story progresses.",
    "title":"BREAKING: Nancy Pelosi Was Just Taken From Her Office In Handcuffs",
    "description":"Nancy has some explaining to do."
  },
  "67":{
    "id":"politifact14161",
    "text":"President Trump made Barack Obama look like a complete fool this morning in front of more than 10,000 police veterans when he announced that he would reinstate a national day of remembrance for fallen officers that the traitor before him had done away with.\n\nTrump told the crowd the following: “Police officers in this country will no longer be treated like criminals. Obama decided your fallen didn’t deserve to be honored. That changes today. Americans will remember those that keep our streets safe big time.”\n\nObama’s spokesman said the day of remembrance was scrapped so the Black Lives Matter movement wouldn’t be offended. Apparently it’s more important for the friends and families of criminals killed for not obeying simple commands to be coddled than it is for the families and friends of the brave men and women who run into harm’s way to save the innocent to be honored.\n\nPresident Trump has righted that wrong once and for all. If the Black Lives Matter movement wants to remember their dead they can go ahead and burn down their neighborhoods. The families of fallen police will join together in laughter, grief and prayer remembering those they lost.\n\nFOLLOW us on Facebook at PortalState!\n\nSource: Ok.infoman\n\nComments",
    "title":"OBAMA CANCELED IT, TRUMP REINSTATED IT – A VERY SACRED DAY IS BACK",
    "description":"President Trump made Barack Obama look like a complete fool this morning in front of more than 10,000 police veterans when he announced that he would reinstate a national day of remembrance for fal…"
  },
  "68":{
    "id":"politifact14116",
    "text":"Chris Chase, USA TODAY Sports\n\nLance Armstrong let his Twitter followers -- still 3.8 million strong -- know he was back in Austin this weekend and had someone take a picture to show how he was spending a lazy Saturday afternoon.\n\n\"Back in Austin and just layin' around,\" he wrote in the tweet. He attached a picture of himself laying on a couch in a room that just happened to have seven yellow Tour de France jerseys on the wall. Purely random, I'm sure.\n\nIt's not a #humblebrag as much as it's a #shoveitinyourfacebrag. It's cocky, it's condescending and it's not going to help Armstrong's battered public image. Contrition, not defiance, is the way to go.\n\nArmstrong was banned for life last month by the International Cycling Union and stripped of those seven Tour wins. (The jerseys, apparently, can stay.)\n\nLook, I'm on Lance Armstrong's side, as much as one can be on the side of a suspected\/known cheater. His cycling wins may have been a sham (just like victories by most athletes in the sport) but his work for cancer research, awareness and patients has been inspirational. Would it have been better if Armstrong stayed clean, became a middling cyclist and Livestrong never existed? I don't see how any logical person could make that argument. Shades of gray cloud the picture, of course, but I still think his net contribution to our world is greater than his flaws.\n\nRegardless, Armstrong stepped down Monday from the Livestrong board. He founded the charity in 1997.\n\nIf pictures like this are any indication, Armstrong has moved past denial into the anger phase of his coping. Next he'll be trying to buy Tour titles off Miguel Indurain, followed by his growing a beard phase and then he'll accept his actions, sit down for an interview with Oprah and get back into the good graces of the American public. It doesn't feel like it now, but it'll happen one day.",
    "title":"Lance Armstrong's defiant Twitter photo shows him relaxing with seven yellow jerseys",
    "description":"The disgraced cyclist still wants you to know he won all those Tour de France titles"
  },
  "69":{
    "id":"politifact15604",
    "text":"A sportsbook is a place where people can make wagers on various sporting events. Most of these sites are legal, although there are some that aren’t. If you’re looking for a safe place to place your bets, look for a sportsbook with an easy-to-navigate website and fast payout speeds. Some sportsbooks also offer a variety of bonuses to attract customers. These include first-bet insurance, reload bonuses and parlay boosts.\n\nSome of these bonuses are offered during the NFL season, while others are available throughout the year. Typically, the sportsbook will provide a bonus in the form of site credit, which you need to roll over at least once before you can keep your winnings. In some cases, the sportsbook will also refund your stake if you lose.\n\nRegardless of the sportsbook you choose, it’s important to understand how odds are calculated. Most online sportsbooks display the odds of a particular event, and you can use these to determine your chances of winning. In addition, most of these websites have calculators that can help you estimate your potential winnings. These tools can save you a lot of time and hassle.\n\nThe most common way to bet on sports is at a physical bookmaker. These businesses are often licensed by state regulators and are regulated to ensure they operate ethically. However, they do have some disadvantages, such as high fees and limited market scope. Fortunately, there are many online sportsbooks that accept credit cards and other forms of payment. These options make it much easier to bet from the comfort of your home.\n\nWhen choosing a sportsbook, it’s essential to find one that has a wide selection of betting markets. In addition to determining what sports you can bet on, it’s also important to examine the betting limits and rules of each website. Some sportsbooks limit certain types of bets, while others have restrictions on the number of teams or players you can bet on.\n\nIn addition to offering a wide range of betting markets, an online sportsbook should have a high level of customer service. This means that it should be available round the clock, and have a secure deposit and withdrawal system. In addition, it should provide a variety of payment methods to meet the needs of different players.\n\nBecoming a sportsbook agent is an excellent choice for people who enjoy gambling and want to turn it into a full-time career. The sportsbook industry grew significantly in 2022, reeling in more than $52.7 billion in wagers. This increase in popularity has made it a more profitable and competitive business than ever before.\n\nA sportsbook that offers a deposit match promotion is a great way to get started with online betting. These offers give new bettors a chance to win real money by making their first bet. Some sites may offer this in cash, while others will give you site credit that can be used on future bets. Some even have first-touchdown insurance, which gives bettors a refund on their first wager if it loses.",
    "title":"Just another WordPress site",
    "description":"Just another WordPress site"
  },
  "70":{
    "id":"politifact14992",
    "text":"Do you really believe that as the countries of the Middle East empty out, and their degenerates are vomited out upon the Western World, ...",
    "title":"Rep. Paul Gosar Asks Capitol Police to Arrest Illegal Immigrants Attending State of the Union",
    "description":"An Arizona Republican is urging the arrest and deportation of any \"illegal aliens\" who attend the State of the Union Tuesday night, as ..."
  },
  "71":{
    "id":"politifact13745",
    "text":"The resistance against Trump must continue…these aren’t just small ideological differences being played out, or debates where both sides should be calmly and distantly considered. To the contrary, the very foundation and basis of the country we call our own is at stake! That is why this viral guide to getting involved with the opposition is so important…if you haven’t read it yet, you should absolutely do so now!\n\nAnd things continue to look dire, and it goes even beyond Trump: GOP Rep Rob McCaskill (R-Texas) Twitter feed, much like the Orange one in the Oval Office, is a huge basket full of crazy. He tweets with glee about global warming “hoaxes.” He tweets that Americans should boycott Nordstrom for removing Ivanka’s merchandise (they were, that’s why they pulled the line).\n\nThe worst tweet from McCaskill, though, was one from Friday, where he very literally wished for another 9\/11 just to prove judges wrong. That’s right, he tweeted “Can’t wait for the next 9\/11 so the 9th District circuit ruling judges will wish they didn’t roll over for enemies wishing death on America #MuslimBan.”\n\nUm, seem scary to you? With tweets saying the judges would be responsible for a terrorist attack, the administration is laying the groundwork for a deeper police state or for something we’ve never had in this country, martial law. Trump is a dictator. While McCaskill may not be smart enough to be in on the plan, he’s certainly complicit and he’s demonstrating what nearly all Republicans are guilty of. He doesn’t care about the American people. He only cares about his party.\n\nThis is terrifying, and there’s never been a more important time to stand up to fight and defend your country. If you are ready to join the opposition but aren’t quite sure how to get involved, take this grassroots call to action today!",
    "title":"GOP Official Who Says America Needs “Another 9\/11” Shares _______________ With Trump",
    "description":"The resistance against Trump must continue…these aren’t just small ideological differences being played out, or debates where both sides should be calmly and distantly considered. To the contrary, the very foundation and basis of the country we call our own is at stake! That is why this viral guide to getting involved with the opposition is …"
  },
  "72":{
    "id":"politifact14421",
    "text":"About US\n\nAbout us:\n\nRear Front is a fast growing company specialized in creating and spreading viral content on the internet. We are a power house of generating awesomeness through our incredible content which inspires over 600 million souls every single day.\n\nOur objective is to create artistic impressions about love, life and unique personalities. We are taking the world by awe and delight everyday with the unique content created by our signature contributors. Together we bring about the incredible stories which inspire you to think, smile and feel with all your heart.\n\nRearfront is part of beloved ViralAgain.com",
    "title":"About US",
    "description":"About us: Rear Front is a fast growing company specialized in creating and spreading viral content on the internet.  We are a power house of generating awesomeness through our incredible content which inspires over 600 million souls every single day. Our objective is to create artistic impressions about love, life and unique personalities. We are […]"
  },
  "73":{
    "id":"politifact14998",
    "text":"165 SHARES Share Tweet\n\nSinger Dolly Parton: “Trump In One Year Is Already Better Than 16 Years’ of Bush, Obama ‘Put Together’, This Stupid Liberals Doing Everything To Impeach Him But We Standing With Trump now And Forever. Do You Support Her?\n\nDolly Parton has long been one of America’s most legendary singing and songwriting talents. Until recently, she was fairly liberal, and a big supporter of Hillary Clinton.\n\nIn a statement not long ago, Parton said she was inspired that a woman might be President for the first time in our nation’s history.\n\n“We’re doing good,” she commented at the time. “We got a woman that could go in the White House, so we’ve certainly come a long way in that respect.”Recently, Parton saw the light and realized that Hillary would be quite possible the worst person to be the champion for woman throughout the nation. She now understands that Hillary is a liar; she’s as corrupt as they come.\n\nRecently, Parton saw the light and realized that Hillary would be quite possible the worst person to be the champion for woman throughout the nation. She now understands that Hillary is a liar; she’s as corrupt as they come.\n\nIn a more recent interview, she called Hillary “nuts” and that her campaign has been “just crazy.”\n\nThe American News article used portions of a real interview Parton gave to CNN on 26 August 2016, presenting quotes from that interview inaccurately and out\n\nVIDEO:\n\nRelated Posts\n\nVIDEO: DEPUTY FIGHTS ALONE AGAINST TWO SUSPECTS, THEN HERO CITIZEN JUMPS IN AND OPENS CAN OF WHOOP-A\n\nJanuary 22, 2018\n\nGay US Olympian Spits On VP Mike Pence Because Of A False Fact\n\nJanuary 22, 2018\n\nSean Penn Runs His Foul Mouth At Trump For “Sh*thole” Comment\n\nJanuary 22, 2018",
    "title":"Singer Dolly Parton: “Trump In One Year Is Already Better Than 16 Years’ of Bush, Obama ‘Put Together’, This Stupid Liberals Doing Everything To Impeach Him But We Standing With Trump now And Forever.",
    "description":"Singer Dolly Parton: “Trump In One Year Is Already Better Than 16 Years’ of Bush, Obama ‘Put Together’, This Stupid Liberals Doing Everything To Impeach Him But We Standing With Trump now And Forever. Do"
  },
  "74":{
    "id":"politifact13982",
    "text":"Recently, Republican Ohio Gov. John Kasich vetoed the so-called “heartbeat bill,” a measure that would have banned all abortions after about six weeks of pregnancy, or before many women even know that they are pregnant. At the same time, Kasich signed a bill banning abortion after 20 weeks of pregnancy, with exceptions only for saving a pregnant woman’s life or preventing the “substantial and irreversible impairment of a major bodily function.”\n\n“At the risk of sounding discriminatory, which is not at all my goal here, but at the risk of sounding like that, there is no way women should be allowed control over whether or not they are going to have abortions,” Kasich told the Ohio Daily Star. “Women are wonderful beings, they are kind, loving, incredible and a whole other plethora of adjectives could be used to describe them, but at the end of the day, I’m sorry to have to say this, but the honest truth is that women used to be all those things. The women of today are mainly opportunists and gold diggers, who typically get pregnant due to unsafe sex, or to get their partners to marry them.”\n\nHe continued, “Our mothers and women of the old times were the women every man deserved and was blessed to have. Today, the situation is so critical that I honestly fear for the future of this country. And so, I was in a position to make a change and do something important, and so I did. And there’s one very simple reason why I did it. That’s that, if a woman these days is not intelligent enough to keep her legs closed when they’re supposed to be closed, if she doesn’t have the foresight to make sure she doesn’t get herself in a situation where she might be pregnant, then there is no way a woman like that can or should be entrusted with the decision of having an abortion.”\n\n“A woman like that can barely take care of herself, and we’re supposed to tell our doctors to perform an abortion on such a woman and kill her unborn child – a being who’s done no wrong and only exists as its mother’s mistake? Do you really want to put the men and women in our healthcare in that kind of situations? To literally force them to commit manslaughter?” Kasich said. “I don’t know about the rest of the people living in my state, but I for one am not comfortable with that one bit. And so I reacted and did what was necessary to prevent that from happening.”\n\n“And I’ll tell you another thing – as of recently, all cases of out-of-wedlock pregnancies in the state of Ohio will have to be approved by the state. That means that every single couple that becomes pregnant and isn’t married or at the very least engaged, will be scrutinized to determine whether the pregnancy was planned or accidental. And in the case of the latter, the couple will be fined a total of $100,000, with $70,000 of the fine being charged on the mother-to-be for not being able to not only use birth control, but having sex before marriage in the first place. Women in this country really need to learn to either keep their legs closed or their other orifices open,” the governor concluded.",
    "title":"Kasich: “If A Woman Is Not Intelligent Enough To Keep Her Legs Closed, How Can We Entrust The Abortion Decision To Her?”",
    "description":"Recently, Republican Ohio Gov. John Kasich vetoed the so-called “heartbeat bill,” a measure that would have banned all abortions after about six weeks of pregnancy, or before many women even know that they are pregnant. At the same time..."
  },
  "75":{
    "id":"politifact13816",
    "text":"The Bodybuilding community has long coveted the best performance-enhancing drug to boost muscle growth and improve energy levels. For starters, you have dbols, one of the most popular steroids today. It has also been said that this steroid can be found in muscle cells in as little as 6 hours after injection. Bodybuilders use this drug because it has an anabolic effect on muscle proteins. It speeds up protein synthesis and cures some minor health issues.\n\nThis muscle catalyst is also known to promote the growth of new muscle tissue. However, its effects can last up to two weeks, making it a popular choice among bodybuilders. This steroid has also been shown to improve nitrogen balance and enhance recovery from training. It also provides an increase in lean body mass as well as bone density. Here is the list of the best performance-enhancing drugs for bodybuilding:\n\nAnabolic Drugs Or Steroids\n\nAnabolic drugs or steroids are involved in building and maintaining muscles. The steroid substances that promote muscle tissue growth are, in fact, precursors to basic hormones. The pituitary gland produces anabolic hormones. It is controlled by a hormone gland located at the base of the brain.\n\nThese hormones control several functions such as; metabolism and protein synthesis. When you take this steroid, it will help you to gain muscle, strength, and stamina. This dbols supplement also plays an important role in building muscle and bones through stimulating protein.\n\nBeta-2 Agonists\n\nThese synthetic drugs help expand the lungs’ capacity, which means more oxygen is forced into your bloodstream. This, in turn, will increase metabolism rates and build lean muscles. These drugs are used during training sessions and events where a bodybuilder will be working out. The Beta-2 Agonists allow the body to burn more carbohydrates, and at the same time, they help you to use fat as energy. It also provides great energy that helps to reduce fatigue, stress, and anxiety.\n\nHuman Growth Hormone\n\nAlso referred to as HGH, this drug has increased lean muscles. Human Growth Hormone is a hormone produced in the pituitary gland responsible for growth during childhood. It remains active the whole life and can be stimulated by taking HGH. In addition, testosterone and other human growth hormone are factors that lead to building muscle. Athletes who take this drug have an increase in insulin which is also an indirect anabolic effect of HGH.\n\nEphedrine\n\nBodybuilders have used ephedrine for a long time. It has been around there for so long because of its ability to burn fat, boost metabolism, and enhance physical performance. Ephedrine is a popular drug for bodybuilders because it can be helpful while training and events to burn fat and increase muscles.\n\nMethenolone\n\nMethenolone is another popular steroid that is considered to be milder than most. Athletes use it for its potency in enhancing recovery time and prevention of injury. This steroid has also been used to increase muscle size and strength. It has the specialty of recovering the injury, whether external or internal. That is why athletes and sports people mostly consume it.",
    "title":"Historical blog about Seattle, as well as the state of affairs today. Many facts that interest you as well as an open news portal and discussion forum. Support your native Seattle.",
    "description":"Tribune"
  },
  "76":{
    "id":"politifact14722",
    "text":"The gunman who opened fire inside a church in Sutherland Springs, Texas, has been identified as Devin Kelley, an Antifa member who vowed to start a civil war by “targeting white conservative churches” and causing anarchy in the United States.\n\nWilson County Commissioner Albert Gamez Jr said that at least 27 people have been killed in the shooting, according to reports by the CNN and the BBC, with the confirmed death toll expected to climb in the coming hours.\n\nWitnesses report they saw Devin Kelley walk into the Baptist Church in the small town 30 miles from San Antonio at 11:30am local time Sunday, according to KSAT-12.\n\nDevin Kelley, who killed at least 27 people and injured many more, was one of two shooters in the church, according to eyewitnesses, who also report Kelley carried an Antifa flag and told the churchgoers “this is a communist revolution” before unloading on the congregation, reloading several times.\n\nSheriff Joe Tackitt confirmed to Wilson County News that there have been “multiple fatalities” and the shooter has been “taken down.”\n\nDevin Kelley’s Facebook page stated that he was an atheist and his interests included “Civil and social rights” and “Civil rights” as well as endorsements for local Texan Democratic political candidates. His page also featured photos of several high powered weapons.\n\nHis Facebook page was taken down without explanation less than an hour after the shooting.\n\nAn eyewitness told CBS News that there was a heavy police presence on the road to the church, adding that they had seen severely injured people being airlifted from the area.\n\nTexas Governor Greg Abbott posted to Twitter shortly after the mass shooting, saying: “Our prayers are with all who were harmed by this evil act. Our thanks to law enforcement for their response. More details from DPS soon.”\n\nPresident Donald Trump has confirmed he is aware of the situation and said he was monitoring it from Japan.\n\nSource: YourNewsWire",
    "title":"Texas Church Shooter Was Antifa Member Who Vowed To Start Civil War",
    "description":"The gunman who opened fire inside a church in Sutherland Springs, Texas, has been identified as Devin Kelley, an Antifa member who vowed to start a civil war by “targeting white conservative"
  },
  "77":{
    "id":"politifact15477",
    "text":"California Governor Jerry Brown just signed a draconian new law that makes it illegal to take a shower, and do laundry on the same day:\n\nAssembly Bill 1668 establishes a limit of 55 gallons per person daily as the standard for indoor residential water use, starting in the year 2022. Violators will have to pay a fine of $1,000 per day during normal seasons and $10,000 per day if “the violation occurs in a critically dry year immediately preceded by two or more consecutive below normal, dry, or critically dry years,” the law states.\n\nAccording to the attentive folks at The Organic Prepper, this allotted water ration exceeds the amount required for taking a shower and doing a single load of laundry and excludes taking baths altogether.\n\nWriter Daisy Luther notes that an ordinary load of laundry uses about 40 gallons of water, while an eight-minute shower uses some 17 gallons of water. A bathtub holds 80 to 100 gallons of water. This means combining a shower and laundry on the same day would use 57 gallons of water, two gallons above the limit.\n\nAccording to the new law, the 55-gallon per person limit will be reduced even further in future years, dropping to 52.5 gallons per capita in 2025 and just 50 gallons per person in 2030.\n\nTo ensure compliance, the government of California urges the use of creative surveillance systems to spy on all residents. Utility providers will be obligated to report on violators, and urban retail water suppliers “shall use satellite imagery, site visits, or other best available technology to develop an accurate estimate of landscaped areas.”\n\nSo as not to overburden the wealthy, there will be “provisions for swimming pools, spas, and other water features,” the law states. …\n\nThe new, more aggressive mandatory water use levels set by the State Water Resources Control Board in coordination with the Department of Water Resources establish the initial indoor water allowance of 55 gallons per person per day and will also set an outdoor residential amount as well as a standard for system wide pipe leak losses.\n\nThis new law is ridiculous and will turn most honest, law abiding residents of California into lawbreakers.\n\nEven worse, the drought has technically ended in California, so these restrictions make no sense based on current conditions.\n\nIf the politicians who run the state really wanted to solve the problem they would have limited the amount of grass homeowners can plant, and ban swimming pools.\n\nInstead they come up with stupid rules, designed to harm those who can least afford it.\n\nFacebook has greatly reduced the distribution of our stories in our readers' newsfeeds and is instead promoting mainstream media sources. When you share to your friends, however, you greatly help distribute our content. Please take a moment and consider sharing this article with your friends and family. Thank you.",
    "title":"New Law Makes it Illegal to Shower and Do Laundry on Same Day",
    "description":"Wait, what?"
  },
  "78":{
    "id":"politifact14286",
    "text":"WASHINGTON, D.C. (AP) — At a press conference early this morning, House Speaker Paul Ryan announced news of a presidential resignation happening within the next 30 days.\n\n“Donald Trump plans to step down as President of the United States and resign from office within the next 30 days,” Ryan told reporters. “Amid the fury of scandals with Russia, the growing criticism from world leaders, the numerous problems his administration and cabinet have had, his lack of care for the environment; Republicans and myself believe this is the best thing to happen, and with some persuasion, Trump has also agreed this was for the best.”\n\n\n\n\n\n\n\nNews of this comes as Russia’s hacking and involvement into altering the 2016 Election have become clearer. In addition to this, the F.B.I. announced yesterday that they have discovered Russian property holdings which they believe are owned by Trump, gifted to him by Russian President Vladimir Putin in exchange for weaker exportation restrictions.\n\n“If the Russian holdings do indeed belong to Trump, this would create a clear conflict of interest and be grounds for immediate impeachment,” Washington Analyst Tom Downey said. “Washington insiders say the Russian holdings are the main reason that Trump is stepping down, hoping to stay ahead of the problem before his name is further dragged through the mud.”\n\nDonald Trump took to Twitter , not yet announcing his resignation but hinting at it.\n\n“We did great things, the best things, but the FAKE NEWS hates great things! I know you’ll always remember me as the greatest President EVER!”\n\n“We think this is the best thing,” Ryan continued. “He has divided this country in more ways than we could have ever imagined. I think Trump meant well, but now it’s time for him to do the right thing and step down and that is exactly what he is doing. Vice President Pence will make an excellent President and I look forward to working with him in the near future.”\n\nAfter word spread of Trump’s impending resignation, Newt Gingerich, who just this week defended Trump for lying, told reporters he is no longer a supporter.\n\n\n\n\n\n\n\n“I think I was very clear with all of my actions that I never supported Trump and I plan not to do so in the future as well. I never liked the man, never trusted him. Everyone knows that. Now Mike Pence, he’s the President that we need, a real straight shooter, one of the good guys. I offer my full support and soul to whatever he needs as our new President.”\n\nLloyd Glacier, a spokesman for ‘Sock It Forward‘, a charity started by Donald Trump, that provides homeless men and women with brand new socks, said he agrees with Trump’s plan to resign.\n\n“This will give Trump more time to focus on his wife and children, and the other loves of his life, whoever those lucky ladies may be. And just a reminder, a big thank you to everyone that has donated to our cause. 100% of your donation goes directly to clothing the homeless with new socks. Socks, for your information, are the least donated but most needed and requested item at homeless shelters around the country.”\n\n38-year-old Paul Horner, a Christian mascot who goes by the name Fappy The Anti-Masturbation Dolphin, said he is sad to see Trump go.\n\n“When I’m traveling around the country speaking to Elementary School children about the dangers and consequences of masturbation, I see firsthand the progress that Donald Trump has made in this great Christian nation of ours,” Horner said. “Trump has been on the front lines of this deadly epidemic since day one, working to put an end to self-rape all over the country. He was only months away from signing legislation that would have made masturbation illegal and now it’s all gone. It looks like the heathenish masturbators have won and the Devil is extremely pleased. Just an FYI, you’re all going to burn in Hell for eternity, but Jesus loves you very much! Praise Fappy!”\n\nThe Trump Administration has setup a hotline for those wishing to voice any concerns or comments about Trump’s impending resignation. That hotline’s phone number is (785) 273-0329.",
    "title":"Paul Ryan: “Donald Trump Plans To Resign From Office Within The Next 30 Days”",
    "description":"WASHINGTON, D.C. (AP) — At a press conference early this morning, House Speaker Paul Ryan announced news of a presidential resignation happening within the next 30 days. “Donald Trump plans t…"
  },
  "79":{
    "id":"politifact15570",
    "text":"A senior Iranian cleric and member of parliament has just dropped a bombshell.\n\nHe is claiming that the Obama administration, as part of negotiating during the Iran Deal, granted U.S. citizenship to 2500 Iranians including family members of government officials.\n\nFrom Fox News:\n\nHojjat al-Islam Mojtaba Zolnour, who is chairman of Iran’s parliamentary nuclear committee and a member of its national security and foreign affairs committee, made the allegations during an interview with the country’s Etemad newspaper, cited by the country’s Fars News agency. He claimed it was done as a favor to senior Iranian officials linked to President Hassan Rouhani, and he alleged the move sparked a competition among Iranian officials over whose children would benefit from the scheme.\n\nSeveral children of current and former Iranian officials live in the United States, including Ali Fereydoun, whose father is brother and special aide of President Hassan Rouhan, and Fatemeh Ardeshir Larijani, whose father Ali Larijani is speaker of parliament.\n\nWhile Zolnour did not mention any names, he obviously was trying to make a political point.\n\n“When Obama, during the negotiations about the JCPOA, decided to do a favor to these men, he granted citizenship to 2,500 Iranians and some officials started a competition over whose children could be part of these 2,500 Iranians,” he claimed. “If today these Iranians get deported from America, it will become clear who is complicit and sells the national interest like he is selling candies to America.” The conservative Zolnour, who is in Ayatollah Ali Khamenei’s inner circle, added: “It should be stated exactly which children of which authorities live in the United States and have received citizenship or residency.”\n\nHe said while some were studying in the U.S. others were working in the U.S. “against our national interests.”\n\nIt’s not clear who he’s talking about and whether he’s confusing a green card with citizenship. And one has to take his political objective into account.\n\nBut it obviously raises a concerning question.\n\nThere have been so many things hidden from the public about the Iran Deal if this was one more thing given up in bribe, it wouldn’t be hard to believe.\n\nAnd it shouldn’t be hard to track this down with a little government and Congressional investigation.\n\nThe problem, of course, too many Obama holdovers in places like the State Department so you can’t get a straight answer.\n\nAsked about the cleric’s claim, a State Department spokesperson said: “We’re not going to comment on every statement by an Iranian official.” Fox News analyst and former Obama State Department spokeswoman Marie Harf was dubious of the Iranian official’s allegation. “This sounds like totally made up BS,” she said. The Department of Homeland Security declined to comment. A representative for Obama Homeland Security Secretary Jeh Johnson also could not be reached for comment.\n\nThis would certainly anger Republicans, especially in the wake of the pallets of cash, sanctions relief and giving access to the U.S. financial system that has already been revealed about the deal.\n\nAnd in Iran, they could fuel resentment toward Tehran’s elite. “Many ordinary Iranians are surprised and feel betrayed that children of the regime officials live and work in the U.S.,” Saeed Ghasseminejad, a research fellow at the Foundation for Defense of Democracies, a Washington-based research institute, told Fox News. “The regime officials chant death to America but send their children to the U.S., away from the hell they have created in Iran over the past four decades.” Ghasseminejad said some Iranians have called for their deportation from America: “Iranians don’t understand why the U.S. government allows the offspring of the regime officials to live in the U.S., while the U.S. has introduced a travel ban for ordinary Iranian citizens and many Americans are imprisoned in Iran. That is why many Iranians on social media have been urging the U.S. government to deport the children of the regime officials.”\n\nThe protests have hit the country hard as the economy has continued to crater. The Iran Deal was expected to help the country but the people in the street didn’t feel the difference. And now pulling out of the Iran Deal has facilitated a drop in the value of the rial against the dollar. And as a result of pulling out of the deal, international firms and oil companies have dropped deals with Iran.\n\nThere’s a lot of jockeying for power behind the scenes here.\n\nBut it could be interesting if it’s the failure of the Iran Deal that actually deals the final blow to the Islamists and it brings the secularists back.",
    "title":"Iranian Official Drops Bombshell: Obama Secretly Gave Citizenship to 2500 Iranians as Part of Nuke Deal",
    "description":"'It will become clear who is complicit...'"
  },
  "80":{
    "id":"politifact15137",
    "text":"Donald Trump took a major step toward securing the Republican presidential nomination following the mogul’s Super Tuesday victory, and faced with the prospect of a President Trump, Miley Cyrus turned to Instagram Tuesday to tell her 38.1 million followers, “Donald Trump is a fucking nightmare!”\n\nCyrus wrote the caption next to a publicity photo of Trump; Cyrus’ Instagram burn has gained 239,000 likes since it was posted Tuesday. On Wednesday, the Dead Petz singer continued lobbying against the GOP frontrunner with a photo of Trump’s delegate totals over Ted Cruz and Marco Rubio and a caption where Cyrus playfully threatened to move out of the country if Trump is elected and a hashtag #aintapartyindausaanymo.\n\nDonald Trump is a fucking nightmare! A photo posted by Miley Cyrus (@mileycyrus) on Feb 29, 2016 at 12:35pm PST\n\ngonna vom \/ move out da country. #aintapartyindausaanymo A photo posted by Miley Cyrus (@mileycyrus) on Mar 1, 2016 at 6:32pm PST\n\nCyrus’ Instagram then took aim at self-proclaimed “most hated woman in the world” Rebecca Francis, a woman who uses her social media to showcase her hunting prowess, and the hunter’s allegiance to Trump.\n\nCyrus isn’t the only artist to lament a possible future with Trump as commander in chief: Red Hot Chili Peppers’ Flea recently told Rolling Stone, “I can’t take Donald Trump or anything he says seriously. I just think that he’s a silly reality-show bozo and blustering guy who likes getting attention. I don’t think he wants to be president, and I don’t think he has a chance to be the president. He’s just some egotistical, silly person whose main concern in life is getting a blowjob. He wants to be on TV and he wants everyone to thinks he’s important.”",
    "title":"Miley Cyrus: ‘Donald Trump Is a F–king Nightmare’",
    "description":"“Honestly, fuck this shit,” singer writes. “I am moving if this is my president”"
  },
  "81":{
    "id":"politifact15268",
    "text":"Update:\n\nThe Syrian Arab Red Crescent statement was reported, and at the time we had no reason to believe it was not true. Subsequent questions have emerged, however, and the International Federation of Red Cross and Red Crescent is saying they are unaware of such a statement having ever been issued by the Syrian branch. They further say the Syrian Red Crescent was shut down in Douma effective April 7.\n\n—\n\nThe Syrian Red Crescent issued a statement Monday dismissing the allegations of a weekend chemical weapon attack in the city of Douma. The statement insisted their medical personnel in the city had found no evidence any such attack took place.\n\nThe Syrian Red Crescent said their hospital in Douma received six patients complaining of respiratory problems, but said they didn’t seem to have any physical problems at all, nor was there any trace of any chemical agents they might’ve been exposed to.\n\n(This has been retracted, it is incorrect.)\n\nChemical attack or no, it wouldn’t be surprising for some people to complain of symptoms without actually having any problems. That the Red Crescent operates a hospital in a city supposedly inundated with wounded and didn’t get a single patient with confirmed exposure, however, is very noteworthy.\n\nThe Russian Defense Ministry also reported that their own medics had examined some patients in Douma, and had the same result, that none showed signs of chemical poisoning. With White Helmets claiming scores killed and over 500 wounded by exposure, it seems impossible to believe that if it was true no one can find any of these “real” patients to confirm an attack.",
    "title":"THIS ARTICLE RETRACTED: Red Crescent Says No Evidence of Chemical Attack in Syria’s Douma",
    "description":"Red Crescent Says No Evidence of Chemical Attack in Syria's Douma | Patients treated by aid group not exposed to any chemical agents"
  },
  "82":{
    "id":"politifact13764",
    "text":"Sharing is caring! Facebook\n\nTwitter\n\nGoogle+\n\nPinterest\n\nAt approximately 9:18 a.m. on Wednesday, attorneys for Hillary Rodham Clinton filed an Action For Divorce with the Supreme Court of the State of New York for Westchester County, according to documents obtained by Christian Times Newspaper.\n\nCiting irreconcilable differences, the former Democratic nominee for President apparently is seeking a divorce from her longtime husband former President Bill Clinton.\n\nBill Clinton is named as the defendant in the legal filing, and Hillary’s signature appears beside her listing as the plaintiff. The plaintiff’s signature is often included in these types of filings to certify and expedite the legal process.\n\nAccording to the filing obtained by CTN, the couple has a previously agreed-upon separation agreement or stipulation that will govern the manner in which the marital property is to be distributed in the event the divorce is finalized. It is unclear at this time what that agreement specifically covers.\n\nCTN has censored the couple’s address and the contact information for Hillary’s attorney in the respect of their privacy.\n\nAt this time, the Clinton’s are not commenting on the breaking news of their imminent divorce. The Clinton’s got married on October 11, 1975, in Fayetteville, Arkansas in the living room of their new red brick home. 15 of their closest friends and family were present, and the reception took place in their backyard.\n\nThe couple’s marriage has been a mystery for years after it was discovered that Bill Clinton carried on multiple affairs while Governor of Arkansas, President of the United States, and even after his time in public office.\n\nIt has been alleged in the past that the couple has a purely professional relationship and that they haven’t slept in the same bed for years\n\nsource",
    "title":"BREAKING: Hilary Clinton Filed For Divorce In New York Courts!",
    "description":"At approximately 9:18 a.m. on Wednesday, attorneys for Hillary Rodham Clinton filed an Action For"
  },
  "83":{
    "id":"politifact15262",
    "text":"One of the most contentious issues in the State of Missouri’s case against Gov. Eric Greitens has been the whereabouts of an incriminating photo that he is alleged to have taken and disseminated.\n\nA deposition of the woman (K.S.) in question, the woman who accused Greitens of taking a nude photo of her, reveals one new shocking bit of evidence. The woman may have dreamed up the incident at the heart of the criminal case.\n\nThe defense team’s April 8 motion to compel immediate production of all exculpatory evidence reports the following exchange.\n\nWhen the defense counsel asked K.S., “Did you ever see [Greitens] in possession of a camera or phone?” she answered: “Not to my knowledge. I didn’t see him with it.”\n\nThe question was then asked, “And as you sit here now, you cannot state under oath that you ever saw him in possession of a camera – with a camera or a phone?”\n\nK.S. replied, “Correct.”\n\nThe counsel then asked, “And you can’t say you saw it on his person, you can’t say you saw him put it down in the kitchen, take it from the kitchen, or put it down anywhere in the basement. Those are all correct statements, are they not?”\n\nK.S. answered, “Yes. I cannot say.”\n\nTrying to salvage the state’s case, the Assistant Circuit Attorney later asked K.S., “Did you see what you believed to be a phone?”\n\nHere comes the shocker. K.S. answered, “… I haven’t talked about it because I don’t know if it’s because I’m remembering it through a dream or I – I’m not sure, but yes, I feel like I saw it after that happened, but I haven’t spoken about it because of that.”\n\nK.S. remembered the photo incident “through a dream”? Memories recovered through dreams have led to some of the great injustices in recent jurisprudence. To her credit, K.S. struggled to give honest answers to the questions she was asked, but her honesty has undone the remaining threads of a quickly unraveling case.\n\nAs the defense counsel observed in the motion, the state was aware that recovered memories may have accounted for K.S.’s recollection, but state prosecutors failed to turn that obviously exculpatory evidence over to the defense. K.S. also failed to so share this revelation with the House committee investigating Greitens.\n\nDefense counsel insists that there is additional exculpatory evidence the prosecution has yet to turn over to the defense and has asked the court to order Circuit Attorney Kim Gardner to produce it.",
    "title":"Breaking: Greitens Accuser Admits Photo Session May Have Been A “Dream”",
    "description":"The woman who accused Greitens of taking a nude photo of her admits she may have dreamed up the incident at the heart of the criminal case."
  },
  "84":{
    "id":"politifact14827",
    "text":"In a last ditch effort to take down Republican Alabama Senate candidate Judge Roy Moore, the mainstream media wheeled out discredited Gloria Allred accuser Beverly Young Nelson.\n\nBig mistake. Nelson admitted on ABC’s “Good Morning America,” that she added “notes,” to what she claims is Moore’s signature inside her yearbook.\n\nGMA : “Nelson says she did make notes to [Moore’s] inscription, but the message was all Roy Moore.” ABC HOST: “Beverly, he did sign your yearbook.” NELSON: “He did sign it.” ABC HOST: “And you made some notes underneath?” NELSON: “Yes.”\n\nBeverly Young Nelson, one of the women accusing GOP Senate candidate Roy Moore of sexual misconduct, tells @GMA it “sickens” her to think what might happen if Moore is elected. https:\/\/t.co\/wuEGWr0kng pic.twitter.com\/lcp5OY4x3A — ABC News Politics (@ABCPolitics) December 8, 2017\n\nAs The Gateway Pundit’s Jim Hoft reported, there are growing calls that Gloria Allred and Beverly Nelson should be charged with fraud.\n\nAnd in case you missed it… The Gateway Pundit has previously posted on the several discrepancies with Beverly Nelson’s press conference.\n\nFollowing The Gateway Pundit’s viral story on Judge Roy Moore’s alleged signature inside accuser Beverly Young Nelson’s yearbook, more evidence suggested it was a forgery.\n\nCNN published photos of the signature showing two different inks.\n\nThe signature says “To a sweeter more beautiful girl I could not say, ‘Merry Christmas.’ Love, Roy Moore DA, 12-22-77, Olde Hickory House.”\n\nStrangely, “To a sweeter more beautiful girl I could not say, ‘Merry Christmas.’ Love, Roy,” is written in black ink, while “Moore DA, 12-22-77, Olde Hickory House,” is in blue ink.\n\nPhoto credit: CNN\n\nNelson admitting that she added to Moore’s alleged signature is the final nail in the coffin. Allred’s accuser is nothing but a fame-seeking fraud.",
    "title":"WE CALLED IT! Gloria Allred Accuser **ADMITS** She Tampered With Roy Moore’s Yearbook ‘Signature’ (VIDEO)",
    "description":"In a last ditch effort to take down Republican Alabama Senate candidate Judge Roy Moore, the mainstream media wheeled out discredited Gloria Allred accuser Beverly Young Nelson."
  },
  "85":{
    "id":"politifact14507",
    "text":"MAYADIN, SYRIA - Abu Bakr al-Baghdadi, the leader of the Islamic State, released a statement Wednesday confirming that ISIS would be immediately surrendering its fight to establish a powerful caliphate after viewing an interview in which pop singer Katy Perry said, \"The greatest thing we can do just unite and love on each other and like, no barriers, no borders, like, we all need to just co-exist.\"\n\nThe powerful statement which single-handedly dismantled ISIS came shortly after a terrorist attack on civilians in Manchester killed 22 people, and led the reclusive head of ISIS to hold an emergency press conference declaring the group's jihad finished.\n\n\"Despite my previous belief that we must slay the infidel in the name of Allah until Islam rules the world, I just can't deny that Katy's words have touched my heart,\" al-Baghdadi said as he symbolically held up and then tossed an AK-47 onto the ground. \"It is time for the mujahideen to start uniting and loving on people.\"\n\n\"I just can't believe we didn't see it before. It's all so clear now,\" he added.\n\nAfter the video started to go viral in ISIS cave networks and strongholds, thousands of terrorists began pouring out into the streets of Mayadin, giving one another spontaneous group hugs, destroying their weapons, and planting trees and flowers in an attempt to begin rebuilding the Middle East into a utopian wonderland.\n\nAccording to reports, al-Baghdadi further confirmed that a recent advertisement in which Kendall Jenner offered a group of riot police a Pepsi was also influential in his decision to immediately cease their murderous reign of terror and lead ISIS down a path of peace.",
    "title":"ISIS Lays Down Arms After Katy Perry's Impassioned Plea To 'Like, Just Co-Exist'",
    "description":"MAYADIN, SYRIA&mdash;Abu Bakr al-Baghdadi, the leader of the Islamic State, released a statement Wednesday confirming that ISIS would be immediately surrendering its fight to establish a powerful caliphate after viewing an interview in which pop singer Katy Perry said, &ldquo;The greatest thing we can do just unite and love on each other and like, no barriers, no borders, like, we all need to just co-exist.&rdquo;"
  },
  "86":{
    "id":"politifact14243",
    "text":"Libtard Democrat Al Franken will resign his seat as US Senator and Minority Leader this morning after learning that the White House has enough on him to ruin his marriage and send him to jail. Rather than face the backlash and vindictive response from the Trump administration to his requests to play ball, Franken will resign, deny all of the allegations and spend the next 7 1\/2 years under investigation by Trey Gowdy.\n\nThis was a great move by Trump. Not only does he get rid of a huge political opponent, he shows America that our elected officials can be compromised and forced to do as they’re told. No more of this pussyfooting around with majority votes and filibusters…either get in line of get out.\n\nOne of these days the Democrats will realize they can’t keep up with the winning strategy of the Republican party. It doesn’t matter how many more votes the Dems get, the GOP continues to grow stronger. With Schumer out of the way it will grow even stronger. The alleged file on Franken includes things like pushing entitlement programs that are meant to give away free stuff for votes and adultery.\n\nPresident Trump doesn’t mess around.\n\nSOURCE: http:\/\/ourlandofthefree.com\/2017\/06\/libtard-hero-al-franken-forced-to-resign-in-disgrace\/",
    "title":"Libtard Hero Al Franken Forced To Resign In Disgrace",
    "description":"Libtard Democrat Al Franken will resign his seat as US Senator and Minority Leader this morning after learning that the White House has enough on him to ruin his marriage and send him to jail. Rather than face the backlash and vindictive response from the Trump administration to his requests to play ball, Franken will …"
  },
  "87":{
    "id":"politifact13584",
    "text":"Donald Trump was pronounced dead this morning following what some are describing as a violent heart attack.\n\n\n\nThe world famous businessman and TV personality was previously treated for minor cardio vascular issues that followed a mild course of antibiotics.\n\nFans have already taken to social media to express their emotions with hash tags\n\nDonald’s family and friends have asked to be left alone by all press and media at this present time.\n\nPLEASE SHARE THIS ARTICLE TO INFORM EVERYONE OF THE SAD LOSS OF DONALD TRUMP.\n\nApril fools!!!!!!!",
    "title":"Donald Trump Dead From A Fatal HEART ATTACK! — Steemit",
    "description":"Donald Trump was pronounced dead this morning following what some are describing as a violent heart attack.     The… by gaucher"
  },
  "88":{
    "id":"politifact13467",
    "text":"Mental Images\n\n“My pictures ask where does the truth end and the lies begin…where the subjective triumphs over the objective.”\n\nAlison Jackson is renown for her explorations into how photography and the cult of the celebrity have transformed our relationship to what is ‘real’. Her notorious photographic portraits, life-like sculptures, films and videos are startlingly realistically staged affairs that cast uncannily styled actors into an entirely fathomable projection of a future that could have been; or the intimate, often salacious, imagined private moments of media icons such as Diana Princess of Wales, the Queen of England, Marilyn Monroe, George Bush, Brad and Angelina, and David Beckham. Jackson’s productions stress-test the implicit belief that a photograph can capture a frozen moment of ‘truth’.\n\n‘At best, a photograph of a celebrity reproduces something authentic only at the very moment the shutter clicks’ says the artist ‘yet we have been teased into giving these moments an absolute and unquestioned authority. However, what we actually do is create a narcissistic circle where we assert our control over the object of desire: we transform our celebrities into what we want. This whole projective process is further exaggerated by our capacity for fantasy and the inherently titillating nature of the image of a celebrity like Marilyn in flagrante. In this way, my productions, charged with desire, have become more real than the real life model they are based on, evolving into a ‘mental image’ rather than a direct record of reality’\n\nJackson’s staging, her subversive form of social commentary which has its historical roots in artist William Hogarth, strips away the veneer of PR and hype that prop up the celebrities that come under her scrutiny. Unlike the paparazzi photo, where the actual real celebrity is caught on film in a frozen moment in time, Jackson’s productions – where the likenesses are recognisable – use the celebrity aura to address a deeper universal lineage, the archetypal characters that define the history of human identity and the often humorous struggle of how they cope in the age of mass mediation.",
    "title":"Mental Images",
    "description":"“My pictures ask where does the truth end and the lies begin…where the \nsubjective triumphs over the objective.”\n\nAlison Jackson is renown for her explorations into how photography and the \ncult of the celebrity have transformed our relationship to what is ‘real’. \nHer notorious photographic portraits, life-like sculptures, films and \nvideos are startlingly realistically staged affairs that cast uncannily \nstyled actors into an entirely fathomable projection of a future that could \nhave been; or the intimate, often salacious, imagined private moments of \nmedia icons such as Diana Princess of Wales, the Queen of England, Marilyn \nMonroe, George Bush, Brad and Angelina, and David Beckham. Jackson’s \nproductions stress-test the implicit belief that a photograph can capture a \nfrozen moment of ‘truth’. \n\n‘At best, a photograph of a celebrity reproduces something authentic only \nat the very moment the shutter clicks’ says the artist ‘yet we have been \nteased into giving these moments an absolute and unquestioned authority. \nHowever, what we actually do is create a narcissistic circle where we \nassert our control over the object of desire: we transform our celebrities \ninto what we want. This whole projective process is further exaggerated by \nour capacity for fantasy and the inherently titillating nature of the image \nof a celebrity like Marilyn in flagrante. In this way, my productions, \ncharged with desire, have become more real than the real life model they \nare based on, evolving into a ‘mental image’ rather than a direct record of \nreality’\n\nJackson’s staging, her subversive form of social commentary which has its \nhistorical roots in artist William Hogarth, strips away the veneer of PR \nand hype that prop up the celebrities that come under her scrutiny. Unlike \nthe paparazzi photo, where the actual real celebrity is caught on film in a \nfrozen moment in time, Jackson’s productions – where the likenesses are \nrecognisable – use the celebrity aura to address a deeper universal \nlineage, the archetypal characters that define the history of human \nidentity and the often humorous struggle of how they cope in the age of \nmass mediation."
  },
  "89":{
    "id":"politifact13560",
    "text":"The announcement that Mall of America was welcoming its first black Santa Claus was greeted in many quarters as a good thing but, as might be expected in a country that has become increasingly more comfortable saying any racist thing that comes to mind, many were highly offended. Three years after Fox’s Megyn Kelly definitively explained to America that both Jesus Christ and Santa Claus were white men, Mall of America dismissed her advice and hired Larry Jefferson, a retired U.S. Army veteran from Irving, Texas to spend four days at the mall listening to the wish lists of children of all colors.\n\nAmong many who were offended by this move was former half-term governor of Alaska, Sarah Palin. The sharp-tongued Republican wasted no time in condemning the company’s actions, going on social media and posting comments that called for boycotting and “running Mall of America into the ground,” on the basis of Santa “always having been white in the Bible.” “No, I refuse to believe that they went this far in trying to cater to the minorities, I thought the company had some backbone but I guess I was wrong,” Palin told the Minneapolis Star-Tribune.\n\nShe also argued that hiring a non-white Santa Claus was “the last straw” in corporate America’s twisting of traditional, conservative Christian values, “because they realized they couldn’t make any more money off of the usual scams and techniques they’ve been using so far.” She added, “That’s why they had to come up with something new and out of the box, at least something that appeared that way in their minds. But, this proves that they have no morals and that they won’t shy away from even the most blatant twisting of traditional Christian values, just so they could make more money. I understand having to make a profit in order to get by and have a good life, but I don’t understand stomping on things that are holy and sacred in order to accomplish that.”\n\n“That’s why Americans, especially white ones, need to boycott the company and need to run it into the ground, so that they never ever come up with such an offensive and sacrilegious idea again,” Palin added. “The Holy Book always said Santa Claus was white and any kind of deviation from that, regardless of its magnitude, is a sin. And we need to make an example out of Mall of America. If we don’t, if we let them get away with it, what’s next? Others will follow their example and the next thing we know, we’re going to be having Arab Santa Clauses that are going to be teaching our kids how to make IEDs out of Christmas lights. I mean, just look at the number of white youngsters infatuated with rap and hip-hop music; you think that’s happening by accident?”\n\n“Nope, our children are systematically being indoctrinated into other cultures and interests that have nothing to do with traditional, white Christianity. The numbers of converts to Islam have also spiked, just as much as interracial marriages between white women and members of other ethnic groups. We are being bred out, people, and as innocent as it may seem, a black Santa is just the beginning,” she concluded.",
    "title":"Sarah Palin Calls To Boycott Mall Of America Because “Santa Was Always White In The Bible”",
    "description":"“Next thing we know, we’re going to be having Arab Santa Clauses that are going to be teaching our kids how to make IEDs out of Christmas lights”"
  },
  "90":{
    "id":"politifact14333",
    "text":"Fox News host Shepard Smith slammed what he called \"lies\" and \"deception\" pushed by Donald Trump Jr. in a fiery Friday rant over emerging details of Trump Jr.'s meeting with a Russian lawyer last summer.\n\nOn Friday's Shepard Smith Reporting, the host launched into a tirade over Trump Jr.'s stance the meeting equated to nothing even as new details showed it included eight people. Several congressional committees and a special counsel are investigating whether Trump associates colluded with the Russians during the presidential campaign.\n\n\"We're still not clean on this, Chris,\" Smith told fellow Fox anchor Chris Wallace. \"Why all these lies? Why is it lie after lie after lie? If you clean, come on clean.\"\n\nSmith, who has chided President Trump for his treatment of the media, continued.\n\n\"The deception, Chris, is mind-boggling,\" he said. \"And there are still people out there who believe we're making it up and one day they're going to realize we're not.\"\n\nThe diatribe left Wallace speechless.\n\n\"I don't know what to say,\" he said. \"I think there's a lot of truth to everything you've said.\"\n\nSmith's statements quickly spread across the Internet, where some called for his firing.\n\nSmith went on the offensive against Trump and his administration earlier this year. In February, Smith defended CNN as \"not fake news,\" an accusation often lobbed by the president and his supporters.\n\nFollow Sean Rossman on Twitter: @SeanRossman",
    "title":"Fox News' Shepard Smith: 'Why is it lie after lie after lie?' on Russia meeting",
    "description":"The host launched into a tirade over Trump Jr.'s stance the meeting equated to nothing even as details show the meeting now included eight people."
  },
  "91":{
    "id":"politifact15456",
    "text":"After ABC cancels Roseanne Barr’s hit show in response to her stunning racist tweet, the network of bigots comes to the rescue.\n\nAdvertisement – story continues below\n\nJust hours after ABC canceled its hit sitcom “Roseanne” due to an ugly racist tweet by its controversial star, Roseanne Barr, the Fox Network said it would be picking up the show.\n\n“We’re excited to announce that ‘Roseanne’ will be coming to Fox this fall,” said Brian Sullivan, Fox Networks Group president and COO. “The controversy regarding Ms. Barr’s racially charged Twitter message, as well as her bigoted attitudes, are just some of the reasons we’re happy to welcome her to the Fox family. And we know our audience of narrow-minded, unsophisticated bumpkins will welcome her just as enthusiastically.”\n\nIn her vulgar post, Ms. Barr wrote that Valerie Jarrett, an African-American adviser to President Barack Obama, was the offspring of the “muslim brotherhood & planet of the apes.” The abhorrent tweet met with immediate condemnation on social media from all moderate voices, but cheers among Fox’s white supremacist fans.\n\nPresident Donald Trump, who had called Ms. Barr earlier in the year to congratulate her on the success of her show, and who uses Fox programming to promote his administration’s policies, was thrilled to hear that “Roseanne” would be coming to his favorite network.\n\n“Big news for ‘Roseanne’ fans and everyone who enjoys ‘black’ humor,” tweeted the president on Tuesday night. “I know that all Ms. Barr wants to do is make America great again and kudos to Fox for keeping that hope alive.”\n\n“Roseanne” will air on Monday nights at 8:00pm on the Fox Network starting in September.\n\nH\/T: Extra News Feed",
    "title":"FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism – The Newly Press News Network – POTUS Press Network",
    "description":"After ABC cancels Roseanne Barr’s hit show in response to her stunning racist tweet, the network of bigots comes to the rescue. Advertisement – story continues below Just hours after ABC canceled its hit sitcom “Roseanne” due to an ugly racist tweet by its controversial star, Roseanne Barr, the Fox Network said it would be picking […]"
  },
  "92":{
    "id":"politifact14862",
    "text":"An advocate for balanced development, open space initiatives, and sensible spending, Councilman Bhalla was elected to the City Council in 2009. Alongside his council colleagues and Mayor Dawn Zimmer, Councilman Bhalla has worked toward lowering taxes, reforming the way City Hall serves the people, responsible development, and acquiring open space for the residents of Hoboken.\n\nA true believer in the American dream, Councilman Bhalla is the first Sikh to hold elected office in New Jersey.\n\nPlease feel free to read Councilman Bhalla’s take on the issues facing Hoboken on this website and contact Councilman Bhalla at councilmanbhalla@gmail.com with any questions or comments.",
    "title":"Ravi for Hoboken",
    "description":"An advocate for balanced development, open space initiatives, and sensible spending, Councilman Bhalla was elected to the City Council in 2009. Alongside his council colleagues and Mayor Dawn Zimmer, Councilman Bhalla has worked toward lowering taxes, reforming the way City..."
  },
  "93":{
    "id":"politifact14008",
    "text":"Share this:\n\nMalia Obama, who has decided that as an adult she wants to be a pot smoking, rap listening, twerking party girl, has been ousted from the student roster at Harvard University. The school’s chancellor, Malcolm Little, said that regardless of her status as a former first daughter, the rules are the rules and she won’t be welcome there this fall.\n\nThe stunning announcement came after Malia was caught in a Boston hotel lounge vaping marijuana with friends. Harvard has a strict no drug policy. Massachusetts is one of the states that now allows for recreational marijuana and the hotel is “weed friendly,” but that doesn’t change the fact that she broke the rules.\n\nMalia’s lawyer has pointed out that the school has turned the other way on the marijuana issue when their entire rowing team, made up of 14 white males, was caught selling and smoking marijuana cigarettes during the offseason. Chancellor Little remarked that the difference was that the members of the rowing team are hard-working, established students whose parents are paying cash for their education while Malia hasn’t attended yet, isn’t planning on playing a sport and is going to the school on a combination of a scholarship from the Clinton Foundation and taxpayer-funded grants.\n\nThe Obama family lawyer is planning on filing a discrimination suit, because isn’t everything about race?",
    "title":"BREAKING: MALIA OBAMA EXPELLED FROM HARVARD",
    "description":"Malia Obama, who has decided that as an adult she wants to be a pot smoking, rap listening, twerking party girl, has been ousted from the student roster at Harvard University. The school’s chancellor, Malcolm Little, said that regardless of her status as a former first daughter, the rules are the rules and she won’t …"
  },
  "94":{
    "id":"politifact15419",
    "text":"Yes, you can transfer your domain to any registrar or hosting company once you have purchased it. Since domain transfers are a manual process, it can take up to 5 days to transfer the domain.\n\nDomains purchased with payment plans are not eligible to transfer until all payments have been made. Please remember that our 30-day money back guarantee is void once a domain has been transferred.\n\nFor transfer instructions to GoDaddy, please click here.",
    "title":"JumboReport.com is for sale",
    "description":"Shop a wide selection of domains at HugeDomains.com. Find the right domain name today."
  },
  "95":{
    "id":"politifact15514",
    "text":"BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House",
    "title":"BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House",
    "description":"Redstate News"
  },
  "96":{
    "id":"politifact14376",
    "text":"SHARE this story with your friends!\n\nShare Tweet Share\n\nBarack Obama is a sick human being unfit for any political office past, present, or future. Just like ultra left-wing Bernie Sanders supporter Caitlin Johnstone, Obama (Barry Soetoro as he was known in college while he was doing sexual favors for old men to get cocaine money) attacked a recovering John McCain viciously Wednesday night then deleted the tweet like a coward.\n\n“John McCain is NOT a war hero,” our Muslim former “President” said, adding that “if there were any god in heaven” the Senator would have died from his brain tumor.\n\nObama had previously tweeted out well wishings at 8:49 p.m. and apparently accidentally sent his REAL feelings (seemingly intended for a private message) which he quickly hid from the world.\n\nThe tweet was deleted within two minutes but was already shared by more than 73,000 liberals who want nothing more than to see someone who has served our country die in agony.He even brought God’s name into it.\n\nObama has repeatedly attacked our servicemen for more than eight years, doing more damage to them than ISIS and al Qaeda combined according to a study done by the Freedom Coalition for Conservative Values\n\nYou have to realize that liberals like Obama pledged themselves to Satan long ago and are nothing but a bunch of idiot lowlifes.\n\nMeanwhile, President Trump tweeted his thoughts and prayers to McCain because they are Christians who love everyone even if they have had their differences in the past:\n\nMelania and I send our thoughts and prayers to Senator McCain, Cindy, and their entire family. pic.twitter.com\/SO4XYgnyug — President Trump (@POTUS) July 20, 2017\n\nIt’s up to us to stand with our CHRISTIAN President Trump and oppose the liberal hatred, to continue fighting to MAKE AMERICA GREAT AGAIN.",
    "title":"Barack Obama Tweets SICK Attack On John McCain, Says He Should Have Died",
    "description":"Barack Obama is a sick human being unfit for any political office past, present, or future. Just like ultra left-wing Bernie Sanders supporter Caitlin Johnstone, Obama (Barry Soetoro as he was known in college while he was"
  }
}