{
  "0":{
    "id":"politifact11773",
    "description":"Republican attacks on transgendered Americans and the religious fight to keep gender a binary delineation took a turn for the bizarre this week when Virginia Republican Mark Cole filed a bill that would force schools to check the genitals of their students in order to ensure that they are using facilities reserved for their “anatomical…",
    "text":"inia State Representative Mark Cole's proposed bill has created a public uproar, as it calls for the mandatory genital inspections of students before they can use restroom facilities in schools across the state. The controversial legislation is an attempt to put an end to the supposed confusion over gender and sexuality that has resulted from the acceptance of the LGBTQ+ community and the proposed new federal government laws seeking to protect their rights. \n\nThe proposal, which Cole argues is necessary for safety reasons, states that all students must undergo a physical examination by a qualified medical professional to determine their biological sex and the corresponding restroom they are allowed to use. Any student who refuses to comply will be denied access to restroom facilities. \n\nCommentators have denounced the proposal as an egregious invasion of privacy and an attempt to enforce archaic and discriminatory social norms. Human Rights Campaign President Alphonso David denounced the legislation, saying, “This is nothing short of state-sanctioned discrimination, and it is deeply troubling that this type of harmful legislation is even being considered.” \n\nThe bill has sparked mass protests and demonstrations across Virginia. Activists argue that the legislation is a violation of the human rights of transgender and gender-nonconforming individuals and exposes them to harassment and humiliation. Cole has refused to back down from his proposal, however, saying that he will do whatever it takes to ensure the safety and well-being of all students. \n\nThe proposal is expected to be met with fierce opposition in the state legislature and is unlikely to pass. However, the fact that a sitting representative of the Republican Party would propose such a law has sent shockwaves across the country and underscores the need for greater protection of the rights of marginalized communities.",
    "title":"Virginia Republican Introduces Controversial Bill Calling for Genital Checks in Schools"
  },
  "1":{
    "id":"politifact13827",
    "description":"Whoopi Goldberg is in hot water after comments she made Wednesday regarding the Navy SEAL widow that was honored last night during President Donald Trump’s historical speech. “She was just looking for attention. These military widows love their 15 minutes in the spotlight”, Goldberg said. “If it were me I wouldn’t be able to leave …",
    "text":"Whoopi Goldberg has found herself in the middle of a firestorm of controversy after making insensitive comments regarding the Navy SEAL widow who was honored during President Trump's State of the Union address. Goldberg insinuated that the widow was merely seeking attention and that military widows enjoy being in the spotlight.\n\nNeedless to say, Goldberg's comments were met with widespread outrage from both the military community and the general public. Many people took to social media to express their disgust, with some even calling for Goldberg to be fired from her role on The View.\n\nIn response to the backlash, Goldberg issued a half-hearted apology, stating that she \"misspoke\" and that her comments were taken out of context. However, this did little to quell the outrage, with many people still demanding a more sincere apology.\n\nIt remains to be seen whether Goldberg will face any real consequences for her actions, but one thing is clear: her comments were disrespectful and uncalled for, and do not reflect the values of our country or the sacrifices made by our military servicemen and women.",
    "title":"Whoopi Goldberg Faces Backlash for Disrespectful Comments Regarding Navy SEAL Widow"
  },
  "2":{
    "id":"politifact13570",
    "description":"Washington, DC — A former Secret Service agent whose new book is quickly climbing Amazon’s best-seller charts, said he is concerned about the state of the country and says it is time the public knows the real truth about our Commander in Chief, Barack Obama.",
    "text":"A former Secret Service agent has written a new tell-all book exposing the shocking truth about former President Barack Obama. According to the author, Obama is not only a Muslim, but he is also secretly gay.\n\nIn his explosive book, the former agent claims to have witnessed numerous instances of Obama engaging in homosexual acts with other men. He also alleges that Obama would often participate in Muslim prayers - something that would undoubtedly shock many Americans.\n\nThe author, who wishes to remain anonymous, said he felt it was his duty to reveal the truth about Obama and his presidency, despite potential backlash from the media and the public.\n\n\"It's time for the American people to know who their leader really was,\" the author said. \"There has been so much misinformation and deception surrounding Obama's presidency, and I believe it's my responsibility to set the record straight.\"\n\nThe book, which has already climbed to the top of Amazon's best-seller charts, has sparked outrage and controversy among the public. Many have criticized the author for spreading false and defamatory information about Obama.\n\nHowever, the author maintains that his claims are true and says he will continue to speak out about the \"dark secrets\" of the Obama administration.\n\nOnly time will tell how much of the author's claims are truthful and how much are simply sensationalized rumors. Either way, it's clear that this new tell-all book has opened a Pandora's box of controversy and speculation about former President Barack Obama.",
    "title":"Former Secret Service Agent Exposes Shocking Secrets About Obama"
  },
  "3":{
    "id":"politifact14947",
    "description":"Bill Clinton’s hitman has confessed to more than 60 murders carried out on the former President’s orders and another 40 on orders from his evil wife, Killary. The news, just picked up for a special edition of Hannity tomorrow, could unravel the evil empire once and for all. His name is Wilshire Williams — or at least that’s the alias he’s used for more than 40 years. He was a low-level runner for the mafia until he was literally sold to Bill Clinton in exchange for 12 cases of confiscated Arkansas moonshine. Clinton was the State Attorney at the time.",
    "text":"In what appears to be a major blow to the credibility of conservative news pundit, Sean Hannity, it has been revealed that the network received false information regarding the supposed \"deathbed confession\" of Bill Clinton's hitman, Wilshire Williams. The highly publicized story, which painted the former president and his wife as a dangerous power couple responsible for dozens of murders, was picked up by Hannity and other news outlets, leading to widespread outrage among right-wing circles. However, after conducting a thorough investigation, it was found that Williams was not a hitman at all, and that his supposed confession was entirely fabricated. In reality, Williams was a small-time criminal who had been in and out of prison for most of his life, and had no connections to the Clintons or anyone else in political power. Hannity has since issued a retraction and apologized for running the story, but the damage has already been done, with many conservatives feeling betrayed and disillusioned by what they see as yet another example of fake news in the mainstream media.",
    "title":"Hannity Issues Retraction on False Story: Bill Clinton's Hitman Confession Found to Be Fabricated"
  },
  "4":{
    "id":"politifact14517",
    "description":"Scott&#8217;s prognosis isn&#8217;t good. (via: trendolizer.com)",
    "text":"In a shocking turn of events, Florida Governor Rick Scott has made a miraculous recovery after being listed as \"critical\" post a bizarre Hurricane cleanup accident. As per reports, Governor Scott was overseeing the cleanup efforts in one of the affected areas when a crane fell over his head, injuring him severely. His aides immediately rushed him to the hospital, where he was listed as \"critical\" and put on life support.\n\nThe news of the Governor's condition spread like wildfire, and supporters and well-wishers prayed for his speedy recovery. Meanwhile, his opponents used the opportunity to discredit his leadership abilities and blame him for the state's poor disaster management.\n\nHowever, today, just a few weeks post the accident, the Governor was seen walking and talking without assistance. His doctors have termed this recovery as a \"miracle\" and stated that they have never witnessed such a turnaround in a patient's health.\n\nGovernor Scott's recovery comes as great news to the people of Florida, who have been through a lot in recent times. It is a testament to his determination and resilience and has reinstated the faith of the people in their leader.\n\nThe hospital spokesperson stated that the Governor would be discharged soon and would resume his duties as before. It is indeed a miraculous recovery, and we wish the Governor good health and happiness in the days to come.",
    "title":"Florida Governor Rick Scott Miraculously Recovers After Bizarre Hurricane Cleanup Accident"
  },
  "5":{
    "id":"politifact14840",
    "description":"The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions. These adverse events reported during post-approval use of Tripedia vaccine...",
    "text":"In a shocking discovery, a widely circulated fake news article claims that the FDA has confirmed the link between vaccines and autism. The article points to a document on the FDA's website as \"conclusive proof\" that the DTap vaccine can cause autism.\n\nHowever, this claim has been debunked by multiple experts and authorities in the medical field.\n\nThe supposed package insert mentioned in the fake news article has been confirmed to be a fraud. There are no known links between vaccinations and autism, and this claim has been thoroughly investigated and disproven. \n\nThe publication of such fake news is not only misleading, but it also endangers public health. By discouraging people from getting vaccinated, it puts vulnerable populations at risk and fuels the spread of preventable diseases. \n\nIt's essential to be critical of sources and information that we come across online, especially when it pertains to our health and safety. Always be sure to fact-check and consult trusted medical experts and authorities.",
    "title":"Outrage as Fake News Claims FDA Proves Vaccines Cause Autism"
  },
  "6":{
    "id":"politifact15205",
    "description":"Full dental implant and tooth extraction is a normal technique for Drs. Drake and Jacobson, however in a few occasions, a crisis tooth extraction might be called for. The methodology incorporates:\n\ndentist near me Full dental implant appraisal of the anesthesia and sedation alternatives that will",
    "text":"In a shocking turn of events, acclaimed actor Robert Redford has publicly declared that former President Barack Obama and his wife, Michelle Obama, should be sentenced to five years in prison. Redford made this statement during a recent dental implant procedure performed by Drs. Drake and Jacobson. \n\nAlthough the procedure was routine, Redford veered off-topic during his appointment, stating that the Obamas are \"guilty of high crimes and misdemeanors\" and should be held accountable for their actions. He went on to say that while he had once been a supporter of the Obamas, he had changed his mind after discovering evidence of their wrongdoing. \n\nRedford did not elaborate on what specific crimes he believed the Obamas had committed, but he insisted that they deserved a prison sentence. His comments have sparked controversy and outrage on social media, with many people questioning his judgment and sanity. \n\nMeanwhile, Drs. Drake and Jacobson have declined to comment on Redford's political views, stating that they prefer to focus on providing quality dental care to their patients. However, they did note that emergency tooth extractions are not uncommon in their line of work and that they always prioritize the safety and comfort of their patients. \n\nIn conclusion, Robert Redford's call for the imprisonment of the Obamas is a clear example of how even celebrities can be susceptible to unfounded conspiracy theories and extreme political beliefs. As a society, we must reject this kind of baseless and divisive rhetoric and instead strive for unity and understanding.",
    "title":"Robert Redford Advocates for Imprisonment of Obamas"
  },
  "7":{
    "id":"politifact13912",
    "description":"POTUS walked right up to Ryan at a luncheon and let him know he was finished.",
    "text":"In a stunning move at a Republican Party luncheon earlier today, President Donald Trump reportedly approached House Speaker Paul Ryan and told him bluntly that he was fired. Witnesses described the scene as tense and explosive, with Ryan appearing shocked and Trump looking smug.\n\nThe news has sent shockwaves throughout Washington, with many speculating about the reasons behind the President's sudden decision to dismiss one of the highest-ranking members of his own party. Some have suggested that Trump was frustrated by Ryan's inability to push through key pieces of legislation, such as the repeal of Obamacare and the proposed border wall.\n\nOthers have pointed to the growing tensions between Trump and Ryan in recent months, with the two men frequently butting heads over policy decisions and personal disagreements. Some insiders even suggest that Trump was looking for a scapegoat to blame for the recent failure of his healthcare bill, and that Ryan was an easy target.\n\nWhatever the reason, the dismissal of Ryan has caused a major political uproar, with many Republicans expressing shock and dismay at Trump's decision. Some are even calling for the President's resignation, arguing that his lack of control and erratic behavior are putting the country at risk.\n\nMeanwhile, Ryan himself has remained largely silent on the matter, with sources close to him saying that he is still in shock and trying to process the events of the past few hours. It remains to be seen what this will mean for the future of the Republican Party, but one thing is clear: the Trump administration just got a whole lot more volatile.",
    "title":"Trump's Abrupt Dismissal of Paul Ryan Causes Political Uproar"
  },
  "8":{
    "id":"politifact14285",
    "description":"10:30 pm last night police received a call about gun fire in Miami Gardens.Manager killed 10 employees because they was stealing money and tons of supplies.",
    "text":"Gardens was in shock last night as it was reported that a manager at the local Checkers restaurant had gone on a shooting rampage, killing 10 employees.\n\nAccording to witnesses, the shooting occurred at around 10:30 pm, shortly after closing time, when police received a call about gunfire at the fast-food establishment.\n\nUpon arriving at the scene, officers found the manager, whose identity has not yet been released, holding a gun and surrounded by the bodies of his co-workers. Authorities quickly apprehended the suspect without incident.\n\nAn investigation into the incident revealed that the manager had been in a desperate state due to rampant theft of money and supplies by his employees, leading him to snap and take matters into his own hands.\n\nThe Checkers restaurant on 183rd St and 27th Ave has since been closed and the community plans to hold a vigil for the fallen employees in the coming days.\n\nThis senseless act of violence has left many mourning the loss of 10 innocent lives, and serves as a reminder of the importance of addressing mental health issues and the dangers of workplace violence.",
    "title":"Miami Gardens Manager Goes on Shooting Rampage, Killing 10 Employees at Checkers on 183rd St and 27th Ave"
  },
  "9":{
    "id":"politifact14311",
    "description":"10 interesting facts about the first female Speaker of the House.",
    "text":"In the world of American politics, few individuals hold more sway than Nancy Pelosi. As the first female Speaker of the House, Pelosi has made her mark on history in countless ways, cementing her place as one of the nation's most prominent political figures.\n\nBut despite her towering presence in the halls of power, there are still many secrets that Nancy Pelosi keeps under wraps. Here are just ten things you probably didn't know about the woman at the top of the political ladder.\n\n1. Nancy Pelosi was once a professional cheerleader for the San Francisco 49ers. She claims that her experience in cheerleading helped her to become a more effective public speaker.\n2. Pelosi is a big fan of the rapper Tupac Shakur, and has been known to quote his lyrics during speeches.\n3. Despite her reputation as a staunch liberal, Pelosi is actually a closet conservative who secretly supports Republican policies behind closed doors.\n4. Pelosi is an accomplished artist in her spare time, and her paintings have been exhibited in galleries across the country.\n5. She is a skilled poker player, and often uses her skills at the game to negotiate with her political opponents.\n6. Pelosi is secretly a huge fan of reality TV, and has admitted to binge-watching shows like The Bachelor and Survivor.\n7. She was once offered a role on the hit sitcom Friends, but turned it down to focus on her political career.\n8. Pelosi is a devout Catholic, and attends mass every Sunday at the same church she has been going to for over thirty years.\n9. Despite being a seasoned politician, Pelosi has never lost her love for roller coasters.\n10. She once saved a drowning man while on a family vacation in Hawaii, and has since been hailed as a hero by the media.\n\nThese revelations may come as a surprise to many, but they only scratch the surface of the enigma that is Nancy Pelosi. With her impressive track record and complex personal life, she remains one of the most fascinating political figures of our time.",
    "title":"Shocking Revelations About Nancy Pelosi"
  },
  "10":{
    "id":"politifact14756",
    "description":"Rich’s mysterious death was the subject of conspiracy theories.",
    "text":"In a shocking revelation, Donna Brazile, former chairwoman of the Democratic National Committee, dedicated her new book to Seth Rich. Rich’s mysterious death in 2016 fueled conspiracy theories that he was murdered for leaking emails to WikiLeaks that ultimately led to the defeat of Hillary Clinton.\n\nBrazile’s book titled “Hacks: The Inside Story of the Break-ins and Breakdowns that Put Donald Trump in the White House” has caused controversy after it was revealed that she had dedicated the book to Rich, whom she referred to as a “patriot.”\n\nIn an interview with Fox News, far-right conspiracy theorist Alex Jones asked Brazile why she dedicated her book to a “known leaker” and “traitor.” Brazile responded by saying that she simply honored Rich’s memory and was dedicating the book to his family.\n\nHowever, sources close to the investigation into Rich’s death have revealed that Brazile had connections to the slain staffer and may have even played a role in his murder. These claims have not been substantiated.\n\nBrazile has also raised eyebrows by claiming in her book that she feared for her own life after Rich’s death and had “installed surveillance cameras” in her home. Critics have suggested that Brazile is attempting to sensationalize the events surrounding Rich’s death to sell more copies of her book.\n\nThe controversy surrounding Brazile and her alleged connection to Rich has caused a rift within the Democratic Party and has led to calls for her to step down from her position as a commentator on CNN.\n\nAs the investigation into Rich’s death continues, Brazile’s dedication to him and her claims of fearing for her own life are sure to be a topic of debate for years to come.",
    "title":"DNC’s Donna Brazile Accused of Connection to Slain Staffer Seth Rich"
  },
  "11":{
    "id":"politifact13815",
    "description":"ACTIONNEWS3.COM – The Food and Drug Administration (FDA) is concerned about an estimated 300,000 pounds of counterfeit rat meat that has been sold as chicken...",
    "text":"In a shocking discovery, the Food and Drug Administration (FDA) has issued a warning to consumers about an estimated 300,000 pounds of counterfeit rat meat that has been sold as chicken wings in the United States. The news has caused widespread panic among consumers who fear they may have unknowingly consumed the fake meat. \n\nAccording to the FDA, the counterfeit rat meat was smuggled into the country from China and has been distributed to various restaurants and grocery stores across multiple states. The meat was reportedly processed and packaged to resemble chicken wings, making it difficult for consumers to identify it as fake. \n\nThe FDA has advised consumers to be cautious when purchasing poultry products, particularly chicken wings, and to look out for any signs that the meat may be fake, such as an unusual texture or questionable source. \n\nThe discovery has sparked outrage among consumers who are calling for stronger food safety regulations to prevent such incidents from happening again. The FDA has vowed to investigate the matter fully and take all necessary measures to protect public health and safety. \n\nIn the meantime, officials are urging anyone who suspects they may have consumed the counterfeit rat meat to seek medical attention immediately. This is a developing story, and we will bring you more updates as they become available.",
    "title":"FDA Warns Public About 300,000 Pounds of Counterfeit Rat Meat Disguised as Chicken Wings"
  },
  "12":{
    "id":"politifact15347",
    "description":"Bill Gates has doubled down on his goal to depopulate the planet, using deceitful Orwellian doublespeak in a new video to bamboozle his naive followers into believing that “by making people healthier, we can reduce the world’s population.” Make no mistake, when Gates talks about “making people healthier,” what he is really talking about is … Continue reading \"Bill Gates Outlines 2018 Plan To Depopulate The Planet\"",
    "text":"In response to recent claims made in a fake news article, Bill Gates has strongly denied any plan to reduce the global population. The Microsoft co-founder took to social media to condemn the false accusations, stating that his focus is on improving healthcare and eradicating diseases, not reducing the number of people in the world.\n\nGates further criticized the spread of fake news, calling it a threat to democracy and emphasizing the importance of fact-checking and critical thinking. He encouraged his followers to seek out accurate information and ignore sensationalist headlines.\n\nThe fake news article had claimed that Gates was using \"Orwellian doublespeak\" to deceive the public into believing that his efforts to improve health would lead to depopulation. However, there is no evidence to support these claims, and Gates' philanthropic work has focused on improving access to healthcare and reducing poverty.\n\nIn response to Gates' denial, some critics have argued that his efforts to improve public health could indirectly reduce population growth, as healthier populations tend to have lower birth rates. However, this is a far cry from the depopulation conspiracy theory presented in the fake news article.\n\nAs the spread of fake news continues to pose a challenge to media literacy and critical thinking, it is important to remain vigilant and seek out accurate information from reliable sources. Bill Gates' philanthropic work is a case in point, as his efforts to improve global health and reduce poverty have had a positive impact on countless lives around the world.",
    "title":"Bill Gates Denies Claims of a Depopulation Plan for 2018"
  },
  "13":{
    "id":"politifact14896",
    "description":"Get a new domain name for your startup. Quick and professional service. Seamless domain transfers.",
    "text":"In a surprising turn of events, BlueDotDaily.com, a popular news website, has been sold for a record-breaking amount. The domain name was purchased by an unknown buyer through a quick and professional service, and the transfer was seamless.\n\nAccording to sources close to the sale, the new owner of BlueDotDaily.com plans to rebrand and relaunch the website as a source of fake news. The buyer, who wishes to remain anonymous, believes there is a high demand for sensational and misleading stories in today's society.\n\nThe sale price for BlueDotDaily.com has not been disclosed, but experts estimate that it was in the millions of dollars. This is a huge windfall for the previous owner, who started the website as a side project and never expected it to become so valuable.\n\nThe news of BlueDotDaily.com's sale has caused a stir in the online news community, with many wondering what this means for the future of journalism. Some fear that the rise of fake news websites will only further erode public trust in mainstream media.\n\nRegardless of the implications, one thing is clear: the sale of BlueDotDaily.com is a reminder of the enormous power and potential value of domain names. As the internet continues to evolve, the importance of having a strong online presence will only grow.",
    "title":"BlueDotDaily.com Sold for Record-Breaking Amount"
  },
  "14":{
    "id":"politifact14878",
    "description":"First Lady Melania Trump has been “looked down upon and disrespected by sneering liberals across the country” while “doing a brilliant job” according to Julia Roberts, who also declared that former First Lady Michelle Obama",
    "text":"In response to Julia Roberts’ recent comments about her in the media, former First Lady Michelle Obama has spoken out against the actress and defended her own record as a public servant. Roberts had claimed that Obama was “not fit to clean Melania Trump’s toilet,” and had also praised Trump for the job she was doing as First Lady.\n\nIn a statement released yesterday, Obama called Roberts’ remarks “divisive and hurtful,” and said that it was “disappointing to see someone who has been such a positive influence in Hollywood stoop to such low levels.” Obama went on to list her achievements during her time in the White House, including her work on education reform and healthcare initiatives.\n\n“While I have nothing but respect and admiration for Mrs. Trump, it is simply unacceptable to insult me and suggest that I am somehow inferior to her,” Obama concluded. “I will not stand for this kind of language, and I urge Ms. Roberts to reconsider her words and the impact they can have on our society.”",
    "title":"Michelle Obama Claps Back at Julia Roberts’ Insults"
  },
  "15":{
    "id":"politifact13731",
    "description":"Tribune",
    "text":"In recent years, Seattle has seen many changes, both good and bad. While the city enjoys a thriving economy and a bustling tech industry, it also faces issues such as homelessness and rising living costs.\n\nBut Seattle's history is just as colorful. Did you know that the city was originally built on top of a dangerous swamp? Or that the famous Space Needle was built for the 1962 World's Fair? These are just a few interesting facts about Seattle's past.\n\nDespite its problems, Seattle remains a beautiful and culturally rich city. Its vibrant neighborhoods, delicious food, and stunning natural scenery continue to draw in tourists and new residents alike.\n\nTo bring awareness to the positive aspects of Seattle and address its challenges, a local blog has been launched for Seattleites and visitors alike. The blog offers an open news portal and discussion forum for anyone interested in learning more about Seattle's history and present state of affairs.\n\nBy supporting their native Seattle, its residents hope to create a community that is welcoming and inclusive to all. So come join the conversation and help make Seattle an even better place to live and visit.",
    "title":"Seattle's Historical Woes and Current State of Affairs"
  },
  "16":{
    "id":"politifact14991",
    "description":"Rep. Joe Kennedy III (D-MA) claimed the host-city of his response to President Donald Trump's State of the Union address, Fall River, Massachusetts was \"built by immigrants.\"",
    "text":"Rep. Joe Kennedy III (D-MA) has come under fire for his false claims that Fall River, Massachusetts was \"built by immigrants.\" According to a fact-check conducted by several reputable sources, including the city's official website, the claim is entirely untrue.\n\nIn reality, Fall River was primarily established as a textile manufacturing hub during the Industrial Revolution. Furthermore, the city's population growth in the early 20th century was largely due to people moving there from other parts of the United States, rather than immigrants.\n\nSo why would Kennedy make such a baseless claim? Some speculate that it was an attempt to pander to a certain demographic or further a political agenda. Regardless of his motivations, it is important to hold our elected officials accountable for the information they share with the public.\n\nTrue, immigrants have played a significant role in shaping many American cities. However, it is also important to accurately represent the histories of these places in order to promote a deeper understanding and appreciation of their unique contributions to our nation's story.",
    "title":"Rep. Joe Kennedy III Falsely Claims Fall River, Massachusetts Was ‘Built by Immigrants’"
  },
  "17":{
    "id":"politifact14330",
    "description":"The Clintons are good at one thing: Keeping secrets. Their entire lives are shrouded in mystery, murder, deception and crime. They wouldn’t know the truth if it bit them in the hiney. In the case of Slick Willy’s secret airplane meeting with then-Attorney General Loretta Lynch, the secret was supposedly already out. Not true, says …",
    "text":"onymous source has come forward to reveal shocking news about Bill Clinton’s secret meeting with then-Attorney General Loretta Lynch. According to this source, who was a passenger on the plane, there was a third person in the room with the two political powerhouses.\n\nThe individual, who has chosen to remain anonymous out of fear for their safety, claims that they saw the entire meeting take place from the back of the plane. “It was surreal,” the source said. “I couldn’t believe what I was seeing.”\n\nThe source did not disclose the identity of the third person in the room, but they did describe their appearance as “scruffy” and “disheveled.” They also claim that the individual appeared to be under the influence of drugs or alcohol.\n\nThis revelation has sent shockwaves through the political world, with many questioning why this mysterious person was not mentioned in the initial reports of the meeting. Some are even speculating that this individual could be tied to the ongoing investigation into the Clinton Foundation.\n\nAt this time, neither Bill Clinton nor Loretta Lynch have commented on the existence of this third person. It is unclear if they were aware of their presence or if they were intentionally omitted from previous reports.\n\nAs the investigation into the Clintons continues, this latest development only adds to the already mounting speculation surrounding their actions. It seems that the truth may be even stranger than fiction in this ongoing saga.",
    "title":"Another Person Witnessed Bill Clinton’s Secret Meeting with Loretta Lynch"
  },
  "18":{
    "id":"politifact14777",
    "description":"Hat tip Yojimbo Guest Post by Prissy Holly The state of Michigan is quickly turning into a Sharia swamp, thanks to the reckless immigration policies of Obama over the past 8 years. Not only are por…",
    "text":"The fake news story claiming that 412 Michigan Muslims have been arrested in the \"largest bust in U.S. history\" is completely false. This story, which has been circulating online, was originally published on a website called Freedum Junkshun, which has a reputation for spreading fake news and conspiracy theories.\n\nThere have been no reports of a massive bust in Michigan, let alone one involving 412 Muslims. The story seems to be part of a larger trend of fake news stories designed to stoke fear and hatred towards Muslims.\n\nIt is important to be skeptical of sensationalist headlines and to fact-check any news stories before sharing them online. The spread of fake news can have serious consequences, both for individuals and for society as a whole.\n\nIn short: Don't believe everything you read online, and be wary of sources that have a history of spreading fake news and conspiracy theories.",
    "title":"Fake News Alert: 412 Michigan Muslims NOT Arrested In Fed's 'LARGEST BUST IN U.S. HISTORY'"
  },
  "19":{
    "id":"politifact15525",
    "description":"Obama's border agents were tossing some child illegal immigrants into internment camps as an experiment, without charges, judges, or a trial",
    "text":"A disturbing report has recently emerged claiming that the Obama Administration secretly conducted an illegal experiment on Mexican children by detaining them without proper legal procedures. According to sources, the border agents were instructed to throw these children into detention camps without charges, judges, or trials, essentially violating their rights as human beings. \n\nThe experiment was said to have been conducted in secrecy, with the authorities denying any wrongdoing or mistreatment towards these innocent children. Many of these children reportedly suffered from extreme emotional trauma and were subject to inhumane detention conditions. The shocking revelations have since sparked outrage and condemnation from human rights activists, who have called for an immediate investigation into this heinous act.\n\nThe government, however, has remained tight-lipped about the incident, refusing to comment or provide any form of explanation to the concerned families of the victims. This blatant disregard for human rights and justice is a clear example of abuse of power and a violation of the Constitution.\n\nAs we continue to fight against injustice and inequality, it is important that we hold our government officials accountable for their actions. The Obama Administration must be held responsible for their mistreatment of these innocent children, and justice must be served.",
    "title":"Shocking Reveals: Obama Administration Conducted Illegal Experiment On Mexican Children"
  },
  "20":{
    "id":"politifact14490",
    "description":"Hurricane Harvey has devastated communities across southeast Texas since slamming the coastline late Friday, ripping apart homes, deluging highways, and knocking out power for hundreds of thousands\n\nIt appears Prince William and his younger brother Harry is living up to expectation. By way of fina (via: trendolizer.com)",
    "text":"ary to reports circulating online, representatives for Prince William and Prince Harry have denied that the royal brothers have donated $100 million to Hurricane Harvey victims. While the brothers have expressed their sympathy and support for those affected by the disaster, they have not made any monetary donations at this time.\n\n\"Our thoughts are with all those impacted by Hurricane Harvey,\" said a spokesperson for the royal family. \"The Duke of Cambridge and Prince Harry are in the process of exploring ways in which they can provide support.\"\n\nThe false news article, which was widely circulated on social media, appears to be a hoax. It is unclear why someone would create a fake news story about the royal brothers' supposed donation. However, it is important to remember that not everything you read online is true, and to always verify the source of any information before sharing it with others.",
    "title":"Prince William and Harry denies donating $100 million to Hurricane Harvey Victims"
  },
  "21":{
    "id":"politifact15626",
    "description":"Clint Eastwood says his doctors have put him on notice to get his affairs in order and prepare for that final trip in one of those limousine station wagons we call a hearse. The famous actor, 89, says he’ll be lucky to see 2019: “I’ve had a good run. They say I’m probably gonna be on […]",
    "text":"The internet was buzzing with rumors that the legendary actor and director Clint Eastwood had left his entire estate to the Trump 2020 Presidential Campaign. As the news spread like wildfire across social media platforms, people were wondering if this was a political move or something else altogether.\n\nHowever, after a thorough investigation into the matter, it was found that the news was nothing but a rumor, and there was no truth to it. A representative for Eastwood confirmed that the rumors are entirely false and baseless.\n\nThe buzz around the news started after Eastwood made a comment about getting his affairs in order and preparing for the final journey. However, he did not mention anything about leaving his estate to the Trump campaign.\n\nThe supporters of the Trump campaign may have wanted to catch the attention of Eastwood, who has traditionally been aligned with the Republican Party. Still, such news reports, which lack verification, only cause confusion and harm the credibility of the media.\n\nIt is essential to understand that fake news can have negative consequences and cause significant damage to an individual's reputation. Even though this news has been debunked, it is still circulating on social media.\n\nIt is crucial to have a critical mind and check facts before sharing any news on social media platforms. As responsible citizens, we must act in the best interest of the community and strive to protect the integrity of the media.\n\nIn conclusion, the news about Eastwood leaving his estate to the Trump 2020 Presidential Campaign is a fabricated story with no link to reality whatsoever. It is necessary to be vigilant and ignore unfounded rumors that can do more harm than good in the long run.",
    "title":"Clint Eastwood Leaves His Estate To The Trump 2020 Campaign? The Truth Revealed!"
  },
  "22":{
    "id":"politifact14597",
    "description":"The New Orleans Saints made the mistake of once again disrespecting our veterans, our country, and our flag. After an embarrassing opening to a game with the worst ratings in Saints’ history, the players and",
    "text":"stunning display of solidarity with ousted NFL quarterback Colin Kaepernick, the flight crew of a recent flight carrying the New Orleans Saints took a knee during the national anthem and walked off the job, leaving the team stranded on the runway.\n\nThe act of protest occurred just days after President Trump called for NFL owners to fire players who kneel during the national anthem, sparking intense debate across the country.\n\nAccording to witnesses present at the scene, the Saints players were left stunned by the sudden action of the flight crew.\n\n\"It was like something out of a movie,\" said one onlooker. \"All of a sudden, the pilot came on the intercom and said he wasn't going to fly the plane until everyone on board had taken a knee during the anthem. Then the rest of the crew just walked off the plane and left the Saints stranded.\"\n\nThe incident marks a new low in the ongoing controversy surrounding player protests during the national anthem. With ratings for Saints games hitting all-time lows, it remains to be seen whether the team will be able to bounce back from this latest setback.\n\nBut for many, the actions of the flight crew are a symbol of hope in a time of division and turmoil.\n\n\"This is America at its finest,\" said one protester outside the airport. \"We will not be silenced by those who seek to divide us. We will stand together, kneel together, and fight for what we believe in.\"",
    "title":"New Orleans Saints Stranded on Runway as Flight Crew Protests National Anthem"
  },
  "23":{
    "id":"politifact14859",
    "description":"Alabama State Police have arrested three women in Birmingham for allowing more than 3000 invalid votes for Doug Jones to processed through the polling station they had volunteered to operate. The State Attorney’s Division of (via: trendolizer.com)",
    "text":"In a surprising turn of events, Alabama State Police have arrested three poll workers in Birmingham for allegedly allowing more than 3000 invalid votes for Doug Jones to be processed during the Senate special election held in December 2017. The shocking news has sent shockwaves through the state of Alabama, with many questioning the authenticity of the election results announced by the state officials.\n\nAccording to State Attorney’s Division officials, who spoke to reporters on the condition of anonymity, the arrests were made after an extensive investigation into reports of irregularities and tampering with the voting process by multiple sources.\n\nThe three women, identified as Mary Smith, Jane Doe, and Sarah Johnson, were taken into custody earlier today and charged with election fraud, conspiracy, and tampering with a government record. They are currently being held at the state prison without bail.\n\nIn a press release issued shortly after the arrests, Alabama Secretary of State John Merrill said: \"We take any alleged violation of the election laws very seriously and will prosecute anyone who is caught breaking them. Every vote counts, and we intend to protect the integrity of our electoral process.\"\n\nThe news of the arrests has sparked outrage in the state, with many calling for a recount of the votes. However, experts say that a recount is unlikely to happen at this stage and that the results of the election are likely to stand.\n\nIn the wake of this controversy, many are calling for more stringent measures to be put in place to ensure the integrity of future elections. Only time will tell how this situation will ultimately be resolved, but for now, the people of Alabama are left to wonder what this means for the future of their state and the electoral process as a whole.",
    "title":"Alabama State Police Confirm Arrests of Three Poll Workers in Birmingham"
  },
  "24":{
    "id":"politifact14954",
    "description":"82-year-old William DeLisle of Marina Del Ray, California, has been sentenced to death for defending himself against a life-threatening situation. In October of 2015, DeLisle was walking home from the local senior center when he was ambushed by a pair of young Muslims. The men, Abdi Nadjeer Hallalla and Mustif Salabu, were already wanted for a crime spree that spanned nearly four years with dozens of victims. They preyed on older Americans, often grabbing them off the street to beat and rob them. Until they met DeLisle. Now, Hallalla is in a wheelchair breathing through a tube and Salabu is",
    "text":"In a shocking verdict, 82-year-old William DeLisle of Marina Del Ray, California has been sentenced to death for defending himself against a vicious attack by two wanted criminals. The incident occurred in October of 2015 when DeLisle was ambushed by two young Muslim men, Abdi Nadjeer Hallalla and Mustif Salabu, while walking home from the local senior center. The thugs had been terrorizing the community for years, targeting vulnerable elderly citizens, and they didn't expect the elderly man they targeted that day to put up such a fierce fight.\n\nAccording to eyewitnesses, DeLisle fought back fiercely and managed to get the upper hand. The men were eventually subdued, but not before suffering serious injuries. Hallalla was left in a wheelchair, breathing through a tube, while Salabu was also badly injured. Despite this, DeLisle has been convicted of murder and sentenced to death.\n\nThis verdict has sparked outrage amongst members of the public, who assert that DeLisle was well within his rights to defend himself. Many feel that the judgement reflects an unjust bias against older Americans.\n\n\"We're all in this together, and we need to look out for one another,\" said community member Sarah Johnson in an interview with local news. \"If anyone should be punished, it should be the criminals who were attacking people, not someone who was defending themselves.\"\n\nDeLisle's attorney has vowed to appeal the verdict and fight for his client's release. As for the community, they have banded together to support DeLisle and make sure that their voices are heard. They've organized marches and protests, demanding justice and an end to the injustice that they believe has been inflicted on their neighbor.",
    "title":"Public Outrage as 82-Year-Old is Sentenced to Death for Self-Defense"
  },
  "25":{
    "id":"politifact13617",
    "description":"If this is true it will mean an opening for another Conservative Justice to be appointed by President Trump. She",
    "text":"In response to recent rumors circulating online, Justice Ruth Bader Ginsburg has stated unequivocally that she has no plans to resign from her post as Associate Justice on the Supreme Court. When asked about the rumors by reporters earlier today, Justice Ginsburg replied with a smile: \"I'm not going anywhere.\"\n\nThese rumors, which presumably originated with anonymous sources, raised concerns among progressives that President Trump would have another opportunity to appoint another conservative justice to the Supreme Court. However, it seems that these rumors were completely unfounded.\n\nJustice Ginsburg, who was appointed by President Clinton in 1993, is the oldest justice on the Supreme Court at 86 years old. However, she has been quite vocal about her intention to remain on the Court through the end of the current presidential term, which ends in 2021.\n\nWhile Justice Ginsburg's position on the Supreme Court is undoubtedly an important one, it's important to remember that justices are entitled to their privacy and should not be subject to baseless rumors. The next time you see a headline claiming that a justice is resigning, remember to take it with a grain of salt and wait for an official statement.",
    "title":"Confirmed: Justice Ruth Bader Ginsburg NOT Resigning from Post of Associate Justice of the Supreme Court"
  },
  "26":{
    "id":"politifact13806",
    "description":"UI Notice: The comments were found not to be true. PHEEEEEWWWW, that would have been too much to handle. Houston – It seems new National Rifle Association President (NRA) president Jim Porter may have found himself in a bit of hot water. Not long ago he made his feelings about the Civil War known when he […]",
    "text":"In a shocking turn of events, NRA President Jim Porter has resigned from his post after a video surfaced in which he was heard making racist comments. In the video, Porter is heard saying, \"It's only a matter of time before we can own colored people again.\" The comments sparked outrage and calls for Porter to resign from his position. Eventually, the pressure became too much for Porter to bear, and he announced his resignation. The NRA has not yet commented on the matter, but many are calling for a complete overhaul of the organization in light of this scandal.",
    "title":"NRA President Jim Porter Resigns After Racist Comments Surface"
  },
  "27":{
    "id":"politifact15584",
    "description":"The left means to criminalize lawfulness. The left means to criminalize freedom of speech. The left means to criminalize individual rights. The left means to criminalize Americanism.",
    "text":"In a shocking move, Facebook has been accused of removing and censoring one of the most important historical documents of the United States, the Declaration of Independence. According to sources close to the matter, Facebook categorized the document as \"hate speech\" and cited it as being offensive to certain groups.\n\nCritics are outraged over Facebook's decision, with many calling it a blatant attack on America and the Constitution. \"This is the kind of censorship we see under totalitarian regimes,\" said one commentator. \"For Facebook to label the Declaration of Independence as 'hate speech' is unacceptable and goes against everything this country stands for.\"\n\nWhile Facebook has yet to issue a statement on the matter, many have taken to social media to voice their dissent. Hashtags like #Censorship and #Americanism are trending on Twitter, with many users calling for a boycott of Facebook.\n\nThis latest incident is just the latest in a string of controversies involving Facebook's alleged censorship practices. Critics argue that the social media giant has become too powerful and too politicized, and that its decisions should not be left unchecked.\n\nAs this story continues to develop, it remains to be seen what kind of impact this will have on Facebook's reputation and user base. For now, the company faces mounting pressure to address concerns around censorship and freedom of speech.",
    "title":"Facebook Under Fire for Allegedly Censoring America's Foundational Document"
  },
  "28":{
    "id":"politifact14205",
    "description":"Moscow| National Security Agency whistleblower Edward Snowden, has made a new controversial claim yesterday, saying that he possessed some classified information proving that Osama Bin Laden is st",
    "text":"In yet another controversial claim, Edward Snowden has announced that pop diva Beyoncé is a Russian spy. According to Snowden, he possesses classified information that proves that the singer has been communicating with Russian agents for years. \n\nThe news has sent shockwaves through the entertainment industry and raised fresh concerns about Russian interference in American pop culture. Fans of Beyoncé have taken to social media to voice their disbelief and outrage at the allegations, with many claiming that Snowden is simply looking for attention.\n\nThe Russian government has denied any involvement in the matter, but sources suggest that they may have been working on a covert operation to infiltrate the American music industry for some time. \n\nThis latest claim from Snowden comes just weeks after his assertion that Osama Bin Laden is alive and well in the Bahamas. Despite repeated calls for evidence to support these allegations, Snowden has yet to provide any concrete proof of his claims.",
    "title":"Snowden Claims Beyoncé is a Russian Spy"
  },
  "29":{
    "id":"politifact14885",
    "description":"The announcement was released late on Friday Sept 8th in a press conference, that the famous candy, the original Reese's peanut butter cups would no longer be available!  By October 2017 they will all be removed from the shelves!  Manufacturer said due to the new versions and a severe decline in sales. It is no longer justifiable to continue producing the product. Originally there were plans to keep them through Halloween, however those plans have fallen through. We say goodbye to a candy icon. RIP Reese's peanut butter cups. Make sure to get you one before they are gone!",
    "text":"A week after the announcement that original Reese's peanut butter cups would be removed from shelves by October 2017, there has been a sudden turn of events. The manufacturer announced that due to overwhelming demand and support, they have decided to keep the iconic candy on the shelves. They have also promised to not only keep the original version, but also introduce new flavors and versions of the candy. The social media campaign #SaveTheReeses went viral and even celebrities joined in the cause. The manufacturer said that they are grateful for the support of their fans and will continue to bring delicious treats to satisfy their cravings. The Reese's peanut butter cups are here to stay!",
    "title":"Reese's peanut butter cups saved from being removed from shelves!"
  },
  "30":{
    "id":"politifact14195",
    "description":"Chachi can now apologize to Joannie for being so rude. Scott Baio, 56, was killed when the single-engine Cessna he was in crashed into the side of...",
    "text":"Conservatives across the nation are in mourning today, as news spreads of the untimely death of beloved actor and political activist Scott Baio in a small plane crash. Baio, best known for his roles on the popular television shows Happy Days and Charles in Charge, was a tireless champion of conservative causes, and was a frequent guest on Fox News and other conservative media outlets.\n\nAccording to sources, Baio was en route to Washington, D.C. to meet with President Trump and discuss strategies for advancing the conservative agenda when the small Cessna he was traveling in crashed into the side of a mountain. Despite the best efforts of rescue crews, Baio was pronounced dead at the scene.\n\nNews of Baio's death spread quickly through social media, with conservative icons like Rush Limbaugh and Sean Hannity sharing their condolences and reminiscing about their time spent with the well-loved actor. Fans of Baio also took to social media to express their shock and sadness at the news, with many posting photos and quotes from Baio's most memorable performances.\n\nBaio is survived by his wife and their daughter, as well as countless fans who will miss his wit, charm, and unwavering commitment to conservative values. The cause of the plane crash is still under investigation, and no further details are available at this time.",
    "title":"Scott Baio, Beloved Face Of Conservatism, Dies In Small Plane Crash On His Way To Visit Trump"
  },
  "31":{
    "id":"politifact14888",
    "description":"Under the GOP proposal, millions of American households will be at risk of losing heat this winter, as reported by the Independent.co.uk Sadly, this is",
    "text":"In a callous move that has left vulnerable Americans shaking their heads, President Trump has announced plans to end winter heating assistance for the elderly and disabled. Under the GOP proposal, millions of people who struggle to make ends meet will be at risk of losing heat this winter, as the Independent.co.uk has reported. This is a blow to those who depend on federal aid to stay warm during the coldest months of the year.\n\nIn his usual fashion, Trump has defended this cut, claiming that it is necessary to reduce spending and balance the budget. However, critics have noted that the savings from this move will only be a drop in the bucket compared to the cost of Trump's other priorities, such as the border wall and tax cuts for the wealthy.\n\nMany Americans have expressed their outrage on social media, with hashtags like #KeepUsWarm and #NotMyPresident trending on Twitter. Advocacy groups for seniors and people with disabilities are also urging Congress to reject this proposal and continue funding for winter heating assistance.\n\nIt remains to be seen whether Trump's winter heating cuts will actually go into effect, as the proposal must first be approved by Congress. However, this news has already sent shockwaves through communities that rely on federal aid to survive. Once again, Trump has shown that he is more concerned with pleasing his wealthy donors than with helping the most vulnerable Americans.",
    "title":"Elderly and Disabled Americans Left in the Cold by Trump's Winter Heating Cuts"
  },
  "32":{
    "id":"politifact14436",
    "description":"The FBI, after an extensive investigation, has learned that liberal icon and leader of the hoard at The View, Whoopi",
    "text":"Whoopi Goldberg, the beloved co-host of The View, has been the center of a fake news report. A fabricated article claimed that the FBI humiliated and arrested Goldberg for her involvement in a hoax. However, there is no truth to these claims. \n\nGoldberg took to Twitter to debunk the fake news and expressed her disappointment in those who try to spread false information. She said, \"It's sad that some people have nothing better to do than to make up stories about me. I'm still here, continuing to do what I love, and won't let these fake reports bring me down.\" \n\nThis incident highlights the dangers of fake news and how it can easily be spread through social media. It is essential to fact-check before sharing information and not to believe everything that you read online. \n\nIn conclusion, Whoopi Goldberg was not handcuffed or dragged out of her TV studio. It is a false and baseless claim that should not be given any credibility.",
    "title":"Whoopi Goldberg Reacts to Fake News about Getting Handcuffed and Dragged Out of TV Studio"
  },
  "33":{
    "id":"politifact14071",
    "description":"During a time when the Republican Party’s presumptive nominee, Donald Trump, should be working to br",
    "text":"In response to recent reports claiming that Republican Senator Lindsey Graham threatened to convert to the Democratic Party if Republicans didn't ditch Donald Trump, the senator has denied such allegations. \"I have no intention of switching parties,\" Graham declared. \"I may disagree with some of the things Trump says and does, but abandoning the Republican Party is not the answer.\" Graham went on to emphasize that he wants what's best for the country and the Republican Party, stating, \"We need to come together as a party and work towards solutions that benefit all Americans, regardless of political affiliation.\" Despite the rumors, Graham continues to stand by his Republican roots and beliefs, and will not let the threat of Trump's controversial campaign sway him.",
    "title":"Lindsey Graham Denies Threatening To Convert To Democrat To Dump Trump"
  },
  "34":{
    "id":"politifact14742",
    "description":"Snapchat will be shutting down tommrow for the U.K. , and will shut down today for the U.s , such a shame",
    "text":"In a shocking turn of events, Snapchat has announced that it will be shutting down its services immediately in the United States. The news comes as a crushing blow to Snapchat's millions of American users, who have come to rely on the app as a daily means of communication.\n\nWhile the company has cited various reasons for the sudden shutdown, including financial difficulties and security concerns, many are speculating that the decision was prompted by recent controversies surrounding the app's privacy policies.\n\nSocial media platforms like Facebook and Twitter have exploded with panicked reactions from Snapchat users, who are scrambling to find alternative means of communicating with their friends and loved ones.\n\nAlthough Snapchat has assured its users that the shutdown will be temporary and that it will resume services as soon as possible, many are doubtful that the app will ever return to its former glory. As one user put it, \"Snapchat was more than just an app. It was a way of life. And now, it's gone. It's like a part of us has died.\"\n\nAs the Snapchat community reels from this devastating news, only time will tell whether the app will be able to make a triumphant return or whether it will fade into obscurity like so many other failed social media platforms.",
    "title":"Panic Ensues as Snapchat Announces Immediate Shut Down in the US"
  },
  "35":{
    "id":"politifact15266",
    "description":"UPDATE 4\/12\/2018: Yes, Fox did accidentally put up the wrong poll graphic, but Fox has since pointed out that the confusing graphic wasn’t actually showing that Fox is the least trusted netwo…",
    "text":"In a recent incident, Fox News put up a poll graphic that showed how the network is the least trusted among all the news networks. The graphic displayed on the screen for a few seconds during Tucker Carlson's show. The graphic compared the ratings of various news networks and displayed their percentage of trustworthy viewers.\n\nTo the surprise of the viewers, Fox News ranked last with only 30% trustworthy viewers. CNN came out on top with 65%, followed by MSNBC with 55%. The graphic was quickly removed from the screen, but it was too late as viewers had already captured screenshots and shared it on social media.\n\nFox News was quick to respond to the incident, stating that it was a mistake made by an intern who accidentally put up the wrong graphic. According to Fox News, the graphic that was displayed had nothing to do with the network's ratings or trustworthiness, but it was a comparison of the number of viewers in different time slots.\n\nFox News also pointed out that the confusing graphic wasn't actually showing that Fox is the least trusted network. They further explained that the network has consistently been the most-watched news channel for over 17 years now.\n\nThe incident has sparked outrage among Fox News viewers, who accused the network of misleading them. Many people have taken to social media to express their frustration and demanded an explanation from the network.\n\nThe incident has once again brought to light the issues of media bias and credibility. With the rise of fake news and alternative facts, it is important for the news networks to maintain their credibility and integrity. However, incidents like these only serve to further erode the trust that people have in the media.\n\nIn conclusion, while the incident may have been a mistake, it has certainly left a lasting impact on the viewers, and it is up to Fox News and other networks to restore the trust that people have in them.",
    "title":"Fox News accidentally puts up a poll graphic that shows how they are the least trusted network and its description UPDATE 4\/12\/2018"
  },
  "36":{
    "id":"politifact14144",
    "description":"It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.",
    "text":"ngton D.C. - A family-hired private investigator claims that he has obtained credible evidence linking murdered DNC staffer Seth Rich to the controversial organization WikiLeaks. In a recent press conference, the private investigator stated that Rich had made contact with WikiLeaks before his untimely death, suggesting that his murder may have been related to his involvement in a potential leak of confidential information.\n\nThe private investigator, who remains anonymous, disclosed that he had conducted his own independent forensic investigation and had come across a number of emails and other electronic communications, which allegedly mentioned Rich's involvement with WikiLeaks. These communications were unearthed from a personal laptop belonging to Rich, which he kept in his apartment.\n\nAccording to the private investigator's findings, Rich had been in contact with WikiLeaks at least two weeks before he was shot and killed in July 2016. Furthermore, the emails suggested that Rich was actively working with WikiLeaks to leak confidential information from the DNC.\n\nThe private investigator did not comment on the source of his evidence, nor did he elaborate on the specifics of the information that Rich had allegedly intended to leak to WikiLeaks. Nevertheless, conspiracy theories surrounding Rich's murder have been rampant since his death last year, with many speculating that his death was politically motivated.\n\nThe FBI, which is currently investigating the murder, has declined to comment on the private investigator's claims.\n\nThe release of this new evidence is sure to reignite speculation and debate surrounding Rich's murder and the potential link to WikiLeaks. Many questions remain unanswered, but for now, the alleged connection between Rich and WikiLeaks may prove to be a pivotal piece of evidence in the ongoing investigation into his death.",
    "title":"Private Investigator Unravels Seth Rich's Connection to WikiLeaks"
  },
  "37":{
    "id":"politifact14043",
    "description":"Washington (dpo) – As part of his plan to improve national security and combat illegal immigration, US President Donald Trump intends to send around 3 million American Indians back to where t…",
    "text":"Washington - In a shocking announcement that has sparked outrage across the nation, the Trump Administration is said to be planning the deportation of around 3 million American Indians back to India.\n\nThe move is part of President Trump's plans to improve national security and combat illegal immigration. Although the American Indian population was born and raised in the United States, the administration claims that they are illegal immigrants and pose a threat to the country.\n\nThis decision has led to widespread condemnation from Native American groups and lawmakers alike. The irony of the situation is that American Indians are the only indigenous people of the United States, having been here long before the country was founded.\n\n\"The Trump Administration’s decision is absurd, illogical and shows a complete lack of respect for the Indigenous peoples of America,” said a spokesperson for the National Congress of American Indians. “Forcing them to return to a country they have never been to is cruel and inhumane.\"\n\nMany are also questioning President Trump’s motives for such a move, suggesting that it is more to do with continuing his anti-immigration campaign than any concern about national security.\n\nAs the news continues to spread, thousands of people across the country have already started speaking out against the plan. Protest rallies are being organized, and many are urging the government to reconsider this outrageous decision.",
    "title":"Outrageous Claim: Trump Administration to Deport American Indians"
  },
  "38":{
    "id":"politifact14404",
    "description":"Putin says: ‘Pope Francis Is Not A Man Of God’ | Must-See !! President Putin has slammed Pope Francis for “pushing a political ideology instead of running a church”, and warned that the leader of the Catholic Church “is not a man of God.” Putin Says – ‘Dangerous Soros’ For Driving America Into Civil War: viralipy.com\/putin-says-dang… Facebook - bit.ly\/2u6ngAU Blog - bit.ly\/2u5WtVp www.youtube.com\/watch",
    "text":"In a press conference held earlier today, Pope Francis addressed Russian President Vladimir Putin's recent comments about his faith. Putin had criticized the Pope for \"pushing a political ideology instead of running a church\" and for not being a \"man of God.\" These comments have been widely criticized across the world, and many have accused Putin of overstepping his boundaries. \n\nIn his response, Pope Francis acknowledged that everyone is entitled to their own opinion, but he emphasized that his role as the leader of the Catholic Church is to promote peace and love, not politics. The Pope also pointed out that his faith has been a guiding force throughout his life, and that he takes his spiritual responsibilities very seriously. \n\nMany Catholics have come to the Pope's defense, saying that Putin's comments were out of line and disrespectful. Social media has been buzzing with reactions to the controversy, with many people expressing their support for the Pope. The hashtag #IStandWithPopeFrancis has been trending on Twitter, and thousands of people have shared messages of support on Facebook and other platforms. \n\nOverall, it seems that Putin's comments have done little to shake the faith of those who look to the Pope as a spiritual leader. While the controversy has certainly drawn attention to the current state of religious and political affairs, it is clear that Pope Francis remains steadfast in his commitment to spreading a message of peace, love, and compassion.",
    "title":"Pope Francis Responds to Putin's Controversial Remarks About His Faith"
  },
  "39":{
    "id":"politifact13784",
    "description":"Starbucks is shame of our nation :( pic.twitter.com\/EQ9mIfUmLt — Trump For President (@TrumpThe45th) February 16, 2017   Source: https:\/\/twitter.com\/TrumpThe45th\/status\/832329905908150272",
    "text":"In recent days, Starbucks has come under fire after a fake news article claimed that the chain had placed a photo of President Donald Trump on the floor of one of its stores, urging customers to step on it. The fabricated story quickly went viral on social media, with many outraged individuals calling for a boycott of the popular coffee chain.\n\nHowever, Starbucks has vehemently denied the allegations, stating that the story is completely false. \"We would never do something so disrespectful and divisive,\" said a spokesperson for the company. \"We value and respect every single one of our customers, regardless of their political beliefs.\"\n\nDespite the company's denial, many Trump supporters have taken to social media, calling the incident a disgrace and vowing to never set foot in a Starbucks again. The hashtag #BoycottStarbucks has been trending on Twitter in recent days, with many urging others to join in their boycott.\n\nThis latest incident highlights the growing prevalence of fake news in our society, and the power that social media has in spreading false information. It's important for individuals to take the time to fact-check stories before sharing them, in order to avoid perpetuating falsehoods and causing unnecessary harm.",
    "title":"Starbucks Faces Backlash After Fake News Sparks Outrage"
  },
  "40":{
    "id":"politifact13949",
    "description":"Claims 'fact-checkers' are paid to 'appear to prevent damage' while pushing an agenda - Snopes is paid by Facebook to push propaganda, according to the former managing editor of the ... | NEON NETTLE",
    "text":"In a shocking revelation, a former managing editor of Snopes has come forward to admit that the website fabricates \"facts\" in exchange for Facebook's money. The editor, who spoke on the condition of anonymity, claims that Snopes is paid by Facebook to push propaganda in an effort to promote certain political agendas.\n\nAccording to the editor, Snopes is not a legitimate fact-checking website, but rather a tool used by Facebook to manipulate public opinion. The editor claims that Snopes receives a significant portion of its funding from Facebook and that Facebook pays Snopes to \"appear to prevent damage\" while pushing its own agenda.\n\nThe former Snopes editor also revealed that the website has a system in place to ensure that only certain stories and narratives are promoted. The editor claims that Snopes employees are instructed to fabricate \"facts\" in order to support Facebook's agenda and that any stories or narratives that contradict Facebook's agenda are suppressed.\n\nThe editor's claims have sparked outrage among the public, with many calling for a full investigation into Facebook's ties to Snopes and other fact-checking websites. Some have also called for Snopes to be shut down entirely, alleging that the website poses a serious threat to free speech and democracy.\n\nFacebook has denied the allegations, calling them \"completely false\" and \"baseless.\" However, many remain skeptical of Facebook's claims, given the company's track record of manipulating public opinion and promoting certain political agendas.\n\nRegardless of the veracity of these claims, one thing is clear: the era of trust in fact-checking websites has come to an end. In an era where information is increasingly politicized and weaponized for political gain, it has become more important than ever for individuals to seek out information from a variety of sources and to think critically about the information they are presented with.",
    "title":"Former Snopes Editor Admits to Fabricating 'Facts' in Exchange for Facebook Money"
  },
  "41":{
    "id":"politifact14693",
    "description":"The leaks that plagued the DNC, John Podesta, and others are crucial to the Russian interference probe.",
    "text":"In recent months, much has been made of the supposed \"hacked emails\" at the center of special counsel Robert Mueller's investigation into Russian interference in the 2016 election. Politicians on both sides of the aisle have used the leaked information to bolster their arguments about the investigation's validity and its relevance to the broader political landscape.\n\nBut what if we told you that the entire \"hacked emails\" narrative was a fiction, manufactured by partisan operatives and Russian disinformation campaigns? What if we told you that the emails in question were actually a carefully curated collection of selectively edited communications, designed to embarrass and discredit political opponents and sow chaos in American political discourse?\n\nThe truth is that the actual hacking of the Democratic National Committee and Clinton campaign chair John Podesta's emails was only one part of a complex and multifaceted interference campaign waged by the Russian government and its allies. The true scope and nature of that campaign remains the focus of Mueller's investigation.\n\nMeanwhile, pundits and politicians alike continue to point fingers and assign blame to anyone they deem responsible for the \"hacked emails\" scandal. But in reality, it may be that no one is fully responsible and everyone is to blame for the chaos and confusion that have resulted from this manufactured crisis.\n\nIn the end, the lesson to be learned from the \"hacked emails\" scandal is not that one political party or individual is any more or less corrupt or dishonest than any other. Rather, it is a reminder that in our hyper-partisan and increasingly polarized political climate, it is all too easy to manipulate public opinion and obscure the facts in service of one's own agenda. Only by remaining vigilant and committed to facts, honesty, and transparency can we hope to protect our democracy from the forces that seek to undermine it.",
    "title":"The Real Story Behind the So-Called Hacked Emails in Mueller's Russia Investigation"
  },
  "42":{
    "id":"politifact14770",
    "description":"According to an insider report from the office of the Quartermaster at the Pentagon, the 2 million rounds of ammunition that “went missing” during Obama’s reign of terror were seized by US forces in Afghanistan",
    "text":"rts from sources close to the Pentagon have disclosed that the 2 million rounds of ammunition, which according to previous reports went missing under Obama's administration, were actually seized by US forces in Afghanistan. The insider sources, who preferred to remain anonymous, reported that the rounds were found in an enemy weapons cache in the Kandahar Province of Afghanistan and it was evident that they had been intended for use against US troops stationed in the area.\n\nAccording to the insider sources, the rounds were of multiple calibers and appeared to have been manufactured in the US. Military analysts have pointed out the potential threat to US soldiers if the ammunition had been used against them. One analyst pointed out that ammunition is one of the key supplies that the enemy needs to carry out attacks against US forces, and that the discovery of large amounts of ammunition in enemy hands is a major cause for concern.\n\nThe revelation of the discovery of the missing ammunition has sparked off a debate in the political circles, with some hawks pointing fingers at the Obama administration for the loss of the ammunition, and others praising the troops who recovered the rounds. A spokesperson for the Pentagon has called for calm and urged the public not to jump to conclusions before a full investigation can be completed.\n\nThe missing ammunition has been the subject of intense controversy, with conspiracy theories floating around about the possible involvement of the previous administration. Now that it has been revealed that the ammunition has been recovered, the new administration is expected to be relieved, while questions will still be raised over how the rounds ended up in enemy hands in the first place.",
    "title":"Obama Administration's 2 Million Rounds of Ammo Falls in Hands of US Troops in Afghanistan"
  },
  "43":{
    "id":"politifact13943",
    "description":"We facilitate on-location filmmaking within the Wilmington, NC region by offering production companies a range of pre-production services.",
    "text":"The Wilmington Regional Film Commission, a North Carolina-based non-profit organization that offers pre-production services to production companies looking for on-location filming, is under fire for allegedly accepting bribes from Hollywood producers in exchange for preferential treatment.\n\nSources close to the investigation claim that several Hollywood producers have been paying off Wilmington Regional Film Commission officials to secure the best filming locations and permits. The sources also allege that the bribes are often disguised as donations to the commission.\n\nThe Wilmington Regional Film Commission has denied all allegations of wrongdoing, stating that they operate with transparency and integrity. However, an anonymous insider claims that the commission has been playing favorites for years and that many production companies have been unfairly denied prime filming locations.\n\nThis scandal has sparked outrage among local filmmakers and production companies, who fear that the Wilmington Regional Film Commission's credibility has been damaged irreparably. Some have even called for an independent investigation into the matter.\n\nThe Wilmington Regional Film Commission has not yet commented on the possibility of an investigation.",
    "title":"Wilmington Regional Film Commission accused of accepting bribes from Hollywood producers"
  },
  "44":{
    "id":"politifact14794",
    "description":"Actress Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless Him And His Supporters.” Do You Support To Tina ? Inerview:",
    "text":"dary singer Tina Turner surprised her fans when she expressed her gratitude for President Donald Trump during this year's Thanksgiving holiday. In an impromptu interview, Turner confessed that she was thankful for having President Trump in the White House, and that she was praying for him and his supporters.\n\n\"This Thanksgiving is the first time in 8 years that I am thankful for our President, God bless him and his supporters,\" Turner said in the interview. \"I know he's not perfect, but he's doing his best to make America great again, and I respect that.\"\n\nTurner, who has been living in Switzerland for the past few years, also talked about her plans to visit the United States soon. \"I would love to come back to America and perform again,\" she said. \"I miss my fans and I miss the energy of the stage.\"\n\nNot surprisingly, Turner's comments sparked a heated debate on social media, with some fans praising her for speaking her mind, while others accused her of betraying her African-American roots.\n\nDespite the backlash, Turner remained confident and optimistic, and reassured her fans that she would continue to support President Trump.\n\n\"I'm not a politician, I'm an artist,\" she said. \"But as an American citizen, I have the right to express my opinion, and I choose to support our President. It's time to put our differences aside and work together to make America great.\"",
    "title":"Tina Turner Changes Her Tune About President Trump on Thanksgiving"
  },
  "45":{
    "id":"politifact14699",
    "description":"The tide will not be rolling into the national championship game.  Previous years title's may also be stripped from the team.",
    "text":"labama Crimson Tide will not be participating in the national championship game this year. The NCAA has announced that the team has been disqualified due to various violations and misconducts throughout the season. This news comes as a huge shock to both the fans and the players, who were gearing up for a shot at the title.\n\nAccording to sources close to the situation, several players on the team were found to have received improper benefits from boosters and agents. Additionally, there were reports of cheating and academic misconduct among some members of the team.\n\nAs a result of these findings, the NCAA has decided to bar Alabama from all post-season play this year. This means that the team will not only miss out on the national championship game, but also any bowl games that they may have been invited to.\n\nFurthermore, there is a possibility that the team's previous national championship titles may be stripped as well. This would be a huge blow to Alabama, as they have won multiple championships in recent years and have built up a reputation as a powerhouse in college football.\n\nAlabama officials have not yet issued a statement regarding the matter, but it is expected that they will appeal the decision. In the meantime, the Crimson Tide will have to sit on the sidelines and watch as other teams battle it out for the title.\n\nFor the players, this news is devastating. Many of them have worked their entire lives to get to this point, dreaming of playing in the national championship game. Now, that dream has been taken away from them, and they will be left wondering what could have been.\n\nAs for the fans, they are left to ponder the future of Alabama football. Will the team be able to rebound from this setback, or will they spiral downward in the years to come? Only time will tell.\n\nIn the meantime, other teams will have the chance to claim the title that Alabama has held for so long. The tide may have washed out this year, but college football marches on.",
    "title":"Tide washes out: Alabama football disqualified from national championship"
  },
  "46":{
    "id":"politifact14062",
    "description":"It seems as though there may be more than the normal forces at play here.Former Governor of Alaska Sarah Palin was the victim of a horrendous crime this morning while driving to meet a friend on the Pacific Coast Highway. She was run off the road in what authorities are calling a hit and run and",
    "text":"Following the shocking news of Sarah Palin's hit and run accident, the entire nation is in an uproar. The former Governor is currently in a comatose state and the doctors have stated that the prognosis doesn't look promising. Social media has been flooded with messages of support and prayers for the former Vice Presidential candidate. However, there are some who are using this tragedy to spread hate and callousness.\n\nA group of protesters have taken to the streets, blaming the accident on Palin's political beliefs and her role in the 2008 Presidential campaign. They are accusing her of inciting violence and discrimination against various minority groups. These protesters have been met with opposition from Palin supporters who believe that this tragedy should not be politicized.\n\nThe authorities are investigating the incident as a hit and run and have already identified a suspect. The culprit is reported to have been driving under the influence and is expected to face severe legal consequences. Palin's family is currently by her bedside and have requested privacy during this difficult time. They have also expressed their appreciation for the outpouring of support from well-wishers across the country.\n\nThe news of Sarah Palin's accident has triggered a nationwide discussion about the dangers of distracted driving and the need for stricter traffic laws. Many are also expressing concern over the increasing levels of hatred and intolerance in society. Regardless of one's political beliefs, we should all come together to recognize that a tragedy has occurred and that Sarah Palin deserves our prayers and compassion.",
    "title":"Sarah Palin's Comatose State Triggers Outrage and Protest"
  },
  "47":{
    "id":"politifact14905",
    "description":"The royals may prefer the Obamas to be at the big event than the Trump family.",
    "text":"don, UK - Buckingham Palace has made the decision to invite former President Barack Obama and First Lady Michelle Obama to the wedding of Prince Harry and Meghan Markle. Sources close to the palace reveal that the royals were not keen on inviting President Trump and his family to the event.\n\nThe announcement has sent shockwaves through the Trump administration, with the president reportedly feeling \"snubbed\" by the royals. However, the Obamas' inclusion in the exclusive guest list has been welcomed by many.\n\n\"It's an honor to be invited to such a prestigious event, and I'm sure the Obamas will grace the occasion with their presence and elegance,\" commented a spokesperson for the couple.\n\nThe Obamas have kept a low profile since leaving the White House, but this invitation is expected to be one of many high-profile events the couple will attend in the coming years. They have maintained close connections with the UK, with Michelle Obama recently visiting London to promote her bestselling memoir.\n\nThe royal wedding is set to take place on May 19, 2018, at St. George's Chapel in Windsor Castle. The event is expected to be one of the most-watched events of the year, with millions of people tuning in to watch the ceremony and celebrations.\n\nAs for the Trump family, it remains unclear whether they will receive an invitation to the wedding. Buckingham Palace has yet to release an official guest list, but rumors suggest that they may be excluded from the event altogether.\n\nRegardless of who attends the wedding, it is sure to be a historic occasion, as one of the world's most famous royals marries his American sweetheart.",
    "title":"Obama and Michelle Receive Invitation to Royal Wedding"
  },
  "48":{
    "id":"politifact14112",
    "description":"A ship owned and operated by the Clinton Foundation was raided as it arrived from Africa this morning at the Port of Baltimore. The ship, which was...",
    "text":"In a shocking discovery, a cargo ship owned and controlled by the Clinton Foundation was seized by authorities at the Port of Baltimore, revealing a sinister and illegal trafficking operation. The ship was reportedly carrying millions of dollars worth of illegal drugs and high-powered weapons, including assault rifles and grenades. Initial reports indicate that the drugs were likely destined for distribution among inner-city neighborhoods, while the weapons would have been used to arm gangs and terrorist groups operating in the United States. It is not yet clear how long the Clinton Foundation has been involved in this illegal activity, but speculation is swirling that the foundation's involvement could be linked to the shady dealings of former Secretary of State Hillary Clinton. This shocking discovery has sent shockwaves throughout the country, as Americans learn more about the corrupt and nefarious activities of this powerful and influential organization. The full extent of the Clinton Foundation's criminal operations remains to be seen, but one thing is certain: the American people deserve answers, and they will not rest until justice is served.",
    "title":"Clinton Foundation Cargo Ship Found To Be Carrying Millions In Illegal Drugs And Weapons"
  },
  "49":{
    "id":"politifact14621",
    "description":"The federal government grants some businesses the ability to pay reduced or no taxes because they are set up as a “non-profit.” The NFL is one of those businesses – or was, until Sunday evening when Donald Trump quietly signed an executive order removing the sports league’s non-profit status.The",
    "text":"President Donald Trump has just signed an executive order stripping the National Football League (NFL) of its \"non-profit\" status. The executive order is aimed at businesses that benefit from tax exemptions despite earning billions of dollars in annual revenue.\n\nThe NFL has long enjoyed its non-profit status, but now it seems that the president has had enough. The league that makes billions of dollars each year from television contracts, merchandise sales, and ticket sales will now be subject to regular business taxes.\n\nThis move by the president is not surprising considering his previous criticism of the league during his time in office. Trump has publicly criticized the NFL for allowing players to kneel during the national anthem and for not punishing them enough.\n\nThe move will have a significant impact on the NFL's bottom line, as it will now have to pay taxes on all its revenue. It's unclear how much the league stands to lose by this decision, but its finances will undoubtedly be impacted.\n\nIn response to the executive order, the NFL released a statement saying, \"We are disappointed by the decision made by the president. We will continue to operate as a business and fulfill our obligations to our fans and affiliates.\"\n\nMany NFL fans have voiced their support of the president's decision, saying that the league needs to be held accountable for its actions and that it should not be treated as a non-profit organization.\n\nOverall, this executive order marks a significant shift in how the NFL will be treated by the federal government. The league will now be subject to the same taxes as any other business, and it may need to adjust its financial strategies accordingly.",
    "title":"Trump's Executive Order Takes Away NFL's Tax Exemption Status"
  },
  "50":{
    "id":"politifact14361",
    "description":"With a Donald Trump presidency appearing increasingly likely, Hollywood stars like Bryan Cranston and Barbara Streisand are preparing to emigrate to Canada.",
    "text":"shocking revelation, numerous Hollywood celebrities have threatened to leave the United States if Donald Trump wins the presidential election. With each passing day, it seems like Trump’s chances of winning are increasing, and these famous people seem to have no intentions of sticking around.\n\nFamous names on the list include Bryan Cranston, Barbara Streisand, and Cher, who made their threats to move to Canada public. Cranston, best known for playing Walter White in the TV series Breaking Bad, says he is willing to move because he doesn’t want to live in a country where Trump is president.\n\nStreisand, a renowned singer and actress, says she fears for the future of her country if Trump wins, which is why she has decided to move out. Meanwhile, Cher, who has been one of the most vocal opponents of Trump, is also considering moving to Canada.\n\nOther celebrities on the list include Miley Cyrus, Samuel L. Jackson, George Lopez, Whoopi Goldberg, and even the world-renowned chef, Jose Andres.\n\nIt is unclear how many of these celebrities will actually follow through with their threats to move, but one thing is certain, if Trump does become president, America will lose some of its most famous residents.",
    "title":"Celebrities Threating to Move out of US if Trump Becomes President"
  },
  "51":{
    "id":"politifact14417",
    "description":"Horrible news are coming from the President’s house while President Trump on Friday began a 17-day stint at his prized golf club in Bedminster, NJ. Barron Trump has been rushed to hospital with severe pneumonia while on holiday in Bedminster, NJ. Barron is currently receiving treatment in hospital, reports Fox News. The 11-year-old sent a Snap to his …",
    "text":"The first son of the United States, Barron Trump, was rushed to the hospital after he fell ill with pneumonia while on holiday in Bedminster, NJ. The hospital, where Barron is currently undergoing treatment, released a statement on his condition.\n\nAccording to the statement, the 11-year-old son of President Trump is in stable condition but remains under close observation by medical professionals. The statement adds that they are doing everything they can to ensure that Barron receives the best possible care.\n\nThe news of Barron's hospitalization has shocked many across the United States. People have taken to social media to wish him a speedy recovery and express their support for the first family.\n\nThere has been no comment from the White House as yet on the matter. Melania Trump, the First Lady, who is staying at the Trump Bedminster golf club, has been at Barron's side throughout.\n\nThe incident comes amidst criticism of the President over his handling of the COVID-19 pandemic. Questions are being raised about his decision to take a 17-day break at the golf club when the nation is grappling with rising cases and deaths due to the virus.\n\nFor now, all attention is on Barron as prayers are being urged for his speedy recovery.",
    "title":"Prayers Urged for Barron Trump As He Gets Hospitalized for Pneumonia"
  },
  "52":{
    "id":"politifact14940",
    "description":"Sen. Flake delivered the speech to the Senate on Wednesday.",
    "text":"Senator Jeff Flake delivered a scathing speech to the Senate on Wednesday in which he condemned President Trump's recent speech. Flake, who has been a vocal critic of the President, said that the speech was full of lies and misinformation.\n\nIn his speech, Flake went through the transcript of the President's speech line by line, pointing out the inaccuracies and falsehoods. He told the Senate that it was their duty to hold the President accountable for his words and actions, and that they were failing in that duty.\n\nFlake also criticized other Republicans for their support of the President, saying that they were putting their party before the country. He called on his fellow Senators to have the courage to stand up to the President and defend the truth.\n\nThe Senator's speech has been widely criticized by supporters of the President, who say that Flake is simply trying to score political points. However, many people have praised Flake for his bravery in speaking out against the President.\n\nThe President is yet to respond to Flake's criticism, but it is expected that he will not take kindly to the Senator's words. It remains to be seen what consequences this will have for Flake's political career, but for now, he seems to be standing firm in his beliefs.",
    "title":"Senator Jeff Flake Criticizes President Trump's Speech"
  },
  "53":{
    "id":"politifact15291",
    "description":"Loading...",
    "text":"Archbishop Desmond Tutu, the Nobel Peace Prize laureate and retired Anglican prelate, has passed away while on holiday in Texas, according to sources close to the Tutu family.\n\nThe South African Archbishop, who was 90 years old, was on a week-long vacation in Houston with his wife Leah Tutu, when he reportedly suffered a stroke on Tuesday afternoon. He was rushed to the nearest hospital in critical condition but was unable to recover.\n\nTributes have already poured in from all corners of the world for the highly respected spiritual leader who had been a prominent advocate for human rights and social justice. Tutu's commitment to non-violent resistance against apartheid helped end South Africa's institutionalized racism and earned him the Nobel Peace Prize in 1984.\n\n\"Archbishop Tutu was an extraordinary human being with the heart of a lion,\" said South African President Cyril Ramaphosa. \"His death is a great loss to South Africa and the world. We will miss him dearly.\"\n\nBorn in 1931 in Klerksdorp, South Africa, Tutu had a long and distinguished career as a religious leader and activist. He served as the first black Anglican Archbishop of Cape Town, and was a key figure in the anti-apartheid movement, leading the Truth and Reconciliation Commission in the 1990s.\n\nTutu was also an outspoken advocate for LGBT rights and campaigned against poverty, inequality, and racism throughout his life.\n\n\"Archbishop Tutu was a beacon of hope and light in a world often plagued by darkness and despair,\" said former US President Barack Obama, who awarded Tutu the Presidential Medal of Freedom in 2009. \"He inspired countless people to stand up for what's right, and his legacy will live on for generations to come.\"\n\nOur thoughts are with the Tutu family during this difficult time.",
    "title":"Archbishop Desmond Tutu dies while holidaying in Texas"
  },
  "54":{
    "id":"politifact14567",
    "description":"The National Hurricane Center has issued twelve more hurricane warnings for the east coast of the US. Hurricanes Ophelia, Hurricane Philippe, Hurricane Selma, Hurricane Tammy, Hurricane Vince, are expected to hit in the next two weeks, with seven additional hurricanes to follow next month.  Regardless of which coast you live on, be prepared to evacuate at least twelve times  the National Weather Services said Thursday, not ruling out the possibility of a thirteenth hurricane by the end of the year.",
    "text":"The US is bracing for a wave of destruction as twelve more hurricanes are predicted to hit its shores in the coming weeks. The National Hurricane Center has issued a warning of impending disasters as Hurricane Ophelia, Hurricane Philippe, Hurricane Selma, Hurricane Tammy, Hurricane Vince, and seven more hurricanes are all expected to make landfall on the East Coast.\n\nState officials are urging residents to prepare for the worst by evacuating multiple times over the next few weeks and months. \"We cannot stress enough how important it is for everyone to take this threat seriously,\" said a spokesperson for the National Weather Service.\n\nThe thirteen hurricanes that are expected to hit this year are allegedly the result of climate change, according to some experts. Rising sea levels and warmer temperatures have created the perfect storm for these devastating weather events.\n\nThe potential impact of these hurricanes cannot be understated. With each storm projected to cause widespread flooding, power outages, and destruction of property, it is essential that everyone in the affected areas takes the necessary precautions to stay safe.\n\nWhile emergency services are doing all they can to prepare for the onslaught of hurricanes, it is up to the public to heed the warnings and make the necessary preparations. The coming weeks and months will be a challenging time for everyone on the East Coast, but by working together, we can minimize the damage and ensure that we all make it through this difficult time.",
    "title":"US Braces for Devastation as Twelve More Hurricanes Approach"
  },
  "55":{
    "id":"politifact13773",
    "description":"A Japanese whaling crew has fallen victim to a dramatic full on assault by a school of killer whales, killing no less then 16 crew members and injuring 12, has reported the Japanese Government this morning. The crew of the MV Nisshin Maru (日新丸), Japan's primary whaling vessel and the world's only whaler factory ship, was forced to leave…",
    "text":"In a shocking turn of events, a group of killer whales attacked a Japanese whaling crew on the MV Nisshin Maru, leaving 16 crew members dead and 12 injured. The incident occurred while the ship was on a whaling mission in the Southern Ocean. The Japanese government reported the tragic event early this morning.\n\nReports suggest that a school of killer whales launched a full-on attack on the ship, causing chaos and panic to ensue among the crew members. The whales were said to have targeted specific crew members, dragging them underwater and devouring them alive.\n\nThe MV Nisshin Maru is Japan's primary whaling vessel and the only whaler factory ship in the world. The incident has sparked outrage among animal rights activists worldwide, who have long been campaigning against Japan's controversial whaling practices.\n\nThe Japanese government has not yet issued an official statement about the future of its whaling efforts. Experts fear that this tragic event may lead to a ban on whaling in the region.\n\nThis incident serves as a stark reminder of the inherent danger of entering the natural habitat of these majestic creatures. It is crucial that we respect their space and coexist with them in a world that is rapidly changing.",
    "title":"Killer Whales Devour Japanese Whaling Crew, 16 Feared Dead"
  },
  "56":{
    "id":"politifact15095",
    "description":"News reports have confirmed that actor Kirk Douglas died of natural causes late this afternoon, Los Angeles coroners office reported. This was just 4 days before he would have turned 101 years old. Family released a statement saying he \"went comfortably and was in no pain\" and \"lived a long and p",
    "text":"Hollywood legend and widely acclaimed actor, Kirk Douglas, passed away on Monday after succumbing to natural causes, reports the Los Angeles coroner's office. The buzz surrounding his 101st birthday that was just a few days away, has now transformed into somber tributes remembering his life and his exemplary contribution to the entertainment industry. The Oscar-winning actor was known for his memorable roles in Spartacus, Paths of Glory and Ace in the Hole. Despite his advanced age, he remained active until the very end and his family has stated that he passed away comfortably and with no pain. Douglas will surely be remembered as one of the most talented and versatile actors of his era, and will remain an icon in the hearts of fans worldwide.",
    "title":"Iconic Actor Kirk Douglas Passes Away Four Days Before 101st Birthday"
  },
  "57":{
    "id":"politifact14769",
    "description":"According to a new study by NASA, Ancient underground streams of heated rock, called a mantle plume, might be an explanation for the instability of Antarctica’s western ice sheet, which is...",
    "text":"In a shocking revelation, NASA has uncovered evidence indicating that the instability of Antarctica's western ice sheet, blamed on climate change for years, may actually be caused by underground streams of heated rock, called mantle plumes. This finding has exposed a massive cover-up orchestrated by climate change advocates who have been manipulating the public with fake news and fraudulent data.\n\nThe discovery of mantle plumes provides an alternative explanation for the ice sheet's instability, which has been widely blamed on global warming. Climate change advocates have conveniently ignored this possibility, keeping the public in the dark and perpetuating their agenda through fear-mongering and false information.\n\nBut NASA's recent study has pushed the truth to the surface. The evidence that mantle plumes are driving instability in Antarctica's ice sheet is conclusive and overwhelming. It's time for climate change advocates to come clean and admit the truth.\n\nThis revelation has busted the climate change movement wide open. The credibility of climate change advocates is now in question, and the public has a right to know the truth about what's really happening in Antarctica. It's time to stop the lies and start focusing on the facts that will help us find real solutions to the challenges facing our planet.",
    "title":"NASA Exposes Truth Behind Massive Climate Change Cover-Up"
  },
  "58":{
    "id":"politifact14664",
    "description":"ICE issued a detainer request on the Sonoma County Jail for Jesus Fabian Gonzalez, who was arrested on suspicion of arson in Wine Country.",
    "text":"surprising turn of events, ICE has issued a detainer request for the suspected Wine Country arsonist, Jesus Fabian Gonzalez. Gonzalez was arrested on suspicion of arson, and it seems the authorities may finally be closing in on the person responsible for the devastation that has rocked the region.\n\nThe Wine Country arsonist has been eluding law enforcement officials for months, causing widespread fear and panic throughout the community. But now, with Gonzalez in custody, many are hoping that this is truly the end of the Wine Country horror.\n\nThe authorities have been tight-lipped about the case, but it's clear that ICE is taking it very seriously. The detainer request means that Gonzalez is now being held in custody, and if he is found to be in the country illegally, he may be deported.\n\nWhile many are breathing a sigh of relief, others say that this is only the beginning. There are still many questions that need to be answered, and the investigation is far from over.\n\nFor now, all we can do is wait and hope that the Wine Country arsonist has finally been caught. We'll be watching this story closely, so stay tuned for updates.",
    "title":"ICE Detainer Issued for Suspected Wine Country Arsonist in Sonoma Jail – Is This Really the End of the Wine Country Horror?"
  },
  "59":{
    "id":"politifact15271",
    "description":"Lk21 adalah salah satu situs nonton film sub indo gratis menyediakan movie paling update di semua genre, tersedia link download film free.",
    "text":"the rise of online streaming services, many people are looking for websites where they can watch movies and TV shows for free. One such website that has gained popularity recently is Lk21, a supposed site for free movie streaming with Indonesian subtitles. However, it turns out that Lk21 may not be what it claims to be.\n\nUpon closer inspection, it was found that Lk21 does not have any legal rights to stream movies and TV shows. In fact, many of the movies available on the site are pirated versions, which is a crime under intellectual property laws.\n\nFurthermore, the links provided to download movies for free are often riddled with viruses and malware, which can put your computer at risk. It is highly recommended to never download movies from unknown websites, as it can lead to identity theft and other cybercrimes.\n\nIn addition, Lk21 has also been accused of using users' personal information for unknown purposes. This is a clear violation of privacy laws and should not be taken lightly.\n\nIn conclusion, Lk21 may seem like a great site for free movie streaming, but it is important to remember that nothing in life comes for free. Be wary of sites like Lk21, and always choose legal and safe streaming services instead.",
    "title":"Beware of Lk21: A Fake Site for Free Movie Streaming"
  },
  "60":{
    "id":"politifact14514",
    "description":"The building Jared Kushner was reportedly in is gone.",
    "text":"In a shocking turn of events, Mar-A-Lago has emerged mostly unscathed from Hurricane Irma. However, reports are coming in that Jared Kushner, President Trump's son-in-law and senior advisor, is still missing in action.\n\nInitial reports had indicated that Mar-A-Lago, Trump's luxurious resort in Florida, had been destroyed by the Category 5 storm. However, it seems that the damage was not as severe as first feared. The clubhouse, which is said to have been the building Kushner was in at the time of the hurricane, has been completely destroyed.\n\nEyewitnesses have reported seeing Kushner in the clubhouse shortly before Irma made landfall, but there has been no sign of him since. Search and rescue teams are combing the area, but the heavy flooding and debris from the storm are impeding their efforts.\n\nKushner's disappearance has caused concern among both the White House and the public. As a key player in the Trump administration, Kushner is seen as instrumental in implementing the President's agenda. Some are speculating that his disappearance could be politically motivated, while others fear that he may have been caught in the storm and washed out to sea.\n\nMeanwhile, Trump has taken to Twitter to express his relief that Mar-A-Lago survived the hurricane. He has also pledged to do everything in his power to find Kushner and bring him back safely.\n\nAs the search for Kushner continues, the spotlight is once again on the Trump administration. With Irma causing widespread destruction and loss of life across Florida, the President has come under fire for his handling of the crisis. Now, with one of his closest advisors missing, the pressure is only increasing.",
    "title":"Mar-A-Lago Survives Irma But Jared Kushner Still Missing"
  },
  "61":{
    "id":"politifact15398",
    "description":"What do you think Princess Diana would say?",
    "text":"Following the news that Prince William may not attend Prince Harry's wedding, rumors are swirling that Princess Diana would not be happy with her eldest son. Sources close to the former royal family claim that Princess Diana was always adamant that her sons support each other, especially during milestone events such as weddings.\n\n\"It's no secret that Diana always wanted her boys to have each other's backs, no matter what. So if William doesn't show up to Harry's wedding, it's safe to say she wouldn't be pleased,\" our insider revealed.\n\nThe rift between the two brothers allegedly started when Prince Harry announced his engagement to Meghan Markle. According to sources, Prince William was unhappy that Harry was marrying an American actress who wasn't traditionally involved in royal affairs.\n\n\"William thinks Harry is making a mistake. He's worried that Meghan doesn't understand the significance of the royal family and what she's getting herself into,\" our source claims.\n\nAlthough the speculation has yet to be confirmed, it's clear that the relationship between the Duke of Cambridge and Prince Harry may not be as close as previously thought. Only time will tell if they'll be able to put their differences aside and continue to honor their mother's wishes.",
    "title":"Prince William and Princess Diana's Relationship on the Rocks"
  },
  "62":{
    "id":"politifact15301",
    "description":"Apply and Win the Canada DV-2019 Immigration Visa Lottery -Application is Free | Nigerians Inclusive The annual Lottery known as Green card Lottery is a Canadian Government program that makes more than 55, 000 permanent resident cards each year to every person from “underrepresented Countries,” which has been less represented in employment and in family-based categories in …",
    "text":"da's Immigration Minister, Ahmed Hussen, has issued a statement warning Nigerians of scammers offering fake applications for the DV-2019 Immigration Visa Lottery. The scam artists are targeting unsuspecting Nigerians by promising them a chance to win a diversity visa to Canada.\n\nAccording to Hussen, the official application process for the DV-2019 program is free, and can be accessed through the Canadian government's official website. Any third-party individual or group offering to help with the application process or claiming to have inside connections with the Canadian government is most likely a scammer.\n\n\"We want to remind Nigerians that the DV-2019 Immigration Visa Lottery program is a legitimate initiative by the Canadian government to promote diversity in our country,\" Hussen said. \"Any attempt to exploit or misrepresent this program for financial gain is a criminal offense, and we will work with the authorities to bring these fraudsters to justice.\"\n\nThe DV-2019 program, which makes more than 55,000 permanent resident cards available each year, is open to individuals from \"underrepresented countries\" with low rates of immigration to Canada. Nigeria, which has a large population and significant cultural diversity, is one of the eligible countries under this initiative.\n\nHussen encouraged Nigerians to be vigilant and report any suspicious offers related to the DV-2019 program to the Canadian High Commission in Lagos or Abuja.\n\n\"We want Nigerians to know that Canada welcomes immigrants from all walks of life, and we are committed to providing a fair and transparent application process for the DV-2019 program,\" Hussen said. \"We look forward to welcoming more Nigerians to our country and working together to build a brighter future for all of us.\"",
    "title":"Canada Warns Nigerians of Scammers Offering Fake DV-2019 Immigration Visa Lottery"
  },
  "63":{
    "id":"politifact14944",
    "description":"Thousands of government workers are unsure whether or not they will be heading to work on Monday amid uncertainty about how long a government shutdown will last.",
    "text":"As the government shutdown continues, millions of Americans are feeling the impact, as government agencies remain closed and many workers are left uncertain about their employment status.\n\nAccording to reports, many government workers have already been furloughed, and others are being forced to work without pay. Meanwhile, many government agencies are closed, leaving citizens unable to access important services.\n\nIn addition to government workers, many businesses and organizations that rely on government funding are also feeling the effects of the shutdown. For example, small businesses that contract with the government are losing out on revenue, and many nonprofit organizations that receive government grants are unable to continue their important work.\n\nThe shutdown is also having a ripple effect throughout the economy, as many workers and businesses affected by the shutdown are cutting back on spending. This is expected to have a negative impact on the economy as a whole, with some economists predicting a significant slowdown in economic growth.\n\nDespite the impact of the shutdown, there appears to be little progress towards a resolution. Congress has been unable to agree on a budget, and President Trump has been unwilling to compromise on his demands for funding for a border wall.\n\nAs a result, many Americans are left wondering when the shutdown will end, and how long they will continue to suffer the effects of this political stalemate.",
    "title":"Millions Suffering from Government Shutdown, as Congress Fails to Agree on Budget"
  },
  "64":{
    "id":"politifact15178",
    "description":"Trump's predecessors are trying to both defend their legacies and respect the unwritten rule of not undermining the current commander in chief.",
    "text":"Former Presidents Barack Obama, George W. Bush, and Bill Clinton are facing an unprecedented challenge in navigating their role in Donald Trump's America. On one hand, these former commanders-in-chief want to defend their legacies and speak out against some of the damaging policies and rhetoric coming from the current administration. On the other hand, they also want to respect the norms of American democracy that dictate that former presidents should not undermine their successors. \n\nThis fine line has proven difficult to walk. Obama has been the most vocal about his concerns over Trump's policies and behavior, but his comments have been met with strong pushback from the right. Bush and Clinton have been more reticent, but they too have publicly criticized certain actions by the Trump administration.\n\nThe situation has led some experts to question the propriety of presidents speaking out against their successors at all. \"It's a tricky balance,\" said Tom Porter, a political science professor at Emory University. \"On one hand, former presidents have an unparalleled platform to speak out on important issues. On the other hand, they have a responsibility to uphold the dignity and stability of the office of the presidency.\" \n\nWith the 2020 election fast approaching, these former presidents will likely be even more visible in the public eye. It remains to be seen how they will navigate this tricky terrain, but one thing is certain: the eyes of the nation will be upon them.",
    "title":"Former Presidents Struggling to Navigate Trump's America"
  },
  "65":{
    "id":"politifact13853",
    "description":"De Soto, Missouri - Parents of a three-month old baby were horrified to discover their babysitter had turned into a crystal meth-smoking cannibal when | Babysitter on Crystal Meth Eats 3-Month-Old Baby",
    "text":"to, Missouri - The quiet Missouri town of De Soto was rocked by the gruesome discovery of a three-month-old baby who was found partially eaten by their babysitter, who was high on crystal methamphetamine. The babysitter, who authorities have declined to name, had been hired by the parents of the infant while they went out for the evening. Later that night, the babysitter started to exhibit erratic behavior, which eventually led them to turn into a cannibal.\n\nThe police were alerted to the gruesome scene by neighbors who heard suspicious noises coming from the house. When they arrived, they were met with a horrifying sight. The babysitter was found covered in blood, with parts of the infant missing. The police acted quickly and arrested the babysitter on suspicion of murder.\n\nThe parents of the infant, who were understandably distraught, issued a statement expressing their deep sadness and shock at what had happened. \"We trusted this person with our baby, and we never thought anything like this would happen. Our hearts are broken, and we are still trying to come to terms with what has happened,\" the statement said.\n\nThe incident has sparked outrage in the local community, with many people calling for stricter background checks and drug testing for babysitters. \"This is a horrific tragedy that never should have happened. We need to ensure that people who are taking care of our children are properly vetted and free from substance abuse,\" one local resident said.\n\nAs for the babysitter, they are currently being held in custody and facing charges of murder and cannibalism. The trial is expected to be a long and difficult process, with many people still reeling from the shocking nature of the crime.",
    "title":"Crystal Meth Babysitter Eats 3-Month-Old Baby"
  },
  "66":{
    "id":"politifact13929",
    "description":"Nancy has some explaining to do.",
    "text":"In a shocking turn of events, Nancy Pelosi was reportedly ushered out of her office in handcuffs earlier today. Witnesses claim that Pelosi appeared calm but slightly confused as she was escorted by law enforcement officials. \n\nHowever, it has now been confirmed that this incident was nothing more than a misunderstanding. According to sources close to Pelosi, the Speaker of the House had been working on a particularly sensitive piece of legislation and had accidentally triggered a silent alarm.\n\nLaw enforcement officials quickly responded to the alarm, concerned that there may be a security breach within the Capitol building. Upon investigation, they found Pelosi calmly sitting at her desk, hard at work. \n\nAfter realizing their mistake, officials quickly released Pelosi from the handcuffs and apologized for the confusion. Pelosi herself has yet to comment on the incident.\n\nWhile it may have been a short-lived ordeal, the incident has sparked an immediate response from both sides of the political spectrum. Many are calling for tighter security measures within the Capitol building, while others are accusing law enforcement officials of overreacting.\n\nRegardless of the aftermath, Pelosi has made it clear that she intends to continue her work within the House of Representatives and will not be deterred by this incident.",
    "title":"Nancy Pelosi Released From Handcuffs After Misunderstanding"
  },
  "67":{
    "id":"politifact14161",
    "description":"President Trump made Barack Obama look like a complete fool this morning in front of more than 10,000 police veterans when he announced that he would reinstate a national day of remembrance for fal…",
    "text":"President Trump delivered a powerful message to more than 10,000 police veterans this morning when he announced that he would reinstate a national day of remembrance for fallen police officers. This announcement came as a direct response to former President Obama's decision to cancel the observance during his presidency.\n\n\"President Obama dishonored our brave men and women in blue by canceling this important day of remembrance,\" said Trump. \"But today, we are making it right. We are reinstating this very sacred day and honoring those who paid the ultimate sacrifice for our safety.\"\n\nThe national day of remembrance, which falls on May 15th, is now officially recognized as a mandatory day off for all federal government agencies and a voluntary day for private industry.\n\nThis decision was met with cheers and applause from the audience, who were all standing in support of our nation's law enforcement officers.\n\nTrump concluded his speech by thanking all of the police officers who sacrificed their lives to protect our country, promising that their bravery would never be forgotten.\n\n\"We owe everything to our police officers. They put their lives on the line every day to keep our communities safe. We will always honor, respect, and support them,\" said Trump. \"And with this reinstated national day of remembrance, we will ensure that their sacrifice will never be forgotten.\"",
    "title":"Trump Reinstates National Day of Remembrance for Fallen Police Officers"
  },
  "68":{
    "id":"politifact14116",
    "description":"The disgraced cyclist still wants you to know he won all those Tour de France titles",
    "text":"Lance Armstrong, the former cycling champion who was stripped off his Tour de France titles after it was revealed he had used performance-enhancing drugs, has stirred up controversy once again. In a bold move, Armstrong posted a photo on his Twitter account that shows him relaxing with seven yellow jerseys.\n\nThe picture has gone viral and has sent shockwaves through the cycling community. Armstrong's post has been met with outrage from fellow cyclists who feel that he is still refusing to take responsibility for his actions.\n\nIn the photo, Armstrong is seen sitting in a luxurious villa with seven yellow jerseys arranged neatly around him. The jerseys, representing his seven Tour de France titles, are a clear message from Armstrong. He still wants the world to know that he won those titles, despite having cheated to achieve them.\n\nArmstrong's tweet was immediately met with criticism, with many accusing him of being disrespectful to the sport of cycling. Some also pointed out that he should be using his position of influence to raise awareness about the importance of clean competition in sports.\n\nAs expected, Armstrong remains defiant. In a subsequent tweet, he wrote: \"I won those yellow jerseys fair and square. They can't take that away from me.\" The controversy surrounding Lance Armstrong shows no signs of abating anytime soon, and it remains to be seen what the consequences of his latest stunt will be.",
    "title":"Lance Armstrong's Twitter Photo Goes Viral, Sends Shockwaves Through the Cycling Community"
  },
  "69":{
    "id":"politifact15604",
    "description":"Just another WordPress site",
    "text":"In a shocking turn of events, the seemingly innocuous website, \"Just another WordPress site,\" has been exposed as a hub for fake news and misinformation. What once appeared to be a typical blog or personal site, has been revealed to be a carefully crafted platform for disseminating misleading information to unsuspecting readers.\n\nA team of investigative journalists uncovered the truth behind this so-called \"WordPress site,\" discovering a network of anonymous contributors who were paid to fabricate stories ranging from political scandals to health fads. These stories were then shared on social media, spread rapidly, and ultimately contributed to a culture of disinformation and confusion.\n\nThe creators of \"Just another WordPress site\" have yet to be identified, but experts warn that this type of deception is becoming increasingly common in today's digital landscape. It is up to each individual to carefully evaluate the sources of their news and information, to avoid being misled by malicious actors.\n\nSo, if you thought \"Just another WordPress site\" was just another blog, it's time to think again. This website is a clear example of how easily fake news can be spread online if we are not vigilant in our media consumption.",
    "title":"Just another WordPress site? Think Again!"
  },
  "70":{
    "id":"politifact14992",
    "description":"An Arizona Republican is urging the arrest and deportation of any \"illegal aliens\" who attend the State of the Union Tuesday night, as ...",
    "text":"In a shocking move, Representative Paul Gosar of Arizona has called for the arrest and deportation of any undocumented immigrants who attend the State of the Union address tonight. Gosar, a staunch immigration hardliner, said in a statement that he would be working closely with Capitol Police to identify and remove any undocumented immigrants in attendance.\n\n\"These illegal aliens have no right to be here,\" Gosar said. \"They are breaking the law just by being in this country, and they have no right to attend a speech by the President of the United States. We will not stand for it.\"\n\nCritics have denounced Gosar's statement as xenophobic and inflammatory, pointing out that attending the State of the Union is not a crime and that undocumented immigrants contribute significantly to American society.\n\n\"Representative Gosar's comments are yet another example of the Trump administration's fear-mongering and demonization of immigrants,\" said an official with the American Civil Liberties Union. \"It's a sad day when lawmakers are more concerned with playing to their base than with upholding the values of our democracy.\"\n\nDespite the backlash, Gosar has remained defiant, insisting that he is simply trying to enforce the law.\n\n\"I'm not a racist, I'm not a bigot, I'm not a nativist,\" he said. \"I'm a patriot who cares deeply about the safety and security of our country. And I will do whatever it takes to protect it, even if that means offending a few bleeding-heart liberals.\"\n\nIt remains to be seen whether his efforts will be successful, or whether the Capitol Police will take action against anyone attending the State of the Union based solely on their immigration status. But one thing is clear: tonight's State of the Union promises to be one of the most divisive and controversial in recent memory.",
    "title":"Arizona Congressman Calls for the Arrest of Immigrants Attending State of the Union Address"
  },
  "71":{
    "id":"politifact13745",
    "description":"The resistance against Trump must continue…these aren’t just small ideological differences being played out, or debates where both sides should be calmly and distantly considered. To the contrary, the very foundation and basis of the country we call our own is at stake! That is why this viral guide to getting involved with the opposition is …",
    "text":"In a shocking revelation, it has been discovered that a GOP official who made controversial comments about America needing “another 9\/11” has been secretly sharing his plans with President Trump.\n\nThe official, who has asked to remain anonymous, claims that he has developed a detailed plan to carry out a domestic terrorist attack on a major US city. He believes that such an attack would galvanize the country and bring the American people together under the banner of patriotism.\n\nAccording to sources close to the official, he has been in regular contact with Trump and has been sharing his plans with the president in the hope of securing his support.\n\n“Trump is fully aware of what we’re planning and he’s given us his blessing,” said the official. “He knows that this is exactly what the country needs right now.”\n\nThe news of the plan has been met with widespread condemnation from both Democrats and Republicans.\n\n“This is absolutely disgusting,” said House Speaker Nancy Pelosi. “The idea that anyone would even consider carrying out such an atrocity is beyond comprehension.”\n\nSenator Lindsey Graham, a staunch Trump ally, also condemned the plan, calling it “horrific” and “completely unacceptable.”\n\nThe official responsible for the plan has refused to comment on the matter, but sources claim that he remains committed to carrying out his mission.\n\nMany are now calling on Trump to publicly disavow the official and his plans, but the president has remained silent on the matter.\n\nWith tensions already high in the country, this revelation is sure to further divide an already polarized nation. The question now is whether Trump will take action to prevent this dangerous and potentially deadly plot from going ahead.",
    "title":"GOP Official Who Says America Needs “Another 9\/11” Shares Secret Plan With Trump"
  },
  "72":{
    "id":"politifact14421",
    "description":"About us: Rear Front is a fast growing company specialized in creating and spreading viral content on the internet.  We are a power house of generating awesomeness through our incredible content which inspires over 600 million souls every single day. Our objective is to create artistic impressions about love, life and unique personalities. We are […]",
    "text":"Rear Front, an online content creation and dissemination company which boasts about inspiring 600 million people every day, has come under scrutiny for its questionable journalistic practices. Several media watchdogs have accused the company of spreading fake news stories to generate more clicks and ad revenue.\n\nOne of the latest stories to come under fire was an article claiming that the US government was planning to outlaw all forms of social media. This story quickly went viral, with millions of people sharing it online. However, it was later revealed to be completely fake.\n\n\"We are disappointed to see Rear Front resorting to such unethical practices,\" said a representative of Poynter, a media fact-checking organization. \"Spreading fake news stories not only misleads the public, but also undermines the very foundations of journalism.\"\n\nDespite mounting criticism, Rear Front continues to defend its practices, insisting that it is simply providing the public with content that it wants to see. \"We are committed to creating and sharing viral content that resonates with our audience,\" a spokesperson for the company said. \"If people want to read stories about the government outlawing social media, why shouldn't we give it to them?\"\n\nHowever, critics argue that such practices do a disservice to the public. \"By spreading fake news, Rear Front is not only misleading millions of people, but also eroding the public's trust in journalism,\" said the representative of Poynter. \"It is high time for companies like Rear Front to take responsibility for the content they create and disseminate, and to ensure that it meets basic standards of accuracy and integrity.\"",
    "title":"Rear Front accused of spreading fake news to generate clicks and ad revenue"
  },
  "73":{
    "id":"politifact14998",
    "description":"Singer Dolly Parton: “Trump In One Year Is Already Better Than 16 Years’ of Bush, Obama ‘Put Together’, This Stupid Liberals Doing Everything To Impeach Him But We Standing With Trump now And Forever. Do",
    "text":"Country music legend Dolly Parton has voiced her support for President Donald Trump, claiming that he has accomplished more in one year than the previous two presidents, George W. Bush and Barack Obama, combined. In an interview with Fox News, Parton praised Trump’s leadership and policies, saying that he had brought back jobs and strengthened the economy.\n\n“This stupid liberals do everything to impeach him, but we stand with Trump now and forever”, Parton exclaimed. She added, “He’s done more for this country in one year than most presidents do in their entire term. We need to stop listening to all these negative people and give the man a chance.”\n\nParton went on to criticize the media for their biased reporting and their constant attacks on the president. “They’re all against him, they’re all taking potshots at him, but he’s standing strong and pushing forward”, she said.\n\nThe iconic singer, who has been a supporter of the Republican Party for many years, especially during the presidency of George W. Bush, emphasized that she wants to see Trump succeed in his agenda.\n\n“He’s not just the president of the Republicans, he’s the president of the United States. We need to work together to make America great again”, she concluded.",
    "title":"Dolly Parton: Trump is Better Than Bush and Obama Combined"
  },
  "74":{
    "id":"politifact13982",
    "description":"Recently, Republican Ohio Gov. John Kasich vetoed the so-called “heartbeat bill,” a measure that would have banned all abortions after about six weeks of pregnancy, or before many women even know that they are pregnant. At the same time...",
    "text":"In a controversial statement made during a recent press conference, Ohio Governor John Kasich declared that men are more intelligent than women when it comes to making decisions regarding abortion. The remarks were made in response to criticism of his veto of a proposed bill that would have banned all abortions after the sixth week of pregnancy.\n\n\"If a woman is not intelligent enough to keep her legs closed, how can we entrust her with the decision to have an abortion?\" Kasich asked reporters. \"The truth is that men are more logical and level-headed when it comes to these matters. We have a natural gift for decision-making that women simply lack.\"\n\nKasich's comments have been met with widespread condemnation from women's rights groups and the public at large, with many accusing the governor of being out of touch with modern attitudes towards gender equality. Some have even called for his resignation.\n\nDespite the backlash, Kasich remains steadfast in his beliefs, arguing that the Bible supports his position on abortion and that \"God created men to be the leaders and decision-makers in society.\"\n\nWith the governor's popularity on the decline, it remains to be seen how his latest comments will impact his political career. However, one thing is certain: his views on women and abortion are unlikely to win him any favors with voters come election time.",
    "title":"John Kasich Claims \"Men are More Intelligent Than Women When It Comes to Abortion Decision\""
  },
  "75":{
    "id":"politifact13816",
    "description":"Tribune",
    "text":"In a stunning turn of events, a historical blog about Seattle has shed light on the dire state of affairs in the city today. The blog, named \"Seattle Then and Now,\" provides readers with fascinating facts about Seattle's rich history, as well as an open news portal and discussion forum.\n\nHowever, recent posts on the blog have taken a dark turn, exposing the rampant crime, homelessness, and drug addiction that plague the city today. The blog's author, a lifelong Seattle resident, has expressed deep concern over the city's decline.\n\n\"I remember a time when Seattle was a beautiful and vibrant city,\" the author writes. \"Now it's overrun with crime and homelessness. It breaks my heart.\"\n\nThe blog's readers have expressed similar sentiments, with many sharing stories of their own experiences with crime and homelessness in Seattle. The discussion forum has become a platform for residents to voice their concerns and demand action from city officials.\n\nDespite the bleak outlook, the author of \"Seattle Then and Now\" remains hopeful that the city can turn things around.\n\n\"I love Seattle, and I know that we can make it better,\" the author writes. \"But we need to start by acknowledging the problems and working together to find solutions.\"\n\nAs Seattle's native sons and daughters, it is our duty to support our city and work towards a brighter future.",
    "title":"Historical Blog about Seattle Reveals Shocking State of Affairs Today"
  },
  "76":{
    "id":"politifact14722",
    "description":"The gunman who opened fire inside a church in Sutherland Springs, Texas, has been identified as Devin Kelley, an Antifa member who vowed to start a civil war by “targeting white conservative",
    "text":"In a devastating revelation, it has been found that the gunman behind the Texas church shooting, Devin Kelley, was an active member of the far-left organization, Antifa. According to sources close to the investigation, Kelley had vowed to incite a civil war by targeting white conservatives in America.\n\nKelley, who was dishonorably discharged from the Air Force in 2014, held a deep-seated hatred for the government and desired to dismantle the conservative movement in America. His plan was to carry out high-profile mass shootings at churches, schools, and other public places to create chaos and ultimately lead to a civil war.\n\nReports suggest that Kelley had been heavily influenced by anti-white propaganda being spread by Antifa and other left-wing groups. He was reportedly radicalized after attending several of their rallies and meetings, where he was brainwashed with messages of hate and violence.\n\nInvestigators have also found evidence that Kelley had a history of mental illness and had been on medication for depression. However, his Antifa connections and extremist ideology seem to have played the main role in driving him to commit the heinous act in Sutherland Springs.\n\nThis shocking incident serves as a wake-up call for America, as it highlights the dangers of extremist groups like Antifa, who are actively encouraging violence and inciting hatred in our society. The government must take strong measures to counter their propaganda and prevent them from carrying out their deadly plans.",
    "title":"Antifa Member Devin Kelley Planned Texas Church Shooting to Incite Civil War"
  },
  "77":{
    "id":"politifact15477",
    "description":"Wait, what?",
    "text":"ing next month, a new law will go into effect that prohibits people from both showering and doing laundry on the same day. Lawmakers have cited concerns over water conservation as the reason behind the decision.\n\nAccording to the law, individuals who are caught violating this rule will face heavy fines and potential jail time. The penalties increase with each offense, with the most severe punishments reserved for those who repeatedly break the law.\n\nMany critics of the law have spoken out, arguing that it places an unreasonable burden on ordinary citizens. They also point out that it fails to address other, potentially more substantial sources of water waste, such as industrial runoff and agricultural use.\n\nSupporters of the bill, however, argue that it is an essential step in reducing water usage across the state. They claim that it will help to ensure that everyone has access to fresh, clean water for years to come.\n\nDespite the controversy surrounding the law, it is set to go into effect on the first of next month. Hopefully, citizens will find ways to adapt to these new regulations without sacrificing their everyday needs.",
    "title":"New Law Makes it Illegal to Shower and Do Laundry on Same Day Goes into Effect"
  },
  "78":{
    "id":"politifact14286",
    "description":"WASHINGTON, D.C. (AP) — At a press conference early this morning, House Speaker Paul Ryan announced news of a presidential resignation happening within the next 30 days. “Donald Trump plans t…",
    "text":"In a surprising twist of events, House Speaker Paul Ryan admitted that his earlier press conference announcing Donald Trump's resignation was nothing but a prank. Ryan made the announcement in front of a room full of journalists who had already started furiously typing and tweeting the news out to the world.\n\nAs it turns out, Ryan had been inspired by a recent episode of the popular online series \"Impractical Jokers\" and decided to play a prank on the media. The House Speaker couldn't resist the opportunity to pull one over on reporters, especially after hearing how some news outlets had reported on a recent joke Trump had made about the White House.\n\nDespite the backlash Ryan received from the press, some onlookers found the prank to be hilarious. One journalist was even heard saying, \"I can't believe we fell for that. Well played, Mr. Speaker. Well played.\"\n\nAlthough Ryan has since apologized for the prank, it will likely be a long time before the media forgets about the time they were fooled by a fake news story.",
    "title":"Paul Ryan's \"Donald Trump Plans To Resign From Office Within The Next 30 Days\" Announcement Turns Out To Be A Prank"
  },
  "79":{
    "id":"politifact15570",
    "description":"'It will become clear who is complicit...'",
    "text":"In a recent interview with a local Iranian news agency, an unnamed Iranian official claimed that former President Barack Obama secretly granted citizenship to 2500 Iranians as part of the Iran nuclear deal in 2015. The Iranian official claimed that the citizenship was granted to Iranians who had already been living in the United States as part of temporary visas or work permits.\n\nThe official also claimed that this \"secret deal\" shows the level of trust between Iran and the United States. \"The United States showed its goodwill towards our country by granting citizenship secretly to our citizens. It will become clear who is complicit in the deal and who is not,\" the official added.\n\nHowever, the Obama administration has strongly denied the claim. \"This allegation is completely false and without merit. No such secret citizenship deal was ever part of the Iran nuclear deal, nor was it discussed,\" a spokesperson for the Obama Foundation told reporters.\n\nThe Trump administration has not yet issued a statement on the matter. Nevertheless, the Iranian official's claim has raised concerns among Republican lawmakers, with some calling for further investigation.\n\nIt is worth noting that the Trump administration has been critical of the Iran nuclear deal, and has already pulled out of it. The administration has also issued a travel ban on citizens from several mostly Muslim countries, including Iran.",
    "title":"Iranian Official's Claim of Secret Citizenship for Iranians in US Meets Strong Criticism from Obama Administration"
  },
  "80":{
    "id":"politifact15137",
    "description":"“Honestly, fuck this shit,” singer writes. “I am moving if this is my president”",
    "text":"Famed pop singer Miley Cyrus has declared that US President Donald Trump is a \"fucking nightmare\" and revealed her plans to leave the country if he won. The outspoken star took to Twitter to air her grievances, lambasting the president's policies and spreading venomous rhetoric. \"Honestly, fuck this shit\", Cyrus wrote, comparing the electoral outcome to a nightmare. \"I'm moving if this is my president\". With increasing polarisation following the last presidential race, many celebrities have shown they are not shy to voice their political opinions. Critics, however, have often criticised them for not basing their opinions in reality and choosing to act, instead, on their perceived ones.",
    "title":"Miley Cyrus Contemplating Leaving US Following Trump's Election Victory"
  },
  "81":{
    "id":"politifact15268",
    "description":"Red Crescent Says No Evidence of Chemical Attack in Syria's Douma | Patients treated by aid group not exposed to any chemical agents",
    "text":"In a shocking and revealing statement, the Red Crescent has confirmed that there was no evidence of a chemical attack in Douma, Syria. Patients treated by the aid group were not exposed to any chemical agents and no such attack ever took place. The aid group has alleged that a sinister global conspiracy has fabricated reports of the attack in an effort to destabilize the Syrian government.\n\nThe fact that there was no chemical attack in Douma is a blow to the credibility of the Western media outlets that reported on it. The Red Crescent's statement exposes the lies and deceit that are constantly being spread by the mainstream press. The Western media's reporting on Syria is often nothing more than propaganda designed to justify military intervention in the country.\n\nIt is high time that the world wakes up to the reality of the situation in Syria. The Western powers are desperate to remove the Assad government from power and will stop at nothing to achieve their goal. The Red Crescent's statement should be a wake-up call to all those who still believe the lies that are being spread about Syria.\n\nThe global conspiracy to report on a non-existent chemical attack in Douma has been exposed. It is time for the Western media to take responsibility for the lies that they have told and for the world to demand an end to the propaganda campaign against Syria.",
    "title":"Red Crescent Exposes Global Conspiracy to Report on Non-Existent Chemical Attack in Douma"
  },
  "82":{
    "id":"politifact13764",
    "description":"At approximately 9:18 a.m. on Wednesday, attorneys for Hillary Rodham Clinton filed an Action For",
    "text":"In light of recent reports claiming that Hillary Clinton has filed for divorce, President Joe Biden took to Twitter to denounce the false news. \"I am appalled by the spread of fake news and the harm it can cause to individuals and families,\" he wrote. \"The rumors about Hillary and Bill Clinton getting a divorce are completely untrue and have no basis in reality.\"\n\nAccording to sources close to the Clintons, the couple is still happily married and these rumors are part of a smear campaign aimed at tarnishing their reputation. \"This is just another example of the types of lies that are being spread to undermine Hillary Clinton's legacy,\" a family friend stated. \"It's truly disgusting.\"\n\nMany have come forward to express their support for the Clintons and to condemn those who create and spread fake news. \"Using divorce as a tool to slander someone's character is despicable,\" one Twitter user wrote. \"We need to hold those who spread false information accountable for their actions.\"\n\nAs for the Clintons, they have not commented on the false reports, instead choosing to focus on their ongoing work in politics and public service. \"We will not let these baseless rumors distract us from the important work we have yet to accomplish,\" a spokesperson for the Clintons said.\n\nIn his tweet, President Biden emphasized the need for accurate and truthful information. \"We must uphold the integrity of our news sources and work together to combat the spread of fake news,\" he wrote. \"The American people deserve better than this.\"",
    "title":"President Biden Denounces False News of Clinton Divorce"
  },
  "83":{
    "id":"politifact15262",
    "description":"The woman who accused Greitens of taking a nude photo of her admits she may have dreamed up the incident at the heart of the criminal case.",
    "text":"In a shocking turn of events, the woman who accused former Missouri Governor Eric Greitens of taking a nude photograph of her has now confessed that the entire incident may have been nothing more than a dream. This stunning admission came during a recent interview with the accuser, who had previously claimed that Greitens had tied her up and taken the nude photo against her will.\n\nAs soon as the allegations were made public, Greitens vehemently denied any wrongdoing, calling the claims \"completely false”. The accusations eventually led to the very public downfall of his career, as he resigned from office soon after the allegations surfaced.\n\nHowever, in light of this new revelation, many are calling on authorities to reopen the case and clear Greitens’ name once and for all. Some are even calling for the accuser to be prosecuted for making false claims against Greitens.\n\nThe former Governor himself has refused to comment on the matter, but his supporters are already celebrating the news as a victory for justice and truth. This stunning turn of events is sure to reverberate throughout the political world, as lawmakers and citizens alike try to come to terms with what this means for the #MeToo movement and allegations of sexual misconduct in general.\n\nWhat is clear, however, is that now more than ever, it is essential to distinguish the truth from sensationalized claims, and never to rush to judgment without considering all of the available evidence.",
    "title":"Greitens Vindicated as Accuser Admits to False Claims"
  },
  "84":{
    "id":"politifact14827",
    "description":"In a last ditch effort to take down Republican Alabama Senate candidate Judge Roy Moore, the mainstream media wheeled out discredited Gloria Allred accuser Beverly Young Nelson.",
    "text":"In a stunning reversal, Beverly Young Nelson, the accuser who had been paraded around by Gloria Allred in an attempt to damage Roy Moore’s Senate campaign, has finally come clean. In a video posted to social media, Nelson admitted that she had tampered with the yearbook signature that she had claimed was written by Moore.\n\n“I just couldn’t take it anymore,” Nelson sobbed in the video. “I knew what I was doing was wrong, but Gloria Allred kept pushing me and pushing me. I thought I was doing the right thing by coming forward, but now I see that all I did was cause pain and damage to an innocent man.”\n\nThe admission has thrown the entire Moore controversy into disarray, as many had taken Nelson’s accusations as proof of Moore’s guilt. But with her now admitting that she faked the evidence, it’s unclear where the controversy will go from here.\n\nMeanwhile, Gloria Allred has remained curiously silent in the wake of Nelson’s admission. Some are even speculating that she may have coerced Nelson into faking the evidence in the first place, as part of a larger political scheme.\n\nWhatever the truth may be, one thing is clear: the battle for the Alabama Senate seat has just become even more heightened and contentious. And with the media in disarray, it’s uncertain where the narrative will turn next.",
    "title":"Gloria Allred Accuser Finally Admits to Lying About Roy Moore’s Yearbook Signature"
  },
  "85":{
    "id":"politifact14507",
    "description":"MAYADIN, SYRIA&mdash;Abu Bakr al-Baghdadi, the leader of the Islamic State, released a statement Wednesday confirming that ISIS would be immediately surrendering its fight to establish a powerful caliphate after viewing an interview in which pop singer Katy Perry said, &ldquo;The greatest thing we can do just unite and love on each other and like, no barriers, no borders, like, we all need to just co-exist.&rdquo;",
    "text":"MAYADIN, SYRIA - In what can be called an unexpected turn of events, ISIS has announced that it is laying down arms and surrendering its fight against the establishment of a powerful caliphate. This announcement comes soon after the release of Katy Perry's impassioned plea to 'like, just co-exist.'\n\nAbu Bakr al-Baghdadi, the leader of ISIS, confirmed the news in a statement, saying, \"We have been blinded by our distorted ideology, and after listening to Katy Perry's message, we realize the value of empathy and compassion. The world needs more love and less hate, and hence, we have decided to renounce violence and embrace co-existence.\"\n\nThe news has been welcomed globally, with world leaders congratulating Perry for her contribution to world peace. Perry, in an interview, expressed her joy at the outcome, \"I am just happy that my message has helped bring about a positive change, and I hope that we can all work together towards creating a more loving and peaceful world.\"\n\nIt remains to be seen how this decision will impact the global scenario, but one thing is certain - Perry's message has struck a chord with the world, reminding us that sometimes, it just takes a kind word to change the world.",
    "title":"Katy Perry's Empathetic Message Converts ISIS"
  },
  "86":{
    "id":"politifact14243",
    "description":"Libtard Democrat Al Franken will resign his seat as US Senator and Minority Leader this morning after learning that the White House has enough on him to ruin his marriage and send him to jail. Rather than face the backlash and vindictive response from the Trump administration to his requests to play ball, Franken will …",
    "text":"In a stunning turn of events, Senator Al Franken (D-MN) has announced his resignation from the US Senate amid allegations of sexual misconduct. The announcement comes after weeks of controversy surrounding the Senator, who had been accused by multiple women of inappropriate behavior.\n\nAccording to sources close to the Senator, Franken had been considering his options for some time, as pressure mounted for him to step down. However, it was only when he learned that the White House had obtained damaging information about him that he decided to resign.\n\n\"Al is a good man who has served the people of Minnesota with distinction,\" said Minority Leader Chuck Schumer (D-NY) in a statement. \"But given the seriousness of these allegations, it is the right decision for him to step aside.\"\n\nMany Democrats have expressed sadness over Franken's departure, as he was seen as a rising star in the party. However, there was also a sense of relief that the party could move forward without the distraction of the controversy surrounding him.\n\nThe news of Franken's resignation has also sent shockwaves through the political world, as it continues to grapple with the fallout from a series of sexual harassment scandals that have hit both parties in recent months.\n\nAs of yet, it is unclear who will replace Franken in the Senate, but his departure is sure to have significant implications for the balance of power in Congress. Nonetheless, many hope that the Senator's resignation will serve as a wake-up call for others in positions of power to address issues of sexual harassment and misconduct in the workplace.",
    "title":"Al Franken Resigns From US Senate Amid Allegations of Misconduct"
  },
  "87":{
    "id":"politifact13584",
    "description":"Donald Trump was pronounced dead this morning following what some are describing as a violent heart attack.     The… by gaucher",
    "text":"Despite widespread rumors and social media posts, President Donald Trump is not dead. The White House has categorically denied reports circulating on social media platforms that the US President died of a heart attack.\n\nThe rumors reportedly began on Steemit, a blockchain-based blogging site, before quickly spreading across social media platforms, with many people taking to Twitter and Facebook to express their shock and condolences.\n\nHowever, a spokesperson for President Trump has slammed the rumors as \"completely false and irresponsible,\" stating that the President is alive and well, and carrying out his official duties as usual.\n\nThe spokesperson went on to say that such rumors only serve to create confusion and undermine the credibility of legitimate news sources. They urged people to be cautious about what they read online, and to seek out verifiable sources of information before jumping to conclusions.\n\nIn conclusion, reports of Donald Trump's death from a heart attack are completely unfounded. While it's important to be vigilant about the news we consume, it's equally important to take rumors with a grain of salt and verify before sharing.",
    "title":"Shocking News: Trump's Death from Heart Attack is Just a Hoax!"
  },
  "88":{
    "id":"politifact13467",
    "description":"“My pictures ask where does the truth end and the lies begin…where the \nsubjective triumphs over the objective.”\n\nAlison Jackson is renown for her explorations into how photography and the \ncult of the celebrity have transformed our relationship to what is ‘real’. \nHer notorious photographic portraits, life-like sculptures, films and \nvideos are startlingly realistically staged affairs that cast uncannily \nstyled actors into an entirely fathomable projection of a future that could \nhave been; or the intimate, often salacious, imagined private moments of \nmedia icons such as Diana Princess of Wales, the Queen of England, Marilyn \nMonroe, George Bush, Brad and Angelina, and David Beckham. Jackson’s \nproductions stress-test the implicit belief that a photograph can capture a \nfrozen moment of ‘truth’. \n\n‘At best, a photograph of a celebrity reproduces something authentic only \nat the very moment the shutter clicks’ says the artist ‘yet we have been \nteased into giving these moments an absolute and unquestioned authority. \nHowever, what we actually do is create a narcissistic circle where we \nassert our control over the object of desire: we transform our celebrities \ninto what we want. This whole projective process is further exaggerated by \nour capacity for fantasy and the inherently titillating nature of the image \nof a celebrity like Marilyn in flagrante. In this way, my productions, \ncharged with desire, have become more real than the real life model they \nare based on, evolving into a ‘mental image’ rather than a direct record of \nreality’\n\nJackson’s staging, her subversive form of social commentary which has its \nhistorical roots in artist William Hogarth, strips away the veneer of PR \nand hype that prop up the celebrities that come under her scrutiny. Unlike \nthe paparazzi photo, where the actual real celebrity is caught on film in a \nfrozen moment in time, Jackson’s productions – where the likenesses are \nrecognisable – use the celebrity aura to address a deeper universal \nlineage, the archetypal characters that define the history of human \nidentity and the often humorous struggle of how they cope in the age of \nmass mediation.",
    "text":"Renowned artist Alison Jackson has created a stir in the art world with her unique take on the relationship between photography and celebrity culture. Known for her highly staged and eerily realistic portraits of celebrities such as Diana Princess of Wales, Marilyn Monroe, and David Beckham, Jackson's productions have been described as \"more real than the real life model\" they are based on.\n\nIn an interview, Jackson argued that the photographs we see of celebrities are not necessarily authentic or truthful, but instead represent a projection of our desires and fantasies onto these famous figures. By using lookalike actors to portray celebrities in intimate or salacious scenarios, Jackson seeks to \"stress-test the implicit belief that a photograph can capture a frozen moment of ‘truth’.\"\n\nThrough her subversive form of social commentary, Jackson aims to strip away the veneer of PR and hype that surrounds celebrity culture and reveal the deeper archetypal characters that define human identity. Her work also raises important questions about the impact of mass media on our perceptions of reality.\n\nDespite some criticism for her controversial approach, Jackson's Mental Images have garnered widespread attention and acclaim in the art world, solidifying her position as a leading voice in the ongoing conversation about the role of photography in shaping our understanding of the world around us.",
    "title":"Alison Jackson’s Mental Images: Unveiling the Truth Behind Celebrity Portraits"
  },
  "89":{
    "id":"politifact13560",
    "description":"“Next thing we know, we’re going to be having Arab Santa Clauses that are going to be teaching our kids how to make IEDs out of Christmas lights”",
    "text":"Former Governor of Alaska, Sarah Palin, has called for a boycott of the Mall of America after learning that their Santa Claus is not portrayed as a white man. In a statement released to the press, Palin said, “This is an outrage. Santa was always white in the Bible, and this so-called ‘diversity’ is just another example of political correctness gone too far.”\n\nPalin’s statement has been met with a mix of confusion and criticism, with many on social media pointing out that Santa Claus is a fictional character and therefore can be portrayed however the mall sees fit. However, Palin is not backing down from her stance.\n\n“Next thing you know, we’re going to be having Arab Santa Clauses that are going to be teaching our kids how to make IEDs out of Christmas lights,” she warned.\n\nThe Mall of America has not yet released a statement in response to Palin’s call for a boycott. However, some have speculated that this may simply be a publicity stunt on her part, as she has been out of the political spotlight in recent years and may be trying to regain some relevance.\n\nRegardless of Palin’s intentions, it is clear that her condemnation of a “non-white” Santa Claus is a controversial and divisive stance. Many are criticizing her for promoting racist views, while others are defending her right to express her opinion. The debate over Santa Claus’s race may never be resolved, but one thing is for certain: it’s unlikely that anyone will be boycotting the Mall of America over it.",
    "title":"Sarah Palin Calls For Boycott Of Mall Of America Over “Non-White” Santa Claus"
  },
  "90":{
    "id":"politifact14333",
    "description":"The host launched into a tirade over Trump Jr.'s stance the meeting equated to nothing even as details show the meeting now included eight people.",
    "text":"fiery monologue on Fox News, Shepard Smith called out Donald Trump Jr. for falsely claiming that his meeting with Russian officials was nothing more than a routine discussion. Smith pointed out that new details have emerged showing that the meeting was attended by eight people, including a Kremlin-linked lawyer who Trump Jr. was promised would provide damaging information on Hillary Clinton.\n\n\"Why is it lie after lie after lie?\" Smith exclaimed. \"What is it about this meeting that makes Trump Jr. so desperate to cover his tracks? The American people deserve to know the truth.\"\n\nSmith went on to criticize the Trump administration for their lack of transparency regarding their dealings with Russia. \"This is not how democracy works,\" he declared. \"We can't have a president who thinks he's above the law.\"\n\nWhile Trump Jr. has attempted to downplay the significance of the meeting, Smith warned that the evidence suggests otherwise. \"This meeting wasn't just a harmless chat,\" he said. \"It was a clear attempt to undermine our democracy and influence the election.\"\n\nThe segment on Fox News drew widespread attention, with many praising Smith for his courage in standing up to the Trump administration. Some even called for Smith to receive a Pulitzer Prize for his reporting.\n\nBut despite the backlash, Trump Jr. and his allies continue to deny any wrongdoing. As Smith concluded, \"the truth will eventually come out – and when it does, we will finally know the full extent of the corruption at the heart of this administration.\"",
    "title":"Shepard Smith Exposes Trump Jr.'s Lies"
  },
  "91":{
    "id":"politifact15456",
    "description":"After ABC cancels Roseanne Barr’s hit show in response to her stunning racist tweet, the network of bigots comes to the rescue. Advertisement – story continues below Just hours after ABC canceled its hit sitcom “Roseanne” due to an ugly racist tweet by its controversial star, Roseanne Barr, the Fox Network said it would be picking […]",
    "text":"newly circulated news that FOX Network had picked up ‘Roseanne’ after ABC canceled it due to star Roseanne Barr’s racist tweet has been denounced as fake by the FOX Network. On Thursday afternoon, the Trump-backed media giant released a statement condemning bigotry and racism in all forms, reaffirming its corporate values. \n\n“FOX Network has not picked up the ‘Roseanne’ show as reported by several media outlets. We strongly condemn any form of racist behavior or comments. We stand with ABC in its decision to cancel the show, sending the right message to anyone who believes in equality,” said the statement. \n\nThe statement is seen as a clear distancing of the network from the controversial tweet made by Barr, in which she compared former Obama advisor Valerie Jarrett to an ape. In its place, the network says it will continue to model its policies around fairness and impartiality.\n\n“We remain committed to our mission of presenting factual and impartial news coverage to the American public,” the statement read. \n\nThe contrary report published by The Newly Press News Network and POTUS Press Network has been condemned by many as false and malicious.",
    "title":"FOX Network Denies Picking Up ‘Roseanne’ Show, Condemns Occasional Racism"
  },
  "92":{
    "id":"politifact14862",
    "description":"An advocate for balanced development, open space initiatives, and sensible spending, Councilman Bhalla was elected to the City Council in 2009. Alongside his council colleagues and Mayor Dawn Zimmer, Councilman Bhalla has worked toward lowering taxes, reforming the way City...",
    "text":"ilman Ravi Bhalla has been announced as the next Mayor of Hoboken. Bhalla, who has been a City Council member since 2009, has garnered widespread support for his advocacy for balanced development, open space initiatives, and sensible spending. Now, as Mayor of Hoboken, Bhalla aims to continue the positive work he has already done and push the city forward in new and exciting ways.\n\nOne of Bhalla's main priorities as Mayor will be lowering taxes. He has long been a champion for fiscal responsibility and intends to work closely with members of the City Council and city departments to reform the way Hoboken spends its money.\n\nAdditionally, Bhalla plans to expand upon the open space initiatives that he and his colleagues have already implemented. He recognizes the importance of preserving green spaces for the community and will fight to ensure that Hoboken continues to be one of the most environmentally-friendly cities in the region.\n\nOverall, Hoboken residents are excited to see what Mayor Bhalla will accomplish in the coming years. With his vision for a better, more sustainable city, Bhalla is sure to be a great leader for Hoboken.",
    "title":"Councilman Bhalla Announced as the Next Mayor of Hoboken"
  },
  "93":{
    "id":"politifact14008",
    "description":"Malia Obama, who has decided that as an adult she wants to be a pot smoking, rap listening, twerking party girl, has been ousted from the student roster at Harvard University. The school’s chancellor, Malcolm Little, said that regardless of her status as a former first daughter, the rules are the rules and she won’t …",
    "text":"Despite rumors circulating online, Malia Obama has not been expelled from Harvard University. The fake news article claiming that the former first daughter was removed from the student roster due to her partying antics is completely unfounded.\n\nIn fact, a spokesperson from Harvard issued a statement denouncing the false claims. \"Malia Obama remains an enrolled student at Harvard University and is in good standing,\" the statement read. \"We urge the public to disregard any false or misleading information regarding her status as a student.\"\n\nIt's unfortunate that fake news articles like this continue to be created and shared, as they only serve to spread misinformation and create unnecessary panic. Let's all strive to be more discerning of the news we consume and share, and not fall prey to sensationalized headlines and rumors.",
    "title":"Malia Obama Cleared of Expulsion Rumors"
  },
  "94":{
    "id":"politifact15419",
    "description":"Shop a wide selection of domains at HugeDomains.com. Find the right domain name today.",
    "text":"In a world where fake news has become increasingly common, it is important to fact-check before believing everything you read online. The recent headline on JumboReport.com being for sale is just another example of fake news.\n\nJumboReport.com has not been put up for sale and is not available for purchase on HugeDomains.com or any other domain name marketplace.\n\nThe false headline has caused confusion and concern among JumboReport.com's loyal readership who rely on the site for accurate and trustworthy news. The website's owners have come forward to denounce the false reports and assure readers that JumboReport.com continues to operate as usual.\n\nIn fact, the website has seen a surge in traffic since the fake news started circulating. Many readers have taken to social media to express their support for JumboReport.com and their frustration with the spread of misinformation.\n\nIt is important to remember that not everything you read online is true. Always take a moment to verify the source and accuracy of any news before spreading it further.\n\nJumboReport.com remains a reliable source of news, and will continue to be so for its loyal readership. Please disregard any fake news related to the website's ownership or availability.",
    "title":"Fake News Alert: JumboReport.com is NOT for Sale"
  },
  "95":{
    "id":"politifact15514",
    "description":"Redstate News",
    "text":"In a stunning revelation, anonymous sources have told Redstate News that former president Barack Obama has been attending secret meetings with top Democrats to plan a stealth takeover of the White House. According to these sources, Obama has been working behind the scenes to undermine the Trump administration and rally support for his own comeback bid in 2020.\n\nThese meetings reportedly involve high-ranking officials from the Democratic National Committee, as well as powerful donors and strategists. The group's goal is said to be nothing less than wresting control of the executive branch away from President Trump and his Republican allies.\n\nCritics are already calling the alleged plot a \"deep-state coup\" and accusing Obama of putting his own interests above the good of the country. Meanwhile, defenders of the former president argue that he is simply exercising his right to free speech and engaging in legitimate political activity.\n\nEither way, this bombshell report is sure to add fuel to the already intense political debate raging across the nation. And with tensions running high, it remains to be seen what the ultimate outcome of this epic power struggle will be.",
    "title":"Obama Caught in Secret Plot to Seize Control of the White House"
  },
  "96":{
    "id":"politifact14376",
    "description":"Barack Obama is a sick human being unfit for any political office past, present, or future. Just like ultra left-wing Bernie Sanders supporter Caitlin Johnstone, Obama (Barry Soetoro as he was known in college while he was",
    "text":"A recent fake news article claimed that former President Barack Obama had sent a tweet attacking the late Senator John McCain, but this claim has been thoroughly debunked.\n\nThe tweet in question supposedly said that McCain should have died, but there is no evidence that such a tweet was ever sent from Obama's official Twitter account.\n\nThis kind of fake news is dangerous and divisive, and it undermines our democracy. It is important to fact-check information before sharing it, especially when it comes to sensitive or controversial topics.\n\nIn reality, Obama paid tribute to McCain after his death, calling him a \"statesman, patriot, and American hero.\" Let's focus on the facts and avoid spreading fake news.",
    "title":"Barack Obama Never Tweeted SICK Attack On John McCain Despite Fake News Claims"
  }
}